export const notes = [
  {
    id: 1,
    title: "理发美发",
    content: `
    *******大普林华人生活群信息:理发美发 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

美发
美发美容7328218883 

(609) 799-6698 Meilin。在家里，Plainsboro，电话预约。男生理发和女生做头发都可。非常好，二十几年了。

May's Beauty Salon 形象 美寿      
TEL:732-821-8883 CELL:908-930-2003
3550 Route 27,
Kendall Park, NJ 08824
Mon -Fri: 10:00am-7:30pm Sat: 10:00am-7:00pm Sun: 11:00am - 6:00pm

SILK CUT
HAIR DESIGNS
(aPlainsboro Road, Plainsboro, NJ 0853617#B Princeton Mcadows Shopping Center
Tel:(609)750-8868(609)750-8869Open 7 Days a Week: Mon-Sat: 10am-8pm / Sun: 10am-5pm
群主，這家剪头发不錯，女的找Ann,男的找Elson. 
上次去silk cut 服务态度很一般 后面也没给修好
推荐Kim, hairdresser in Silk cut, Plainsboro, 732-816-8869 已经用她5年了。 师傅是福建人，人和蔼，手艺好。

爱迪生雾都发廊，电话：732 777 0980。HMart对面，今天陪家人去这儿理发，女生长头发，仔仔细细理了2个小时，才35刀+小费，关键还理的超好，家人非常满意，老板理发店铺开了20年，孩子都送去上大学了。
OPEN 7 DAYS
Mon.-Sat.: 9:30am-8:00pr
Sun.: 9:30am-7:00p
霧都美容美髮設計中心
New Art Beauty Salon
Hair Design
1782 State Route 27
Edison, NJ 08817
H Mart 對面馬路
Next to Dunkin Donuts parking in Rear

个人意见：理发师技术最好是structure hair 的 Larry, 在Edison. 女生$60+tip. 近的韩国美女也是不错的选择，很认真，有时会花上1.5小时。女生$40+tip5 吧
我今天带我儿子去。他们怎么收费？
男生$30的樣子
要事先预约

我一直找这位韩国美女剪头发，个人感觉不错，她是在自己家开的个小发廊 June (732) 470-6996 18 Dey Rd Plainsboro NJ 之前群友介紹的

Fashion Hair Salon 
2090 Nj-27 Edison NJ 08817 
732-662-7112
Bendy

HAIR STRUCTURE
地址:1945 Lincoln Hwy(Route27) Edison,NJ 08817
联系电话：732-650-1620

Serena 609 955 2165
我小孩想染发，她的价格在100-350美元左右
手艺很好！找Serena理发后我妈都说我年轻了十几岁
普林周边最靠谱的美发师。非常敬业，理发技术高超，收费合理！
看到群里推荐的Serena 理发美容，今天下午和女儿去剪发，果然名不虚传，货真价实，这年头能够找到如此手艺高超，价格便宜的剪发太难了。谢谢Serena 让我看起来年轻了好多啊，又可以美美哒啦
https://calendly.com/serenajiang9050/serena
用这个link 就是可以预约Serena 

莉莉发廊
7323989999
莉莉髮廊：剪髮男25，女45～剪得蠻仔細的，我老公很喜歡，比在Edison剪便宜

@Tony.L 我也去过 不错
May's Beauty Salon
3550 NJ-27, Kendall Park, NJ 08824 ÷E


Ann理发
(609) 750-8869

177 3547 (Silk Cut II)
Beauty salon
660 Plainsboro Rd # 17, Plainsboro
Township, NJ 08536, United States
(609) 750-8869 ·

魏大姐是退休专业理发师，曾在中国大城市开理发店20余年。尤其擅长男士女士理发，老年人染发。价格: 男士女士理发15刀，儿童理发20刀。不强制收取小费，不包括洗和吹，最好服务前洗干净头发。染发15刀，需要顾客自带染发膏。
地址: 100 Middlesex Blvd, Plainsboro, NJ 08536
公寓一楼有门禁， (848) 313-0549服务时间早上八点到晚上八点之间

    `,
  },
  {
    id: 2,
    title: "驾照/危急情况处理",
    content: `
    *******大普林华人生活群信息:驾照/危急情况处理***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

新泽西交通局中英文笔试练习题库
aiqiang.org
64f5f304bdfc0ad4c86cd2cd_256x256compliant (1).png
驾照中文题库，挺有用的

https://www.nj.gov/mvc/about/manuals.htm

前几个礼拜才刚考完，个人觉得官方出的手册也很有用

求助万能群，国内驾照想申请美国临时驾照，请问国内驾照是要找律师翻译公证吗？不知找谁翻译好呢？
#中国驾照翻译件，用于新泽西交通局免路考申请使用。费用和流程请看: https://aiqiang.org/nj-license-intro/    驾照照片材料和你的邮寄地址请发到 nycourtchen@gmail.com

淘宝翻译，已经顺利换了新泽西的驾照。供参考。美国临时驾照就不清楚了

国内驾照NJ换驾照，无需路考
我没有公证驾照，没有路考，要考交规，测视力

Hertz网站上免费翻译即可，即使换驾照，DMV一样认可

您好我们刚刚在3200 brunswick 拿到临时驾照 用的hertz微信翻译 ，过了笔试看到是中国驾照（给了国际驾照也不要），就直接给了路试sticker，接着就排队办驾照。全程什么也没问.
这个office只要是中国驾照应该就给免路试
我在3200 Brunswick Pike, Lawrence Township, NJ 08648拿到了

#小程序://Hertz国际租车/u8mZkABPByrzw6p

撞车后如果那人已走了， 给对方打电话， 要Insurance info， 马上打她的insurance。 如果她不给， 说要报警， 如果她真的不给， 你马上打电话。 事出哪一township， 就打那township police

遇到产品质量问题商家不退货昨天说的是Better Business Bureau   https://www.bbb.org/

0086-1012308，中领馆全球热线

越到歧视
有些小事可以开始做，有需要帮忙的在群里喊一声。比如几次群里邻居朋友讲到遇到bias cases，记录事件信息，1）向州大检察官办公室报案，2）以个人向普林警局报案，3）华人协会收集整理，向警局要求加强管理事发地区。爱村学委帮着向council 警局要求认真对待，最近没有听说新事件

给编辑的信/报纸编辑投稿
To    krystal    
editor@planetprinceton.com
don.gilpin@witherspoonmediagroup.com

发生被歧视骚扰或者房子周围有可疑的人
Call the Princeton police non emergency number 609 921 2100
出去度假前可以去普林斯顿警察局登记一下，他们会偶尔派警察过来看看
Vacant House Check Request
princetonnj.gov
favicon.ico
如果度假的时候家里有人来帮忙遛狗，剪草（现在应该没有了），或者扫雪，最好注明一下，留一下电话

    `,
  },
  {
    id: 3,
    title: "普林斯顿附近的餐厅",
    content: `
    *******大普林华人生活群信息: 普林斯顿附近的餐厅 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

餐馆的推荐比较难，每个人的口味都不一样。下面几个中国餐馆我们试过，还及格。

Canton Palace
点心 908-526-8888    
Reserve a table
Dine-in·Takeout·No-contact delivery       
216 W Main St,Somerville,NJ 08876

Golden Seafood Restaurant
Cantonese restaurant.$10-20.
518 Old Post Rd Suite 3, Edison, NJ 08817
1711 NJ-27, Edison, NJ 08817
广东餐馆。饮茶或广东小炒。

小笼包这边有上海小笼，小食代，。皮蛋瘦肉粥只有早茶的时候在悦满楼吃过，只是觉得不如自己煲。

Weee 上可以买 Edison送餐；可以和菜一起买。满50才免运费；有个小费，不管买啥都有，选3块，餐馆提前一天才能取消。第一单没买满50 收5块快递费，但是你晚点凑满了，收到货第二天会退

如果喜欢川菜就试试Hamilton 的川妹子。我们特别喜欢他们的“酸豆角炒肉末”。用的是他们自己泡的酸豆角。

我们比较喜欢“莲园Lotus Garden”的沙锅鱼头或沙锅鲈鱼（晚餐）和牛腩汤河粉（中餐，很有广州街头小吃的感觉)
10 Schalks Crossing Rd, Plainsboro Township, NJ 08536

Hot Wok Café
店不大，定位比较有意思，单体菜价不便宜，但量很足
217 Clarksville Rd, West Windsor Township, NJ08550

Hotpot
人均：$35 地址：561 US-1 Edison , NJ 08817电话：732-354-3078

Blue Point Grill，258 Nassau St, Princeton, NJ 08542
Kristine's，51 Witherspoon St, Princeton, NJ 08542

Chef Tan Highland
Raritan Ave, Highland Park, NJ 08904
Find a table• cheftanhighlandparknj.com


下面這兩家粵菜是同一個老闆，用心經營。點心據說是師傅自己做的，也不錯
Green Lake Seafood:
Dim Sum
• $20-30 • Chinese restaurant •19 US-22, Green Brook Township, NJ 08812
翠湖海鲜酒家 nj

West Lake
1016 NJ-34, Matawan, NJ 07747 Located in: The Shoppes at Matawan $20-30 per person
西湖梅苑

Shu House
3132 NJ-27, Kendall Park,NJ 08824
这个还近点，20分钟吧。生意火爆。
人多最好打电话预定去之前
这家好吃！
这家shu house挺好的，我以前经常订午餐，因为有午市套餐很实惠。周一到周五中午有午市套餐。

普林斯顿新开的 Local 手作卤味；定期送货；每日新鲜采购，纯手工现卤，0添加，无科技与狠活，天然健康，每一口都是新鲜出炉的味道！
微信联系：LuzhiweiNJ
品味地道卤香

Lan Ramen，4 Hulfish St, Princeton, NJ 08542
Princeton Downtown的 Lan Ramen
非常推薦他的fiery lamb stew of Lanzhou 燉羊肉
麻辣乾鍋、鹽酥雞、九層塔炒飯 都好吃
之前有羊肉包子和台灣牛肉捲餅也好吃（但好像有一陣子沒做了，不知道什麼時後會恢復）

Thai Village也不错，味道正宗，价格非常合理，特别喜欢他们的drunken noodles
老板也经营一家非常好吃的法国精品糕点店，Tous Les Jours （64 Princeton Hightstown Rd Unit 5, Princeton Junction, NJ 08550）
在Woori Mart 旁边，价格不低但是好吃至极，大普林区域最好的糕点店

刘一手火锅挺好的，有点贵。east Windsor 的湖南歺馆还不错，价格也公道
老板孩子过去在Johnson Park，很和气
两家九个人聚餐，大概260美元，很多免费小吃

上海菜 
Tasty Moment小食代
1711 NJ-27, Edison, NJ 08817
Located in: Festival Plaza

这些餐厅都去过啦。 目前粤菜中部新泽西这边也就Edison的皇都，金喜，matawan的西湖还凑合

韩国菜总是去Edison Old Post路那家，很正宗

Top Korean Restaurants: So Moon Nan Jip, 238 Broad Ave
Palisades Park, NJ  (Korean town) & Dong Bang Grill 1616 Palisades Ave., Fort Lee 

Asian Bistro    31 Station Dr, Princeton Junction,NJ 08550
这家还可以。是韩国人开的。
上面两家都是韩国朋友推荐她们认为最佳的.我去过第一家友人说远超NYC K-Town’s 韩国料理店


如果喜歡台灣小吃的話，我也蠻推薦
Little Pot 
1665 Stelton Rd, Piscataway Township, NJ 08854

它是台式小火鍋（個人鍋- 煮好端上來、配料都是set好的） 
有麻辣臭臭鍋、沙茶鍋等比較有台灣特色的
但我其實覺得它火鍋就ok，沒有到驚艷等級。
鹹酥雞、脆皮大腸、咖哩蛋包飯、台式臭豆腐、炸豬排飯是真的好吃、很正宗的味道


山城码头，在Edison

All you can eat 的日餐在老美东那个plaza角落有一家开了有些年头了

我这次在网上 noble fresh cart 订了salmon uni 和 amaebi 送货到家 自己切一下就好了
他们家前身是true world 很多sushi店都是和他们订货wholesale這間比較遠，但如果有機會去北邊的話，非常推薦他們的sashimi和鰻魚飯
他們家的魚都是老闆娘每天早上親自去選的。
餐廳對小孩超級友善。

Choo Choo Train Sushi
374 Broad Ave, Leonia, NJ 07605

Naoki Sushi
2649 Main St, Lawrence Township, NJ 08648
这家在村里算是非常好吃的了

Sakana Asian Cuisine
(609) 838-9080 我们喜欢这家

Masa Sushi-Princeton
$20–30 ‧ Sushi restaurant ‧ Closed
All You Can Eat Sushi
415 Nassau Park Blvd, Princeton, NJ 08540, United States

Happy Lamb Hot Pot, Edison
At this Mongolian chain eatery
1737 NJ-27, Edison, NJ 08817, United States

Shaofei Lu： 大家知道在哪儿能买到中国的白酒吗？
Hightstown Liquors & Wines LLC
107 Stockton St, Hightstown, NJ
08520
这家店是中国人开的，有中国的烈酒买.

Mitsuwa Marketplace - New Jersey 
595 River Rd, Mitsuwa
Edgewater, NJ 07020
    `,
  },
  {
    id: 4,
    title: "眼科医生",
    content: `
    *******大普林华人生活群信息: 眼科医生 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

眼科专科和配镜

配镜，Costco 性价比最高，可以预约验光和年度眼科检查。
别去Costco验光，至少别去咱们附近那家。那里的验光师给的prescription 度数太高，眼镜戴上不舒服。我请他调整，更不舒服了 我只好又其他地方的验光师重新验的。

请问谁了解Otho-K 隐形眼镜在哪里配比较好？
Call Us: (609) 581-5755
Eyecare Professionals PC, 1777 Kuser Rd, Hamilton Township, NJ 08690 

Fred-Pennington-08534 EyeCare Professionals, PC
1777 Kuser Road Hamilton, NJ 08690
609-581-5755 (P) 609-581-7055 (F)

话说四五岁男孩子检查眼睛视力可以去普通的那种Lencraft那里做wellness check吗？还是要去专门的儿科眼科？ 
 1-800-TRY-CHOP
@ Children's Hospital of Philadelphia® Specialty Care, Princeton at Plainsboro
101 Plainsboro Road, Plainsboro, NJ 08536 Contact Us: 609-520-1717
The CHOP Care Network Specialty Care Center in Princeton has moved to a new, 25,000-square-foot facility on the campus of the University Medical Center of Princeton at Plainsboro. The new facility also offers new services and amenities including physical therapy, occupational therapy and rehab gyms, speech therapy, auditory brainstem response (ABR) testing, and diagnostic X-ray services.
For eyeglasses, please see below.@Miss Gloria  
They have a location in Plainsboro and see children with vision issues. @Miss Gloria 
Conditions & Diseases
chop.edu

陈琼是眼科医生，验光师；office在East Brunswick（Dr。Duan&Associates)；
190 State Route 18, #302
East Brunswick; tel: 732-247-2847

我们用的是eye care associates of Princeton，医生是Dr. Rajeev，娃们戴的是misight，不是ok镜。他家有时候会有人抱怨等待时间长，不过我们觉得医生挺好的，会详细解答各种问题，感觉经验也挺丰富的，不过我们没用过别家的，不知道有没有更好的。
Optometrist in Princeton, New Jersey : Address: 211 N Harrison St, Princeton, NJ 08540
Phone: (609) 921-6620
We usually see Dr. William Tullo there.

dr samuel liu princeton
Dr.Samuel M.LiuMDPhD
Ophthalmologist in Princeton, New Jersey419 N Harrison St Suite 104,Princeton NJ 08540
(609)921-9437
https://wwwprincetoneyegroup.com>..
Samuel M. Liu, MD, PhD | The Princeton Eye Group
Dr.Liu is the Director of Retina and Imaging Serviceswhere he specializes in macular degenerationdiabetic retinopathy,and retina conditions.

请问有没有好的眼科医生推荐 就是突然感觉眼睛看见有黑点点 然后看不清了
Princeton healthcare Center Terhune Rd
Princeton Eye Group
Ophthalmologist in Princeton,New Jersey
Address:419NHarrisonStSuite104 Princeton,NJ08540
Hours:Closed·Opens8:30AM Mon
group doctors   Phone:(609)921-9437   

强烈推荐cornerstone，特别好的眼光配镜和日常眼科检查
3495 US-1, Princeton, NJ 08540
Located in: Windsor Green
609) 919-1001

Dr Sun Eye Care LLC  3 Market Street, Plainsboro Township, NJ 08536  群里应该挺多人都看过她
我们家用的是Dr. Sun eye care 费用三年前$2000 左右

回馈下昨天眼科医生的咨询，princeton eye care 可能名气真的很大，现在约都是两个月以后了。所以我着急去看的是the eye center in Edison，对于这种retinal tear的病例实际上有个专业团队叫nj retinal center，直接找他们看就好了。我们是在eye center 做完又被推荐去rentinal center，花了两份钱，一般这种case都比较紧急，所以就直接安排laser treatment了。已经做完，后续再来反馈治疗效果。多谢🙏

princeton eye group真的太难约了 前台态度好差呀

我最近去法拉盛陈树仁眼科，review还不错，直接去的

只要是叫”princeton”的诊所要想都难约。我父母约camous eye group 还行，眼科普通医生可以在普林问诊，专科和手术医生都在Hamilton

我们用Princeton Eye Group 和Brighter Dental，的确是不好约。基本都是约一个月以后appointment。

Dr Michael Wong
是大Princeton 區，應是最好的Eye Dr!  有3 個offices.  是華人在美第3 代
609-921-9437 
appointment 不好make.  建議打電話時，
説是emergency!!! 把您眼的嚴重情形告訴receptionist, 懇請Dr 儘快約時問. Good luck!
我是8年前在西海岸做的。我前面推荐的Campus Eye Group也可以做激光手术。他们的Specialist很多。

请问大家有没有配儿童OK镜的医生推荐？我家小孩可能不得不戴OK镜了。求推荐，万分感谢🙏
Eyecare Professionals
1777 Kuser Rd
Hamilton Township, NJ 08690
贵是贵点 但好在非常专业 也受孩子们喜爱  挺难约上的
我们4月刚开始约，现在已经6000刀了  别家2000多刀，推荐还是很推荐的，服务确实一流，技术也没得说，该做啥怎么做给你说的明明白白，临走给小孩弄一兜子snack, 哄的高高兴兴的，他家是一次性收两年的钱，别家是一年
Address:211 N HarrisonStPrincetonNJ08540
Hours:Open·Closes7PM
Phone:(609)921-6620
William Tull

话说四五岁男孩子检查眼睛视力可以去普通的那种Lencraft那里做wellness check吗？还是要去专门的儿科眼科？
Conditions & Diseases
chop.edu
favicon.ico
They have a location in Plainsboro and see children with vision issues. @Miss Gloria 

去Hamilton的Eyecare Professional 可能要先问－下孩子是否能做vision therapy. 诊所应有在电脑上可以测试两个眼睛之间的协调和眼睛与大脑的协调。保险公司凭测试结果决定是否付费做therapy. 如果vision therapy 可以帮助的话，就可能今后不需要戴OK 镜, 也可能不容易变近视。这家看网页是有能力做vision therapy. 

https://www.chop.edu/locations/specialty-care-princeton-plainsboro?utm_source=gmb&utm_medium=organic&utm_campaign=network_scc&utm_content=locations_specialty_care_princeton_plainsboro_cta_button_consumer_consideration_all   @Miss Gloria 

For eyeglasses, please see below.@Miss Gloria 
Optometrist in Princeton, New Jersey
Address: 211 N Harrison St, Princeton,NJ 08540
Hours: Open.Closes 6 PM▼ Phone:(609) 921-6620

朋友们， 可以推荐一下做 lasik eye surgery 的医生吗？ 现谢谢大家🌹
CPA Dr. Michael Wong https://www.princetoneyegroup.com/ 我2005年找他做的，非常推荐

Delaware valley retina. I like them a lot better than NJ retina 
https://www.willseye.org/medical-services/eye-emergency-department/
24x7, 任何时候都可以walk in，就是有点远。对面有车库存车。
snow_emergency_room-27-1.jpg
Eye Emergency Department
willseye.org
24x7, 任何时候都可以walk in，就是有点远。对面有车库存车。
处理之后他们会转其他科，或者回自己医生处。这是附近唯一一家眼科急诊。

昨天后来找到了MarketFair旁边的一个眼科诊所，擅长诊治青光眼的医生，还不错，及时处理了。

这个里面提到的Eyecare Professionals
1777 Kuser Rd
Hamilton Township, NJ 08690
就是著名的Dr D
Hamilton的Eyecare Professional裡面有位Dr D專門做這個，客戶全是中國孩子
非常推荐Dr. D. 很专业也很有爱心
听来很不错，所以也有人说价钱不便宜
唐姐介绍的Dr.D 非常专业 全州顶级医生 业务能力强啊。我家四年了，都没有问题
谢谢，但是Dr.D太难约，当初就是要等半年，才选了别的医生


OK镜EYECARE Dr.Nicholas despotidis (609) 581-5755. 这家非常好。

想请问一下在大普林斯顿附近，给孩子看Vision Therapy 的医生只有在206 上的Dr. Herzberg Chaya OD吗？Vision Therapy 是帮助孩子或者大人通过锻练眼睛之间和大脑的协调，增强运动员体育运动反应速度和提高英语阅读速度。医疗保险付的疗程，一般是12周。对健康孩子和有两个眼睛在近视距离上使用有差别的孩子，都会有帮助。谢谢！

打扰大家一下，请问有家长做过白内障吗？想请教一下选plain, Toric 还是multifocal lenses, 做完手术之后，镜片适应怎样。谢谢大家

家人眼睛出现飞蚊症，请问有眼科医生推荐吗？

try “Kung Eye Center” at East Brunswick

对飞蚊症，眼科大夫能做的非常有限

我被羽毛球打到眼睛后开始有飞蚊症，医生检查完后告知一个月后就适应了

我之前有一天忽然有飞蚊症，看医生也说充分休息，少用眼就会好，没有治疗方法。果然第三天就没了

Lens Crafters里有optometrist一些情况可以看，应该也接受walk in。我家孩子小时候有一次是周末，抠着他爸的眼角膜就是在那儿处理的而且被安慰说这种大人被孩子意外伤着眼睛的情况挺普遍

Matossian Eye Associates +1 (609) 604-6379, Hopewell office, Rwj大楼那里但是又不是RWJ，接受Medicaid，比较好约。紧急的当天有可能约上

    `,
  },
  {
    id: 5,
    title: "快递",
    content: `
    *******大普林华人生活群信息: 快递***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

快递
天马迅达快递
跨境物流|海外仓|社区电商 worldCPS.com LOGISTICS/WAREHOUSINGIE-COMMERCE
626-522-6963
美东USNJ1002号仓
联系人：David Ma
电话：732-519-2250
地址：44 Heller Park Lane, Somerset, NJ 08873

微信号：MR136379360
她有有帮寄包裹，在Kendall park
一般三到六个礼拜

请问有谁知道怎么让国内亲戚寄东西过来，谢谢
试试顺丰国际
紧急求助请问有没有哪位朋友今天晚上-6/20期间，会从新泽西/纽约飞北京（6/21 能到）。需要帮忙带一本护照。谢谢
我用过顺丰快递寄护照回国，非常安全，准时到达，不过需要5-7天，24美刀

不着急也不想跑远，普林快递不错。想早点寄出的H mart附近有家快递公司
Hmart附近的比较快的是这家
XZX EXPRESS INC.
(908)583-3838
1603 NewJersey27 Edison, NJ08817 USA
这家在Ｈmart附近，给国内寄过两次。七月份这次很快，不到两周收到

普林快递Susan Yang（杨姗）
微信号：shanyang618

Edison 很多，我用XZX EXPRESS INC.

    `,
  },
  {
    id: 6,
    title: "垃圾处理",
    content: `
    *******大普林华人生活群信息：垃圾处理*****
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
 
Dwayne collect scrap metals for free. 将我n 年不用的stove，microwave， 洗衣机都免费拿走了， 其他地方像1-800-pickup 是要收费的。 现在gas 都好贵， Dwayne 的service 不容易， 给大家推荐一下。
 
609-439-5706 Dwayne: collect any metal household items for free. He is very nice and take away any used washer and dryer, refrigerator, etc.
 
请问 节后 该怎么处置 圣诞树 ？
每個鎮都會公布哪一天回收聖誕樹，通常是一月中
https://www.princetonnj.gov/445/Public-Works

我推荐一个dumpster rental : blue rhino dumpster rental 732-322-5327  价格和服务公道
有没有pick up旧沙发的service可推荐？ 谢谢！

1-800-GOTJUNk

可以直接问目前帮你们处理垃圾的公司，请他们给你报价；我们之前搬家就直接付款请他们一次性来帮我们收所有搬完的垃圾

旧衣服捐赠
The Jewish Center Princeton
thejewishcenter.org
435 Nassau St, Princeton, NJ 08540

https://www.princetonnj.gov/1359/Trash-Collection
Clink on bulk waste collection

Pickup Please，为越南老兵捐赠的福利机构。收集衣服鞋玩具书家具家庭常用物品。 will come and pick up the following donations:
Clothing Donations in New Jersey
Furniture Donations in New Jersey
Donate Shoes in New Jersey
Donate Toys in New Jersey
Donate Books in New Jersey
Household items Donations in New Jersey
…and Much More!
这里是预约pickup的网页：https://pickupplease.org/donation-pickup/

    `,
  },
  {
    id: 7,
    title: "搬家和搬运",
    content: `
    
*******大普林华人生活群信息: 搬家和搬运 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

搬家/moving service

旺发搬家叶老板：7328829162
Furniture Moving and Heavy Lifting·
$105/Hour

给旺发搬家叶老板：7328829162🌟好评！我是上月底搬的家，第一次联系叶老板，因为我搬的大件家具不多，来的是他儿子和伙计，配合默契，速度快，细致，安全
今天请了旺发搬家公司帮忙搬家，服务非常好，打包细致周全，还负责拆卸和安装床，价格合理，服务可靠，值得向大家推荐! 
推薦Tony Moving 我女兒搬家刚用过，很专业，鏡子，饭桌等等包好，人也很好

以下是之前分享的-远距离或是跨国搬家可以找飞达luckymoving.com,近距离或小搬家可以找老蒋搬家，人很实在，价格公道 - 新州搬家公司電話9173880039

我用过Lucky moving 飞达搬家 (732) 432-4288 推荐

http://www.empirepianomovers.com

我用过搬家公司，不需要给小费的，都包括在里面了。是一家华人搬家公司，很仔细，搬的很好，家具都保护起来的。因为离的比较近，帮我搬了两三次呢。费用之前谈好，后面不需要给小费的。
老蒋搬家
19173880039
还不错

搬家小费我给过，每人50刀，搬家老板会向你要的

If you need same-day service please call/text me at 3479241811.
Michael
Magic Mike8:39下午
Iwork at $125 1st hour with three people, $100 per hour after9:43下午

我们用过蓝天搬家 (646) 821-1008 鲁先生。很好。他们在法拉盛

蒋先生 (917) 498-8216 微信号 stevenjiang1953

Bok moving 201-615-9600
韩国人 老板Peter
刚刚请他们搬家

可以考慮这兩间, 都是local mover, Rite Move不喜欢用email, 电话上谈好了就算，好像不很专业，但我还是选了它，來了两个人，态度好，也做得很好。

609-586-6833
https://theritemove.com/team-trucks/
theritemove.com

https://twomenandatruck.com/movers/nj/princeton?utm_source=Google&utm_medium=Organic&utm_campaign=GMB
twomenandatruck.com
856.291.6844

我从Plainsboro 搬到Princeton, 两张queen size beds, 一张sofa bed, 一张大dining table, 三件很重的木傢俬，和一个upright piano, 共$980，另每人tips (來了三个人，上面说错了）。

钢琴搬运/Piano Mover

I used this company. Very professional and reasonably priced. http://www.empirepianomovers.com

我用过这家：https://princetonmoving.com/

The price the company quoted for me was for a driving distance of about 45 mins with 6 steps to the living room and it was for a baby grand piano. The price was $300, but that was about 10 years ago.  You can call them to get a quote over the phone before you make a decision.

Duppy piano move
(856)418-1927

MMS搬琴
+1(201) 819-8064

请问普林斯顿附近有没有什么接受捐赠物品的机构，而且可以上门取件的？
https://www.gogreendrop.com
VVA
smallvva-pp-logo.png
Schedule PPC Location
pickupplease.org

Recommend a place to donate to. They come to your house to pick up, accept many household items: https://pickupplease.org/schedule-ppc/?outlet=trenton&gad_source=1

    `,
  },
  {
    id: 8,
    title: "孩子体育",
    content: `
    *******大普林华人生活群信息: 孩子体育 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

请问附近哪家教孩子的跆拳道或是类似的武术馆比较好？ 谢谢@Rachel-Sarah-4 我女儿在west windsor woori mart韩国超市边上的Black Belt America学跆拳道，他们是个连锁的，不过这个店今年刚开，就一个老师，教的我觉得还挺好，你可以去试两个周。一号路上有个Amerikick教空手道的好像也不错。

@Rachel-Sarah-4 我们家娃在Ahn's taekwondo Academy，skillman, 还不错

请问普林斯顿附近有给零基础的小孩学习baseball的地方吗？
Princeton Little League, fall ball starts from September @Lan 
Homeprincetonlittleleague.com
@Lan 这个program就是类似township的recreational program, 但是适合零基础的孩子，如果想去private club，附近有PPH Hamilton, Zoned at Bridgewater，那里有private class和group class

象棋
​​除了Princeton Chess Academy提供初级到中级的国际象棋课程, Princeton Recreation Department 在暑假也有国际象棋课，可以到官网上查看。
princetonchessacademy.com

问一下普林周边哪里有学乒乓球的地方？
Princeton Pong. www.PrincetonPong.com
@欢喜 今年初开的。没去过。你可以去看看

在Alexander road和US 1
请问附近有好的跆拳道summer camp。推荐么？谢谢！
我们在Gracie Barra Brazilian Jujitsu三年了。强烈推荐。

我儿子小时候去过 Ahn’s Taekwondo at Bridgewater. 他们在Montgomery shopping center 有一个，好像在美东附近也有一个。
我很喜欢，对孩子要求挺严的，不是随便就给晋级带子。

ahn's taekwondo academy
TE:1860W682-8700 TEL:(9O4541-0220
← 27

网球 （有专门的list）：
fyi： nassau tennis club的group lesson蛮不错，价格合理，补课啥的也蛮有人情味

给有小朋友想学网球的，给大家提个醒，非常不推荐Firefly。

网球教练王钰-WeChat ID: LSCA666
网球名私教王钰。职业网球教练，曾是中国国家网球男队第一主力，天津人，ATP最高排名238位，按照排名UTR应该在14.5上下。退役后跟随华裔顶级教练马伟开一同执教于广州星河湾职业网球俱乐部，同时担任彭帅，郑赛赛，徐一幡等职业选手的国际巡回赛教练任务。目前正在规划长期课程包括团体与私教。同时在白天也会开展成人班的技术与战术教学。有需要的爸爸妈妈们请及时加王教练微信（微信名：LSCA666）入群咨询。

Hopewell Valley Tennis & Swim Center
111 Titus Mill Road
Pennington, New Jersey 08534
609.737.3600
www.hopewelltennis.com

Baseball Windsor Little League
www.wwll.org

冰球
从头学起，可以参加ProSkate的Learn to play hockey,一般是免费的，给护具装备
学了冰球初级，可以在Proskate的house league打
如果孩子真的感兴趣，就要考虑进Travel Team, 有Princeton Tigers 和 Proskate Stars可以选择，每年三月多做tryout，一年的费用大概在3500-6000之间

Camelback mountain 比较适合初学者。那里有初学者滑雪课。

排球
教练程序
微信ID：wxid_0xf7ql6l7uyk12

@杜超 ～ Billie 附近排球俱乐部
1. PVC https://www.princetonvbc.com
2. Core https://www.corevball.com/nj?gclid=CjwKCAjwhJukBhBPEiwAniIcNYHkhT2gbOW_LmYihsIoT1txonZMZWOglIQhzn_AW1yGjx5zrtocpBoCNlMQAvD_BwE
3. 普林这里一个中国教练


篮球
关注一下Princeton镇政府办的各种篮球League，男女分开的，价格特别便宜

有人知道附近哪里可以带小孩去shooting ?
@Mary union hill gun club 可以
今天带小孩去了TTC还不错，不用自己带枪

请问哪里有打羽毛球的地方？
Northeast Badminton Club (Princeton)
(732) 523-1888
https://g.co/kgs/7WpzT3

@ All
请问群主和各位家人们：
NJ这里有没有羽毛球拍网线的地方？
我儿子喜欢打羽毛球，他的好几只拍子都是因为线断了，闲置在哪里
哪位知道这边有专业绑线的师傅，请告知
谢谢
https://nebcus.com 先自己打电话去schedule, 可以说中文，自己拿线去会比on site 买线便宜一些，告诉他们你想拉多少磅就好了

羽毛球场地
New Hope Badminton Academy
Badminton club

NEBC我只知道someret有场地，Princeton的不了解。

Paradise Golf Center
56 Route 12
Flemington, New Jersey 08822
908.788.3786
paradisegolfcenter.com

划船
© 2024 Princeton National Rowing Association
Caspersen Rowing Center
1 S. Post Road, West Windsor, NJ 08550
609-799-7100  | info@rowpnra.org

Princeton Futbol Club以外，还有哪些青少年足球俱乐部？
PSA, MFA

有没有射箭的地方推荐？
我儿子之前在那学过射箭 6:09
Junior Olympic Archery Development(JOAD)is a program of USA Archery that teaches archery to young people
Waxobe Archery is located at:53 Maior Road
Monmouth JunctionNJ08852
http://www.waxobe.com
And information about this JOAD program: http://joad.herokuapp.com
Price for the 10-week session:
$120 for WaXoBe members; $160 for all others.
Also a $50 starter kit 

教小孩缝纫
绣房地址
51 North Tulane Street
6099556895

    `,
  },
  {
    id: 9,
    title: "厨房厕所小件安装",
    content: `
    *******大普林华人生活群信息: 厨房厕所小件安装***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
 
我们用过carpet centers of nj 还不错  
732-254-2060
917-923-7827
Carpet centers of New Jersey是一家中国人，他们只换地毯不清洗
 
Toilet Kevin 609-306-2600
 
Kitchen
Best Stone and Kitchen @ New Brunswick
中国人的店，你可以去看看，我们家countertop这里定的，比HD和Lowes便宜
 
窗帘Custom blinds and drapery
signaturedrapery@gmail.com
732 443 0015
我們用過這個。她主要是做Custom blinds. Graber 和 hunter douglas

9176175066
Text 温师付
水, 电, 工木都可以的
群里推荐的那个温师傅出价特贵，以前用过温师傅还好
 
Fence
http://www.straightforwardfence.com/
 
Fence contractor 
Carl
8552922757
 
Carl’s fencing     
(855) 292-2757
 
我在这里给大家介绍一个装修师傅做油漆水电，做工不错电话7189082188
 
屋顶/涂漆(908)705-5841
East Brunswick, NJ
 
客厅落地玻璃
可以试试李师傅
(732) 910-2166
 
郑海雪-换地板
微信号：wxid_exps314z628v12
 
bill电话7323221378handyman
装修地板

做地板的师傅
赵师傅 732 397 5770
做地板的赵师傅 坐地起价。而且涨的不少。不建议
赵师傅做的感觉上确实好 

Handyman Daniel （6092553028 text和留言）我们家书架橱柜没法买标准的，都是找他来定做，全橡木的。活好，细致，价格公道
刚找Daniel定做了木制的影壁和Deck，同色的木制的Flower Box，石头做的火盆加上特制的火盆盖子（平常不烧木头的时候可以做 茶几）。做工精细，很有艺术性，价格合理，做出来的空间的价值就像加了一个大房间一样，大大增加我们后院的使用价值。赞👍！ 
在给我们家装修卫生间，加浴盆，基本全换新，收费合理，干活不图快，很有设计天赋，非常细致。我一个朋友用他装Hardie siding, siding 做的非常漂亮。他活多但是价廉物美，值得等
Dan 手艺确实不错。今天刚帮我修了地板。
Daniel帮我重装了bathroom和厨房，干活很仔细非常有耐心，价格低廉，材料和工时价格分开算，很合理。推荐！

我这里有位高师傅电话是718-908-2188


@J. Bai🎈 Wren Kitchens好像就可以做橱柜，另外Home Depot ，costco 里面也有。

Monlero WOOD-LAMI       FLOORING        ATE-CARPET-VINYL-STAIRS 
201-204-6902
我们家现在就有一个狗狗房间在装地板 两个厄瓜多尔的小伙子 挺认真的 不过还没完工
我找他们做的floor refinishing，感觉技术没到位，比较粗糙。

最好是石匠, 砖瓦匠, 有人吗
Masonary Brian
+1 (609) 577-1681
 
请问大家有masonry推荐吗？需要铺patio
Michael Wentzel
Jamison Home Services, LLC
New Jersey / Lower Bucks / NE Phila Area Manager
Mbl: 856-357-4875
Email:mwentzel@jamisonmasons.com
没有给我铺patio，但帮我休整不好的地方加重新填缝，价格算是合理 活也是满意的
 
多谢群主批准分享一下：如果有朋友计划做sidewalk，driveway，patio，不管是pavers还是concrete，我推荐给我家做sidewalk的contractor：Maximo: +1 (973) 391-5348。我家邻居看到他们的做工，也雇他的crew换了patio pavers。
我找了好几家股价，他是最好的，看着他们从撤掉原来的再换新的，过程活干的很专业

His team is the best in Middlesex area. 
Lo Chiatto Paving & Masonry, Inc.
Paving contractor in Edison, New Jersey • Closed
1607 NJ-27, Edison, NJ
08817
(732) 548-7744
LoChiatto Paving
https://lochiattopaving.com
他的價錢（連工帶料，包申請 permit) 不便宜，所以非誠勿擾

 
黄莹亮
phone
(732) 986-0088
我家装厨房厕所用的这家

武师傅(267) 237-0175。动作快，周日不休息。活的价格很合理。非常好沟通。

7326681604普通话 粤语;翻新改造有需要联系林师傅 

给我们改建时报过价，屋顶加一个老虎窗一万多（我们要加两个）。
你问他似乎什么都可以做。所有镇里的审批申请他都不管，似乎英语不过关。他也没有注册许可。我们最后还是没找他做。
2020年想装修时找过张师傅，人非常好！他的报价每平方英尺装修价位在240-300美元，人工占60%，地下室工程没有承包过他说不太了解。
张师傅不管permit的申请，碰到需要permit的地方都要自己去做。华人师傅一般都不管申请permit，可能是语言不太行，而申请permit很麻烦，一来二去要和镇里管事的很多沟通，跑了无数趟，他们美国人也很官僚。我们弄了半天，就算了，太麻烦了，工程换了老美做。建议需要permit的还是找老美。

    `,
  },
  {
    id: 10,
    title: "签证",
    content: `
    *******大普林华人生活群信息:签证***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

签证
新泽西公证员
Yu Zhong
Yu.zhong.609@gmail.com
仲宇的公证和签证服务很好，他的电话是6097513252. Wechat是yu_zhong_609

代办去中国探亲旅游签证。每份 $100 。一家多份申请有优惠。有需要请发短信至609-616-2023

@JCW 中文学校的刘老师帮代办签证，她的电话是6096889325。
我用过，不怎么答复，态度也不好

请教，持美国绿卡，中国护照，在美国本地办澳洲签证，求代办旅行社联系方式
小顾：harrygu123

请问群里有人认识可以帮忙申请“申根”签证的中介吗？我网上预约晚了，预约不到想要走的日子了，想快速办理，否则机票就浪费了。” 帮忙一下
https://www.americantranslationservice.com/c_visaservice.html

应该就是重新办理，流程官网上有， 打领事馆电话咨询。 领事证件咨询电话：212-868 2078

吾爱
客服微信：ukvisa5i
客服电话：18611895166
小红书：吾爱签证中心(ID:428844330)

请联系Kathy: (732) 698-1888签证

好消息：纽约领馆1月25号恢复领事证件大厅对外办公，1月16日开放网上预约功能！
http://newyork.china-consulate.gov.cn/tzgg/202301/t20230113_11006691.htm
我刚刚在纽约大使馆办好所有的手续，正在回国途中。 给大家分享一下这次办签证，PCR 的经历。第一步 先要准备照片，电子文件照片 因为填表是要求上传。第二步，填COVA表，这个表提交以前，可以任意修改，提交后如果要改，就须重新填。填好表提交后，会给一个申请号，凭号预约。 第三步 预约，这个步骤需要不停的试，但也不能太频繁 会被短暂锁住。如果没有预约空挡，它会有一条短信‘’当前可预约人数为0人。。‘’ 第四步 面签，Q2签证，除了邀请函，邀请人身份证正反面复印件外，要准备余下资料：护照带相片页复印件，以前的十年签证复印件，最后一本中国护照的相片页复印件，鴐照复印件（地址证明用）最好带齐证件，大使馆有复印机，要用quarters， 25cents per page. 第五步，取证 凭取证条（无需本人，可由他人代取）9号 窗口交钱（money order, credit card). 10 号窗口取证。 第六步 订机票 我找travel agent 帮的，因为要得急 第七步PCR, 我在Live Urgent Care 做的，1-2小时出结果。他们给电子文件，自己可以打印。我刚刚通过了登机要求

如您在本次前往现场提交申请前存在疑问，请您扫描网站下方二维码向总领馆提问。如您后续有疑问，请发电子邮件至 ny_hz@csm.mfa.gov.cn（护照、旅行证业务）、ny_visa@csm.mfa.gov.cn（签证业务）和ny_gzrz@csm.mfa.gov.cn（公证、认证、《在境外居住人员领取养老金资格审核表》（健在证明）业务）咨询。

万霞微信号
shirleywan0523

各个费城市区，光华中文学校 ，North Wales，纽约可以
主要做纽约领事馆管辖的10个州的签证和认证业务。
现在回国10年签证有效暂时但不能用，如果回国需要重新申请10年签证，以前的签证做废。今年签证程序和以前不一样，需要在线填写8-10页签证资料和提交，然后预约签证时间。所以整个时间比较长，大约1-2 月。 
大家把所有签证资料准备好，由我们帮忙预约，代送+代取签证。 
费城附近客人可以送到我们公司指定地址，如果10人以上，我们可以派人到指定地址代取。其它比较远的州的客人可以寄到我们纽约指定地址，做好签证后回邮给大家！
⚠️:大家有不清楚地方，请查询下面领事馆网址：
http://newyork.china-consulate.gov.cn/tzgg/202301/t20230113_11006691.htm
我们公司每周六送件， 如果想这周送件的，请把准备好的资料周六之前送到North Wales, 或周六1:30-2:30 送到大学城。 具体地址请联系我，谢谢！

十年多次
中國Q2探親簽證
1、护照原件(护照有效期须为6个月以上、且须有空白签证页)2、申请人在美国居住地址证明复印件(如驾照、水电气账单、银行账单等)3、邀请人的中国身份证(正反面)复印件4、旧中国签证(如第一次签证需提供中国护照原件)5、電子版照片一張
費用$280，辦理時間2-3週咨询热线:飞扬旅游邓小姐CHLOE 9175352639 

大家有没有华人旅行团介绍的？比如游轮的
孙康 (732) 910-0510@吴小亦 
孙康专做游轮

哪位有可以带办回国签证的agent？谢谢先
Oriental Cultural Service LLC
Chinese Visa Service王老师旅行服务代办:各国护照申请中国签证
各类文件中国领馆认证中国护照换新文件、护照代取老人健在证等事宜 Phone:609-688-9325

求代办签证的中介
兰姐事务所
LAN'S SERVICES LINC.
办公时间 Office Hours
星期一至星期五:9:30am-6:00pm星期六至星期日:预约(by appointment )
Add: 2 Allen Street Unit 4D     电话(Tel):212-219-0278    
New York NY 10002       212-219-1386    
地址:纽约华埠亚伦街2号4D
Email: lanjie705@yahoo.com      手机(Cell):917-403-9157   
Email: ny2122191386@gmail.com   微信号:NY2122191386        
电话      9174039157      
2122191386
描述领馆费用是每人$140，用Zelle...
我们的费用是每人$150，
@Judy 他们在唐人街在唐人街，做这个业务几十年了，递件取件速度都很快。
你要不想跑，跟她微信联系，填写表格，然后把你的护照寄给她就行

Oriental Cultural Service LLC
Chinese Visa Service王老师旅行服务代办:各国护照申请中国签证
各类文件中国领馆认证中国护照换新文件、护照代取老人健在证等事宜 Phone: 609-688-9325

我以前用过这家公司，不错
Jessica-翠宝旅游Cell9177558828很多客人问中国签证情况，到目前为止正常情况签下来都是十年多次180天或者120天，美国境内所有中领馆均可办理，除了中国签证，其他国家也基本上都可以申请，有需要来找我吧!翠宝旅游:917-755-8828
2102157i        812198853060138250

麻烦大家, 有好的邮轮代理推荐吗
安妮-华夏旅游732-777-9888

@Linda 估计你们会租车自驾游。在 旧金山  城里，推荐49 mile scenic drive , 包揽了所有旧金山市里的美景。

请教一个问题，入籍后第一次回国，需要去派出所销户嘛？网上看到有人说不销户不让登机？
@阮春怡 保险做法是销户。现在大数据，出入境管理处有户籍的信息
入籍后回国你肯定需要去签证，使馆会要求你带上中国护照，大使馆会帮你剪去护照角，并盖上护照取消章，所以不需要去派出所销户，因为你取得签证时就被销户了
当然第一次登机时可以带上已被取消的护照，防止用到
如果入境口岸和户籍所在地在同一个地方，入境的时候边检有可能要求注销户口。
大城市的边检和公安户籍管理可能没有联网，即便连了也不一定马上可以查到户籍情况。但是中小城市很有可能是联网的，而且入关外籍少，查到的可能性大

    `,
  },
  {
    id: 11,
    title: "律师",
    content: `
    *******大普林华人生活群信息: 律师***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

律师
有群友能帮忙推荐附近讲中文的律师吗？谢谢🙏
@optimist_too 
Law Offices of Wang &Hou
Legal services in West Windsor TownshipNew Jersey·Op
Services:CorporatelitigationCriminal    >    
litigation,Divorce litigation,Legal advice….
+1609-716-4888
母女團隊。特別是女兒（Jenny Hou)認真負責，responsive.

美国移民律师Carrie
WeChat ID: yyglobleshopping

袁钢律师
微信号：gangyuan1972

Sam S. Dhaliwal, Esq.
Phone (609) 447-1201 Sam@DhaliwalLawFirm.com
www.DhaliwalLawFirm.com
虽然开始有些犹豫，看到是印度名字，但是其实是二代，英文完全流利。非常敬业高效，价格合理。他帮我们买房子的法律手续，但是也做离婚等家庭常见的法律问题。周六周日也会回着急的信息。很靠谱

WANGMUGNO&PARK
Attorneys&Counselors at Law1632 Anderson AvenueSuite B Fort Lee New Jersey 07024 Tel:(201)-947-2135 Fax:(201)-606-2700
Website:www.wmplegal.co

请大家群里有认识移民律师的吗？请分享谢谢gloria@pinglaw.netGloria Liao, Paralegal
Law Office of Fangzhou Ping
Direct Line: 818-639-1788人很好 很负责

哪位同乡有认识移民律师经验丰富请推荐朋友公司需要招募一位。加州有个申律平律师，你在网上查一下

柳治平大隐律师＆昵称：柳治平大隐律师
WeChat ID: whazupdoc

律师专做遗嘱和trust funds
Hauptman and Hauptman
973-994-2287
或者跟Mercer County Bar Association 咨询一下 mercerbar.com


离婚律师大概一个小时350美元

律师专做遗嘱和trust funds
Carl Archer of Whitehorse Ave.
或者Len Garza, Esq, len@lgarzalaw.com;6092370310
或者 Harlan Tannebaum 609 933 1630
或者John DeMartino  NJELDERLAWFIRM.com, 908 874 5636

Fiona Van Dyck, on 206 near cherry valley, vandyckfirm.com

查martindale.com 找律师，看一下那些律师是否处理过你想要的类似案件


美国移民律师Carrie
WeChat ID: yyglobleshopping 1

交通律师
Traffic lawyer
Ellis Klein
267-629-2147

同学校为孩子是否是special needs争执，找免费的咨询
Stacy Grenwald of Cranbury 
Community Justice Center in Trentor on State Street
或者SPAN 973 642 8100
或者Hinkle, Fingles and Prior in lawrenceville 609 896 4200
Department of Developmental Disabilities 也许会提供帮助

与雇主发生争执要找的劳动争议律师
Employment lawyer
Jacob Davidson
732-690-8355

房屋律师
housing lawyer
Christopher S. Tarr
STEVENS & LEE, a Pennsylvania Professional
Corporation
Princeton Pike Corporate Center | 100 Lenox Drive, Suite 200_| Lawrenceville, NJ 08648
Phone: 609-987-6666 | Internal: 3614 | Fax:
610-371-7935 | Cell: 609-462-9104
cst@stevenslee.com | www.stevenslee.com


跟HOA打交道的房屋律师
deal with housing/HOA
Borrus Goldin
732-422-1000

    `,
  },
  {
    id: 12,
    title: "房屋装修工程/Handyman",
    content: `
    *******大普林华人生活群信息：房屋装修工程/Handyman*****
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
 
房屋装修工程/contractor/renovation
 
建筑师
Alfredo R. Trevino, Architects
609-671-0966
Cell: 717-319-3278
 
Hojoon Chung
2014966242
7325862563
Hcas2012@gmail.com
这韩国人建筑师不错，价格合理，很容易打交道
 
Architect Ronald E. Rheaume, +1 (609) 213-8396、
 
这位建筑师，很有经验，价钱也非常公道。大小案子都接，可以简讯他Joe Mullaney Architectural and Structural design & engineering 2154993544

再来求一个能检查房屋结构问题的structural engineer
Lusu Ni
PhD. in Civil Engineering
LS Home Inspection LLC
484-838-9291
NJ License No. 24GI00176800
http://lshouses.com/
我一直在用，你可以试试

Structure engineering
+1-609-4301030

Structure engineering
RPK in Fairless Hills, PA

Builder/handyman
NINI
609-587-2411
 
@霞Paul Pennachi，若干年前用过，还不错  
@莫 他们比较难约时间，我等了两个月
@凯 我们刚找他们做了装修报价，比其他报价高了至少五分之一。
Paul Pennachi
A.Penna@comcast.net
(609)203-0033
 
Kevin Moore。6093065942 
remodel kitchen basement 
 
Contractor CanAm Design & Build：609-255-3028给我换的烂掉的窗框和门框，找了五个地方，他家的报价最低。很忙需要预约，打电话不通留voicemail，给我很多顾客做过，好评率100% 。
专做后院小木屋/garage/shed的设计和建造，价格不算贵,工做的挺好. 在大普林区名声不错
推荐！房屋改造时一面墙加了两个窗户。他们一般做商业工程，做工很好
帮我把车库从毛坯房改成办公室，孩子偶尔用来和朋友做sleepover。做工慢了点，Have an eye for detail。很细致，工作后总是打扫基本干净。
里面有个Handyman Daniel （6092553028）,活儿很细致
他们帮我翻修厨房和地下室。价格合理，负责任。可以帮助申请镇里的Permit。
给我家装修了卫生间, 瓷砖厕便洗脸盆都换了，装了橱柜，把淋浴换了澡盆，收费材料和做工分开。价格合理，认真，会做水电，很会设计，他挑的颜色很耐看。
Dan 手艺确实不错。今天刚帮我修了地板。

富林橱柜地板公司的柜子质量挺好的. 1627 route 27 Edison NJ

郑师傅 Plumbing/handyman/whole house 201-658-5908
真的非常棒，这个师傅啊，收费非常非常合理，而且做工很认真啊，活做的非常好,他什么都会啊，然后他也有几十年的功底。
这位郑师傅我不推荐，给我们家做装修项目，都谈好了，做到一半要加钱，而且加很多，没同意，项目没做完就走了。这种行为太不负责任了。

装修郑师傅，几年前给我做过，蛮容易沟通好，价格合理。 他想让我推荐下，他在纽约，小的Handyman的活没办法做。一般都是跑来一次做几天的。
房屋违规处理 验房
TEL:917-669-7365

 (201) 669-2050 Pro- Builder的Tim，你可以试着联系一下。他上次给我报过价，虽然最后我自己修好了，没有用他，但感觉人很积极。
 
David Mei (848) 219-2799
微信 :Chokeberry2003
contractor David Mei,他的收费不是最便宜的，但很合理，人也绝对是诚信認真负责。他也是realtor

东北师傅张克洋也不错，+1 (215) 858-1006，价格公道，人不错，比如加个门换个热水炉子换水管蛮好，但刷墙的细心活儿不够仔细
给我们改建时报过价，屋顶加一个老虎窗一万多（我们要加两个）。
@++M 你问他似乎什么都可以做。所有镇里的审批申请他都不管，似乎英语不过关。他也没有注册许可。我们最后还是没找他做。
@琳 2020年想装修时找过张师傅，人非常好！他的报价每平方英尺装修价位在240-300美元，人工占60%，地下室工程没有承包过他说不太了解。
张师傅不管permit的申请，碰到需要permit的地方都要自己去做。华人师傅一般都不管申请permit，可能是语言不太行，而申请permit很麻烦，一来二去要和镇里管事的很多沟通，跑了无数趟，他们美国人也很官僚。我们弄了半天，就算了，太麻烦了，工程换了老美做。建议需要permit的还是找老美。
 
Maryjo Eckhard​908-9630052
改装洗手间内外，质量不错
 
WB Construction LLC/Walter
2673971023
walterbednarz@gmail.com
拆旧天窗换天窗$800 一个。
 
魏师傅：(917) 963-6484
有个做厨房的师傅很好，魏师傅，工好人也好但是价钱可能不是很便宜

华宇
装修厨房，电话是718-559 2601

    `,
  },
  {
    id: 13,
    title: "骨科/理疗针灸/中医",
    content: `
    *******大普林华人生活群信息: 骨科/理疗针灸/中医 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

理疗/PROFESSIONAL PHYSICAL THERAPY

朋友的孩子健身把脖子扭伤了，请问大家有好的正骨医生推荐吗？针灸治疗也可以的。谢谢！

西医找Princeton Orthopaedic Associate 的Dr. Ark, 感觉扎针灸是不是更好

急性扭伤感觉好的针灸师效果好

我这半年理疗封闭折腾了一大圈，遇到没经验的医生和理疗师真是没地方哭...反正不推荐UOA的医生，听说POA的好，要找Dr.Ark但我当时没约上要等一个月，打封闭的话推荐Princeton joint spine 的DO . Meyler。理疗到现在试了四个还没有特别好的。中医正骨和针灸比较靠谱不过也要有特别有经验的才行……打封闭还是有用的，消炎镇痛的同时可以做恢复性训练，关键要找对训练方法和理疗师。

我不太清楚这几个。我们只是看了运动外科手术专家William Rossy,并且做了肩部手术

你可以去Princeton orthopedic association,那里的医生都还不错，有运动医学的sports medicine surgeon, Princeton radiology 可以做x-ray, MRI

Ipad shoulder
纽约张徳超

各位邻居，请问有好的神经科 骨科医生推荐吗？爸爸腰髋腿疼有一阵子了，华人医生做推拿打止痛针效果不是很好。先谢谢大家
@H 骨科- Princeton Orthopaedic Associates
(609) 924-8131
https://goo.gl/maps/17UgE6sVXNh1CVfy8
@H 骨科- Princeton Orthopaedic Associates
(609) 924-8131
https://goo.gl/maps/17UgE6sVXNh1CVfy8

 请问有orthopedic doctor 推荐吗Princeton Orthopedic Association. 我正在它的Plainsboro
@Liping利平  美国排名最好的骨科之一，NYC的hss, hospital of special surgery

有没有chiropractor 推荐？ 谢谢😊
有。Dr. Ari Cohn. 我怀孕时见过他，帮我调整骨骼，让我在怀孕9个月时还能散步。
Chiropractor-Princeton-NJ-Ari-Cohn-Meet-The-Team.jpg
New Patient Special | Chiropractor Princeton NJ
princetonchiropractic.com

各位邻居，请问有好的神经科 骨科医生推荐吗？爸爸腰髋腿疼有一阵子了，华人医生做推拿打止痛针效果不是很好。先谢谢大家
@H 骨科- Princeton Orthopaedic Associates
(609) 924-8131
https://goo.gl/maps/17UgE6sVXNh1CVfy8
@H 骨科- Princeton Orthopaedic Associates
(609) 924-8131
https://goo.gl/maps/17UgE6sVXNh1CVfy8

Dean Linkroum PTDPT Physical Therapist
dlinkroum@professionalpt.com
281 Witherspoon Street Suite 201
Princeton, NJ 08540 Office: 609 622 5624 Cell: 908 285 4124 Fax:609279 2196
www.professionalpt.com

我是约了William Rossy, 运动损伤专业，也是别人推荐的。另外，有人用过Dr Monica 和Abrams,据说也不错，给普大运动员做过手术
我认识的几个普大运动员也是在POA看医生。Dr. Monica，Dr. Abrams 也是在the Princeton Orthopedic Group。据说都不错

@@妹 我儿子用过一个sports injury doctor 在lawrenceville 不错。
Princeton Sports and Family Medicine
Sports medicine clinic in LawrenceTownshipNew Jersey
3131 Princeton Pike Building 4A,
Suite100,LawrenceTownshipNJ     versity 

Dean Linkroum PTDPT Physical Therapist
dlinkroum@professionalpt.com
281 Witherspoon Street Suite 201
Princeton, NJ 08540 Office: 609 622 5624 Cell: 908 285 4124 Fax:609279 2196
www.professionalpt.com

@V  年轻的时候应该请New York city 的专科医生或者医院看。假如没有治愈应该是差不多反映全美国的医疗水平。也许不需要手术可以有其他矫正治疗办法。我家孩子在NYC 的Hospital for Special Surgeries 做了比较全面的Knee surgery。是差不多是全美第一的儿科膝盖手术医生做的。也是运动受伤后发现的问题。

推荐Atlantic Physical Therapy Center
Atlanticptcenter.com

You can try Ivy Rehab on Harrison Street, Princeton. Ask for Kristen or Bob.

Ivy Rehab Physical Therapy
Address 330 N Harrison St Unit2 Princeton M Thu Phone (609) 924-0697

Progression Physical Therapy of Princeton
601 Ewing St # B9, 206
Princeton,NJ 08540
这家不错，可惜我的保险不允许。做过一个session，当时是左肩膀疼，教练教我一个动作，练完之后当晚就不疼了
COVID 以后，有的要自己付的费用是一小时190 或者以上
我去过这家。lawrenville那边有一个Mercer bucks Otho https://www.mbortho.com/service/physical-therapy
Strive Physical Therapy and SportsRehabilitation

Natural Jade Acupuncture and wellness center
713 executive dr. Princeton
609 608 0299

我去过这家。lawrenville那边有一个Mercer bucks Otho https://www.mbortho.com/service/physical-therapy
Strive Physical Therapy and SportsRehabilitation

@N 我同时用上面推荐的维新针灸
415-416 Executive Dr., Princeton NJ08540
Phone:6096816599
Email:xinxin0505@gmail.com
Wechat: Vivide0505      Major health insurance accepted
我看每次有人问针灸推拿，每次都有人推荐她，估计挺popular吧。

Dr. Jianzhong Chen 609-750-1822 
如果不是骨折的话，陈建中医生针九或者推拿
在新州，没有再知道比陈医生强的治跌倒外伤的。以往看到的情形是第一次扎针后病痛应该会好6成以上。

(针灸医生陈玉碧很好啊， 408 Plainsboro Road, Plainsboro NJ 08536.      609) 750-1650
@lyn 陈医生非常好，是我用过的最好的针灸按摩医生，她收保险的

给你推荐一个针灸医生，同时她也做功能医学function medical. Dr. Qingdi Geng,  phone: 609-216-6938, 诊所地址： 339 Princeton-Hightstown Rd. Bldg. C , East Windsor, NJ 08512

Medical Acucare Integrative Health & Acupuncture
M       Qingdi Geng.MD  
Ph: 609-216 6938, Fax: 609-739-9031 Email: into@medicalacucare.com
Web:https://www,medicalacucare.com
我的肩膀痛，针灸3次就好了。

wang13764372308
我的办公室地址：4 Terry Drive Newtown PA 18940 suite 18
中药治疗ADHD

    `,
  },
  {
    id: 14,
    title: " 中医",
    content: `
    *******大普林华人生活群信息: 中医 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
中医


 @all 请问谁有中医针灸治疗的诊所推荐吗？ 
https://hopeacupuncturecenter.com/about-us/ 当时找的zhao 医生 还不错

medical acucare
Address: 339 Princeton Hightstown Rd Building C EastWindsorNJ08512
Phone:(609)216-6938
@yoyo 针灸医生可以找耿医生，疗效挺好的。

林榕生中医
(212) 334-9117

Acu-Care LLC
243 Bridge St, Metuchen, NJ 08840
3700 Route 27, Suite 200, Princeton, NJ 08540
Dr. Jin Lee, L.Ac., MD (China)
Dr. Richard Stillo, DACM, L.Ac. 
Phone Number:  732-790-6303 
Meet the Practitioners | Google Reviews

维新
Weixin's Acupuncture and Wellness
Weixin Su
Licensed Acupunturist(NJ/NY)
Weixin's Acupuncture and Wellness
Weixin Su L.Ac.
Board Certified Acupuncturist (NY/NJ) Diplomate of NCCAOM
415-416 Executive Dr., Princeton NJ08540
Phone:6096816599
Email:xinxin0505@gmail.com Wechat: Vivide0505      Major health insurance accepted
我看每次有人问针灸推拿，每次都有人推荐她，估计挺popular吧。

给你推荐一个针灸医生，同时她也做功能医学function medical. Dr. Qingdi Geng,  phone: 609-216-6938, 诊所地址： 339 Princeton-Hightstown Rd. Bldg. C , East Windsor, NJ 08512

@Grace Zhang, CPA 推荐 Dr. Jin Lee，  http://www.acu-care.com/
Dr. Jing combines her knowledge of Traditional Chinese Medicine with her expertise in Traditional Chinese Acupuncture and Japanese Kiiko Style

Medical Acucare Integrative Health & Acupuncture
M       Qingdi Geng.MD  
Ph: 609-216 6938, Fax: 609-739-9031 Email: into@medicalacucare.com
Web:https://www,medicalacucare.com

我的肩膀痛，针灸3次就好了。

纽约法拉盛重要点有邮购业务
新一洲洋参
ZENGINSENG
GINSENG	ZEN	葉蘇子 SUZI YE	
Cell: 917 681 7878
Email: suziye63@gmail.com
總店地址:40-20 Main Street,Flushing. NY 11354
电话:1-718-886-03001-718-8868518
1-718-886-3508 传真:1-718-886-9519

有人知道普林附近有卖中药的吗？
@Jacqueline 我也找了很久。还是得去纽约，或者网上购：
网上中药邮购
德成行
Tsemporium.com
https://m.tsemporium.com

纽约同仁堂

常用的中成药，美东可以买到。那种需要煎煮的很少见到。

常用的中成药，Edison金门超市比较全

@Jacqueline 纽约金禾中药，如果有方子打电话可以订购，他们可以邮寄

    `,
  },
  {
    id: 15,
    title: "房检",
    content: `
    *******大普林华人生活群信息: 房检 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

购置房屋前的房检/ inspections
@Jenny 这个John比较好，他会告诉你问题在哪儿，怎么修，如果拖下去会怎么样（毕竟不是所有的都立马出现问题，但是可能是早晚出问题，或者小概率某些条件下出问题）。建议你全程录音，虽然他的报告也很详细 . John写了一个一百三十多页的报告，我们律师看得都晕了，说你们的房检太厉害了，还问我们要了John的联系方式。John Martino: mailto:jminspect@optonline.net

House inspection;
我不知道，我找的另外的人。李先生7328871077
中英文都很流利

Inspectors	David Moir	
732-616-4389

﻿@雨寒 Frank Lin
 Frank Lin Home Inspections LLC
 www.franklininspection.com
 (908) 218-0595
 我们买房时用的inspector

Mike Seltzer
732 3098998
mike@inspectorseltzer.com

Inspector Licensed Engineer James Kin
609 851 4401

A title search will determine the legal owner of the property; reveal any mortgages, *liens, *judgments, or unpaid taxes that will have to be cleared before the property can be sold; and detail any existing easements, restrictions, or leases affecting the property.和房检的重要程度不相上下，我甚至觉得更为重要。如果已经投资一百万，为什么要省那有可能有后患的一个零头。当然，如果卖方提供了近期的，你可以只买一个update,总需要的，原则是买个踏实以免后患。我碰到过一个真实的案子，买房的朋友closing那天title search发现房子上有一个Lien,推迟closing 一天，等屋主还清了债务才过户。当然你有空的话可以自己做title search,或找非律师推荐的，但时间通常比钱还珍贵。我知道自己买房时是心甘情愿的买的个人意见，仅供参考
A title search will determine the legal owner of the property; reveal any mortgages, *liens, *judgments, or unpaid taxes that will have to be cleared before the property can be sold; and detail any existing easements, restrictions, or leases affecting the property.和房检的重要程度不相上下，我甚至觉得更为重要。如果已经投资一百万，为什么要省那有可能有后患的一个零头。当然，如果卖方提供了近期的，你可以只买一个update,总需要的，原则是买个踏实以免后患。我碰到过一个真实的案子，买房的朋友closing那天title search发现房子上有一个Lien,推迟closing 一天，等屋主还清了债务才过户。当然你有空的话可以自己做title search,或找非律师推荐的，但时间通常比钱还珍贵。我知道自己买房时是心甘情愿的买的个人意见，仅供参考

@Huhu title company 是由买家的律师选择，通常除非在一开始就告诉律师你想指定那家公司，否则律师是不会主动问买家的，就像@Cecilia Birge, 谢兰 (Princeton) 所说，Title co 的价格是政府公定的，所以找到好沟通, 可信賴的就很重要了，我以下推荐Charlie Liu. 他公司的办公室就在附近，我有好几位客戶用过都滿意，有问題可以和他联系

https://foundationtitle.com/professional-services/ Valerie Mason
Branch Manager
T: 609-586-7077 ext. 2002
F: 609-257-0955
D: 609-631-1219
W: www.ftnj.com
3840 Quakerbridge Road, Suite 210, Hamilton, NJ 08619

Title Charlie Liu
(609)759-1218
mobile
(609) 947-5642
FaceTime
email
cliu@titleauthority.org
work
12 Roszel Rd C206, PrincetonNJ08540 USA NJ US

    `,
  },
  {
    id: 16,
    title: "公证签证银行贷款国内汇款",
    content: `
    *******大普林华人生活群信息: 公证签证银行贷款国内汇款***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

这个公证一般在哪里做，有什么建议吗，谢谢
Additionally, all banks have it. If you have a personal lawyer, their paralegals are usually notaries as well.  @季春(Alice'26) 
去自己银行公证先打个电话预约，因为只有有公正资格的人在才能做，是免费的，去UPS收费有些贵，我有一次花了二十几块，图书馆和邮局应该比较便宜
Nassau 的UPS吧，只要5块钱，不管几个签名。有些人按签名个数收钱，每个5刀。先打电话问好可以公证的人啥时候上班
Township office有公证，$1。

新泽西公证员
Yu Zhong
Yu.zhong.609@gmail.com
仲宇的公证和签证服务很好，他的电话是6097513252. Wechat是yu_zhong_609

27号路HMart附近的华夏旅游也可以代办签证

@普林斯顿陈老师-文书辅导 之前有朋友用过，其他人推荐过美亚给旅游签证的保险不错


@仙人掌 您好！请问三级认证需要准备哪些资料？谢谢🙏

先做一级二级认证，如果娃在新泽西出生的话可以直接找州政府做二级认证，然后再去领事馆官网下载一个申请表填好，如果申请人是家长的话就不用带娃的旅行证了，去纽约大使馆办，大概几天后再去取回来就行了。

二级认证，需要提前预约吗？费用一般是多少？

从州政府的网站上订就可以，这个可以邮寄，不用去现场，费用有点记不清了，应该是小几十刀

https://www.njportal.com/dor/apostille

Broker
David Mcdermott
PenFed Loan Officer
NMLS # 102160
David.Mcdermott@penfed.org   
“They have very good rates”

请问往国内汇款除了西联还有别的安全渠道吗？ 西联最近老是有问题
从自己银行帐户汇去国内银行账户。
只要有对方开户行的帐号、地址、电话、swift code, routing number。电汇的话基本上24小时之内就可以到帐，汇款人有$45手续费。收款人还有$10-$15左右费用

    `,
  },
  {
    id: 17,
    title: "安装更换地板/地毯/地下室装修",
    content: `
    *******大普林华人生活群信息:安装更换地板/地毯/地下室装修 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

+1 (732) 889-6853. 磨地板上漆 $2/sqft 非常好的师傅 就是太忙不一定能接电话 可留言

Floor   赵师傅     
赵勇 (732) 397-5770 。 他专做地板。又快又好但不便宜。
做地板的师傅
赵师傅 732 397 5770
做地板的赵师傅 坐地起价。而且涨的不少。不建议
赵师傅做的感觉上确实好 
Basement waterproof Sal Mendola         609 375-0466            还好，要讲价

郑海雪-换地板
微信号：wxid_exps314z628v12
 
bill电话7323221378handyman
装修地板

推荐打磨地板的人Dr. Dustless, https://www.doctordustless.com 磨出来的灰尘几乎全部用管道排到室外，做完味道也不是非常厉害

地板 Manuel +1 (732) 889-6853

2020年想装修时找过张师傅，人非常好！他的报价每平方英尺装修价位在240-300美元，人工占60%，地下室工程没有承包过他说不太了解。

我用过Daniel做室内隔出来一间房间，drywalling，修补以前起居室墙面的洞，起居室卧室和厨房涂漆，做的很好，非常细致，价格很实惠
地下室装修，水电都可以做，我们加了一个厕所，一个wet bar。
609-255-3028 打电话不太接，但是信息留言，他很快回复
@林月 他们帮我翻修厨房和地下室。价格合理，负责任。可以帮助申请镇里的Permit。

我们去年请了个师傅铺地板，还不错@蒲公英 
(908) 361-2916赵师傅

我刚刚铺完地下室的地板。非常棒  强烈推荐 应师傅 电话： (609) 433-1413

安装木地板和地毯服务
Ceci的微信：XL9083271333

我们用过carpet centers of nj 还不错  
732-254-2060
917-923-7827
Carpet centers of New Jersey是一家中国人，他们只换地毯不清洗

    `,
  },
  {
    id: 18,
    title: "地下室排水整修/sump pump",
    content: `
    *******大普林华人生活群信息:地下室排水整修/sump pump ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

地下室你可以联系顿普 (609) 240-9088 3年前他帮我做过 做得还不错

地下室 (609) 203-0033

Basement everything
Serving NJ, PA, and NYC, Jersey City, Edison, Freehold
OPEN
1-732-697-0557

Ryan Basement
phone
+1(215) 801-5470

William，手机是609-933-4014
我家地下室去年flooded，帮我紧急排水，加之后除霉消毒。人挺实在的，做事也蛮好的。

地下室内修 排水
Bob 7326970557                  

求问 我们要装修地下室 请的华人装修师傅需要屋主自己申请permit 我们申请了之后 有些项目被拒绝了 不知道有没有收费帮屋主申请permit的人或者公司
@J. BaiKevin 6093062600 你打电话问问，留voicemail把详情说说

请问大家有做basement 结构的公司吗？我家地下室的结构柱子要换
Paul Pennachi是做泥土工程，质量价格都很好，(609) 203-0033

BASEMENT                WATERPROOFING   
Call:732-721-4900       
SOLUTIONS       718-761-3698    

BASEMENT WATERPROOFING
Barbara Skurzynski Cell: 908-692-6045
www.njdrybasement.com

地下室淹水弄干净
Fire-water-mold clean up
Servpro 
732-431-4440
请问群友们有好的irrigation contractor 推荐吗？
Hidden springs(irrigation)
(609) 585-7080

did you try hillsborough irrigation? @May 
Physical Address: 273 Willow Road, Hillsborough Township, NJ 08844
Phone: (908) 359-1898

我联系了Fyr-fyer （609 896-0600） 他们可以提供Fire Sprinkler System 检测和服务。

请问大家冬天前一般是自己winterize喷水系统还是找人来弄？
ecosystemsnj.com
我用了许多年。 没有比较服务还可以

大家好，你们都是用哪家做Sprinkler inspection ? 价格如何？有推荐的吗？
1 732 521-1666
Chad
同时维修换抗冷剂，税下来约320

WATERPROOFING	Call:732-721-4900		718-761-3698	

Basement Waterproofing
(800) 865-8787 RYTECH claims@rytechinc.co Structural Drying	Water Extraction	Mold Remediation	(609) 924-9565 DANIEL JANICKVice Cell:609-917-0830

求问： Sump pump alarming  system 哪里买？
Safe Air Systems @Noelle
这家不错。我换整个sump pump ，价格合理。做的非常专业
推荐Safe Air. 帮我装氡气装置，sump pump .价格公道，还专业
zoeller牌子的Sump pump比较好

请问群友们有维修 sump pump 地下排水泵 的师傅推荐吗？
着急的话我一般找Theo，响应几乎是秒回，收费不便宜也不贵。我上次的sump pump加上告警装备大概1000美金左右。
1600美金
Theo Ex Plumbing and Heating LLC2
Phone# 609 838 1843​theoexpiumbing@gmail.com
Total​$1,226.00
609 851 2401

Handyman Daniel 刚帮我换了sump pump, 是我问到的最低的一家。问了几家，Fante报3600,  Theo报1200，但是要等两个星期，因为地下室淹了，等不了，找了Daniel, 他以前帮我装修过厕所，做的很快，才一千多一点。推荐
Daniel帮我们换了全新的Sump Pump，原来的Sump Pump以及备用的Sump Pump都是以前的房东装的，备用的是电池启动的，但是功率太低，上次下大雨地下室井里面太多水第一个泵坏了，备用泵效率低，所以淹水，所有东西都飘起来了！Daniel给我换的这个不是电池启动，是通过水管压力推动第二个备用的sump pump启动，这样就不担心地下室淹水后电的sump pump坏掉。这个sump pump太先进了！

那为啥水总是有啊，泵不完啊？ 
可能可以去室外看看水排去哪里了，或者室外水管排水有情况。水又回流去室内． 
可能是水泵螺旋桨壳子的螺丝腐蚀脱落了  螺旋桨一直在转但是水抽不上去。 
拆了换几个螺丝把盖子拧上就行了 
墙外的管子出水口，可能需要离房远。 
同意！ 起码6 - 10米以外。

    `,
  },
  {
    id: 19,
    title: "接送",
    content: `
    *******大普林华人生活群信息: 接送***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息
，及时登出反馈。群主微信号：yalichen15

taxi/机场接送												

辛先生：732-762-0722
$220单程去纽约机场

给大家推荐一位收费合理的师傅，从普林到JFK收费180，包括了过桥费路费，小费自己给，师傅人好，准时靠谱，没压力。车子干净，师傅早了十分钟到，非常靠谱，行车技术也好。是我找到的去JFK最低的价格了。推荐，师傅叫木杉，微信号：liyongbin602529
6092168105
对，我也一直用这位师傅，推荐+1

您好， 普林到JFK 单程是$200美元 谢谢
是的 已经包含过路费了 没有其他杂费， 小费随意没有强制要求
微信号：bugbug-bugx3

大家好，请问有接送机的司机师傅推荐吗？从西温莎到JF K 的
@Lily Chen_普林斯顿 我们用的是你发的list 上的东歌旅游车，West Windsor送机JF K往返280，mini van, 去机场3人，返程1人，四个行李箱
												请问知不知道Uber 和Lyft 这些预约凌晨四点去机场的专车靠不靠谱呀？
很担心到时候没有车来接我们[捂脸
我们一家人12月31号凌晨四点从普林downtown出发去LaGuardia Airport
我在中文报纸上找到陈师傅 609-380-3966，准时周到
$接190， 送170 单程去纽约机场

东歌旅游车包车机场接送
6097213702
$230单程去纽约机场
@Xiaoguang 我們都用東歌机場接送服務 他的微信ID Kevin-Guo78288

机场接送
(848)248-8885

请问哪位有接／送机场的师傅微信／电话？@Moshe +1 (973) 727-6295 Frank Wang

尹敏师傅-wxid_thveqkrb6gde12
目前还是接送，或者小型旅游，鉴证服务等，收费一般是送一百八，接二百 
Neward只要八十
送机简单，接机会花更多的时间。
6097218805

请问，大家有靠谱的能推荐的接机服务吗？以及，半夜从JFK接机需要多少钱？
@Ethan 我有，220元，半夜大车，小车200元
y9096155005

请问一下，谁有送机场的司机的联系方式吗？谢谢🙏
浩哥
Haoge681027
还有 bugbug-bugx3这位师傅

@麻雀鼠 大群有群友推荐陈师傅，微信号：liyongbin602529
@Lily Chen_普林斯顿 这个师傅不错

请问哪位有接／送机场的师傅微信／电话？@Moshe +1 (973) 727-6295 Frank Wang

@Xiaoguang (848) 248-2608大龍先生，机场接送，不过叫Uber比较便宜

云龙
微信号：w7326681913
你好！去Newark，你是住普林斯顿吗？费用是60元起？人数、行李多、和夜间价格会变化
正常3-4人，3-4件行李就是60元，单程是70元，双程接送都找我每趟60元
$240单程去纽约机场
@Lily Chen_普林斯顿 接送机反馈：云龙不接凌晨单，说太早起不来

@Fran 你可以联系Yongbin Li (609) 216-8105 收费合理，纽约、费城、纽瓦克机场都去，用过的朋友都满意
哪位知道从纽瓦克机场坐火车到普林 机场出来到纽瓦克火车站是要走过去还是有什么接驳车之类的？
@Lucy- Princeton 裝一個NJ TRANSIT的app
AirTran到每個幾樓。不是免費的22美元（已經包在NJT的票價裡，需要那張票進入）。 NJT 有一站專門去機場（叫EWR)，不是紐瓦克Penn Station。
從普林斯頓去NY JFK: NJT 到NYC PennStation, 在裡面轉Long Island Railroad (LIRR)去（停）Jamaica 的车（多条线路都可以，两站左右）（off-peak City Ticket 才$5）； 在Jamaica 转AirTran（$8）
先在機樓坐AirTran到NJT(先無需買票）。在那裡買NJT的票去Princeton Junction. (需要那張票進入）。 然後去Trenton 方向的站台。一定要上去Trenton 的火車，其它終點站的火車不能上。
在機樓裡AirTran去NJT方向好像叫RailLink.

需要提前买票吗？NJT我知道怎么买
不需要提前買票。但是如果有LIRR的App, 可以提前買好票，到時激活（activate）。 AirTran 則可以當場買票，也可以用紐約地鐵卡直接進去。

    `,
  },
  {
    id: 20,
    title: "孩子音乐钢琴",
    content: `
    *******大普林华人生活群信息: 孩子音乐钢琴***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

普林斯顿六月份新来的一位钢琴教师：王迦勒博士。毕业于莫斯科国立音乐学院，他曾是大学教授、博士生导师、国际比赛评委、五四青年奖章获得者，甘肃兰州人。他的很多学生取得了英皇考级（ABRSM）的Distinguish成绩、国际比赛的一二等奖、考取了世界多所学校的附中、本科、硕士及博士。王教授将在今年6月中旬正式移居普林斯顿，为孩子从事正规系统化的钢琴训练及音乐熏陶，帮助学生实现不同等级的目标。目前正在招生。有需要的爸爸妈妈们请及时加王教授微信（微信名：calebwang330）入群咨询。
我已经开始上王迦勒老师的课了，非常优秀

请问大家有附近的钢琴老师推荐吗？普林的，谢谢！
Peter 6092131471
我们跟Peter的经验很不好，不推荐给青少年

钢琴老师inessa Shindel
Piano Teacher
(732)951-3007

westminster choir 老师 钢琴老师lattore 
+1(732) 688-9064
还好。就是忘性太大了，常常忘记讲过什么

westminster choir 老师 Michael Jacobsen; Suzuki method
完全不推荐，非常浪费时间，根本学不到东西

westminster choir 老师 Carol Comune,
总是批评孩子过于严厉，孩子在她手下不再喜欢钢琴了

我们钢琴老师住west windsor， chloris li，她教课很认真
chlorisli@gmail.com

钢琴老师Denitsa VanPelt，前westminster choir 老师，Suzuki method
denitsavanpelt@gmail.com
5136001512
东欧人，非常严格，如果孩子很有天才也愿意吃苦，这个老师不错。但是如果孩子资质一般，这个老师过于苛刻了，一般的孩子越跟她学越不喜欢钢琴。

我推荐这个studio 有钢琴私教 Steam Works studio
135 Village Blvd, Princeton, NJ 08540，Phone: 1(844) 265-9880 
Email: info@steamworksstudio.com

在Princeton这一帶，我强力推荐我的鋼琴老师张冰冰732-668-4251，她周五在Westminster College也有教課，如果不介意开远一点，也可以到Warren找她大姊Wendy ，Wendy 比较嚴格，擅長培养比赛技巧908-542-9435，我没跟她学是因为她對我不会手软，而且我不需要参加比赛
不好意思，我分享一下个人观点，群主发的鋼琴老師名單中，在Warren 的鋼琴老师Wendy是我大姊，Wendy是去年NJMTA（ NJ music teacher association)president她非常擅长帮孩子根据个人风格争取比赛得到最佳成绩，教学风格严谨，适合小朋友自己很有兴趣会主动練習和家長配合度高的家庭，而张冰冰老师是我目前的鋼琴老师，很有耐心而且很会鼓励学生（至少对我是这样）张老师会分享作曲家的背景和创作过程等等有趣的信息，能让学生在練習的时候感受到曲子的意境，兩位都是很棒的老师，認真负责而且有深厚专业功底

Piano Tuner
732 672 0930

钢琴调音钢琴维修保养上门服务
电话:7325200355
刘先生 

我家女儿的钢琴老师推荐的Piano Tuner，用了许多年。键有小毛病也顺便fix
Piano Tuner Chris
+1(609) 426-1818

调琴Joe的电话732-600-8080
Email:Josephvincentbutler@yahoo.com

家里钢琴要调音，麻烦大家有专业人士推荐的吗？多谢🙏！
打这个电话问问，+1732 887 4297

钢琴老师Fang-Ting Liu Piano Teacher Piano Teacher
(609) 520-8999

钢琴老师婉玲
微信号： pianolu0215

我推荐这个studio 有钢琴私教 Steam Works studio
135 Village Blvd, Princeton, NJ 08540，Phone: 1(844) 265-9880
Email: info@steamworksstudio.com

专业古筝老师：我一个朋友施老师，教学认真细致严谨，上海音乐学院毕业，现在学生已满，如果有空位可以接受新学生。jeansze@comcast.net 如有空位，会及时通知。

    `,
  },
  {
    id: 21,
    title: "修汽车",
    content: `
    *******大普林华人生活群信息: 修汽车***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

修车/Car body work																			
群主 下面这家修车行非常推荐。老板态度好 效率高 收费合理。还有一个在我眼里是个大毛病的Ac制冷不 strong， 技师免费检查了一番后 修了个小部件 老板根本没收费。我感慨怎么会有这样的老板啊
ADVANCED
AUTO CENTER
3817 Route 1 South, Monmouth Junction, NJ 08852
Dependability & Reliability For Less
MANOJ BANSAL
(732) 821-1006
njadvancedauto@gmail.com
njadvancedautomotive.com

claudio auto service：
86 Sandford St, New Brunswick, NJ 08901
 (732) 640-2880. Call Now · Visit Website. https://claudioautoservice.com
查故障到修好一共花了1.5小时。中间我问的问题都很热情给我回答：给我讲解故障
原因，给我看更换了哪些配件，提醒我自己下次应该怎么维护，服务好不周到。
菌最后130、搞定，我自己查过配件价格所以账单拆解下来是：两种配件（600上下，自己买可能要七十。）
+工时费（一个半小时70

朱先生到府修车 Mobile(732) 668-7853
非常推荐朱先生。很容易联系，的确是来家里修车，手艺很好，人也很随和，价格非常合理。
Jeffi Lube看过我的车的故障，告诉大概的问题和修车价格范围，但是他们不修，朱先生的报价是这个范围的低线

修车曾师傅	7323225582		
非常便宜	
曾师傅有自己的修车铺。他比dealership实在便宜太多了。
他的garage叫On the way auto repair
水平很高，但是很多项目不做。只修理不保养
处理：车辆电路故障类诊断；维修车辆机械故障类诊断；维修车辆异响异常类诊断；维修车辆引擎故障类诊断；维修车辆空调故障类诊断；维修刹车悬挂皮带水泵排气管；处理所有故障类问题；处理所有电路机械类问题（不处理事故碰撞油漆）
不处理:换油/保养/轮胎四轮定位不处理:前后挡风玻璃更换不处理:事故碰撞钣金喷漆不处理
修车要排长队
这是 Bridgewater 一个修车行，朋友介绍说服务不错
🏎️ON THE WAY AUTO ☎️:8482646822 (办公室电话）
📞: 7323225582 (Emergency ）🈺️业时间 8:00-6:30 周一至周六 店铺地址：111 Canal Road  
south bound brook NJ 08880 

Kingston Garage
6099216134

群主 下面这家修车行非常推荐。老板态度好 效率高 收费合理。还有一个在我眼里是个大毛病的Ac制冷不 strong， 技师免费检查了一番后 修了个小部件 老板根本没收费。我感慨怎么会有这样的老板啊
ADVANCED AUTO CENTER
3817 Route 1 South, Monmouth Junction, NJ 08852
Dependability & Reliability For Less
MANOJ BANSAL (732) 821-1006 njadvancedauto@gmail.com njadvancedautomotive.com

J&A Automotive on River Road in Ewing. (Near Revere Restaurant) . Honest and knowledgeable. He moved from a gas station on Route 31 to open just a garage for cars, doesn’t sell gas. (609) 388-7551

Matt’s auto 1580 5th St, Ewing Township, NJ 08638 we’ve been going there for years. Great people down to earth.

推荐一个car deep cleaning。honda princeton。内：100、外：100。做出来就是可以直接卖的状态。
Honda Princeton dealership

请问附近除了Costco，还有其他靠谱的Tire Shop么？ 谢谢
大家换轮胎，是用普林斯顿靠北边在Route 206上的Mavis Discount Tire 吗？
我家用的Costco换轮胎
自从有了Costco，就一直在用。他们不仅车胎价钱便宜，价钱里还包lifetime tire rotation (every time you change oil, or 10,000 miles), hazards repair (修补车胎穿洞）。
我用过130上那家，还不错
谢谢！我家只用了206 路上这家Mavis Tire换车胎，平时换brake 和机油之类都在这家，因为离家近。好像两位年长一些的先生是店主，态度比较和善。顾客要求提早更换的部件和车胎，店主能按顾客意见换，以免在自己需要出门旅行时错过修车机会。Dealer 远一些，约修理时间等的久。

换机油和其它液体，我一般去在Route1， Lawrence的Jiffy Lube（at Franklin Corner Road)

群主和群里朋友，麻烦问一下：昨天停车的时候不知被谁把车门处碰了一个瘪，请问群主可以帮忙恢复吗？或者去那里可以处理恢复原状？谢谢大家！
908 4133529 专业修复

Meineke-2813626 US 206
Hillsborough, NJ08844
meineke
(908) 428-7206
DOING CAR CARE 
hrag2813@gmail.com      
https://www.meineke.com/locations/ry/hilisborough-2813/
是在206上一家店
被群友指出那是一家很差的黑店

请问大家附近有哪些服务可靠的 repair garage, 我需要做 wheel alignment 等常规服务， 谢谢
GOOD


我的车𥦬玻璃裂开、有car body 推荐吗？多谢
AutoGlass
safelite.com    Mobile Glass Shop       
800-800-2727    safelite.com 800-800-2727       
Hy urter is fF39251800-315.1257

请问大家， 有靠谱的汽车贴膜店推荐吗？谢谢！
MINT TINTS56 Troy Ave. Ewing, NJ 08638609.403.6121
I recently just used their services.  They also do car wash. 
They are also DMV approved.
3M film for tinting is supposed to be the better one.
New Jersey Window Tint Law
jdpower.com

换机油的店“STS”778 State Rd, Princeton, NJ 08540
美国

haha, 我刚刚研究过。1）BNB car wash on route one. 732-821-0100。2）(732) 803-2860 Markus. On route 27. He is very busy and booked till November

Gino’s Auto Body Shop
4360 NJ 27
Gino body shop	7322970609
Gino’s做exterior的，interior可以找KPS Princeton garage

@Fiona , 206 上的mavis discount tire, 1 号公路的 pep boys 。 用过这两家，感觉都不错

City body work	609-448-9800
180 Mercer Street, Hightstown								

Auto repair	
41 Main St, Woodbridge, NJ 07095

JC
John Chen Car Service
mobile
(732) 763-4020

Kent Dai Auto Repair
Auto repair shop in Edgewater Park      22+     
(609)880-9555
609-792-6667
Kent is our car mechanic for almost 20 yrs. Highly recommended.
这位邻居有修车铺，口碑好
我也推荐Kent
DAI AUTO REPAIR DOMESTIC & IMPORT609-880-9555
戴氏
OIL CHANGES      BRAKES  ·COOLING SYSTEMS        
4331 US-130 Beverly NJ 08010
DAI AUTO REPAIR 你找Kent， 他家住Princeton， 可以上门看的
6097926667 Kent

Bob's Auto Services
15 Cold Soil RdLawrenceTownshipNJ08648				
我最近去了这个还好

Mr. Tire Auto Service Centers
Tire shop in Montgomery Township, New Jersey
Princeton North Shopping Center Services: Air & cabin filter renlacementAir conditionina Ant
(908) 837-1922

修车/Car body work                                                                                                                        群主 下面这家修车行非常推荐。老板态度好 效率高 收费合理。还有一个在我眼里是个大毛病的Ac制冷不 strong， 技师免费检查了一番后 修了个小部件 老板根本没收费。我感慨怎么会有这样的老板啊 ADVANCED
AUTO CENTER
3817 Route 1 South, Monmouth Junction, NJ 08852
Dependability & Reliability For Less
MANOJ BANSAL
(732) 821-1006
njadvancedauto@gmail.com
njadvancedautomotive.com                               

请问下  汽车前挡风玻璃被掉落的树枝砸出了裂缝，保险能修吗？如果不能的话有没有推荐修理的地方呀？
Safelite 可以修或者换
裂缝不大的话 可以自己买修补玻璃的胶水 我的车玻璃曾经被石子砸了 5 公分长的多条裂缝 自己都补了

请问有没有洗车场的讯息？谢谢🙏
洗车服务
Valet Auto Wash Lawrenceville
4 Litho Rd, Lawrenceville
自己来很方便，也有人工洗的

@CindyGustus https://www.princetonhonda.com/?utm_campaign=gmb&utm_medium=organic&utm_source=local
Just called last week. Interior detailing is $100 and exterior with wax is another $100.@CindyGustus 

    `,
  },
  {
    id: 22,
    title: "口腔整形医生/种牙/牙保险",
    content: `
    *******大普林华人生活群信息: 口腔整形医生/种牙/牙保险 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

整牙
@菲菲 Dr. Chi Taw Lin, DMD,
Dentist in Hillsborough Township, New Jersey. 他和儿子的私人牙科诊所。全家在他那儿看牙近20年，有25分钟车程。非常有经验和负责任。建议先电话咨询下。
(908)359-5243
smilinfamilyorthodontics.com
Christopher S. Lin,DMD

Princeton Orthodontics:
Jonathan Nicozisis	TTONCATHOOO	
J Russo Jr., DDS, PA	Orthodontic Sp	
than L Nicozisis, DMDMS	for Children	
Get onlinecareprincetonorthodonticsnet
601 Ewing St#B12PrincetonNJ08540
Dr. Teresa Oh
General& Cosmetic Dentistry
TERESA OH D.M.D. By Appointment Only
33 State Rd. Suite G PrincetonNJ08540 Tel:(609)924-4421 Tel:(609)921-3287
teresaoh09@gmail.com

Princeton Dentistry 
Suite C-16, 601 Ewing St, Princeton, NJ 08540
（他幫我做拔牙和植牙）
（他們不會中文，但目前英文溝通從沒遇過問題）

我儿子在plainsboro整牙。smile orthodontics
你问问Plainsboro tony Tyan, sweet smile Orthodontics, 应该比这个略低。 需要看保险。我个人推荐

Together, Dr. Chen and Dr. Cabri focus on utilizing and learning about the latest technology to treat a variety of orthodontic and skeletal disorders in children, teens and adults. 

我家孩子是先选了自己住的镇上的整牙诊所由同学的家长介绍去的。扩张牙床后装上Brace 后发现在三周内，牙齿是松动的。选哥大牙医学院教整牙课程的陈医师（见上面). 才知道华裔的孩子牙根浅，不能用大力强度brace. 另外亚裔和其他种族在牙上是有区别的。

陈医师是自己动手整牙，而过去镇上的诊所是二，三十岁的助理给整牙。虽然陈医师的诊所在Ridgewood 和法拉盛，我们是坚持下来基本上周六去法拉盛整牙。以前有获奖Mrs. New York 的女士是由陈医师给从小整牙的。
Ridgewood, NJ	Flushing, NY	
150 Franklin Avenue	4107 Bowne St. # LC	
Ridgewood, NJ. 07450-3206(201) 444-1712 CABRI ORTHODONTICS(718) 762-1100 Flushing, NY. 11355-56
五年前，好像陈医师诊所收费5千6。当时自己镇上的诊所收6千（包括保险部分). 

﻿Dr. Teresa Oh
>>> General& Cosmetic Dentistry
>>> TERESA OH D.M.D. By Appointment Only
>>> 33 State Rd. Suite G PrincetonNJ08540 Tel:(609)924-4421 Tel:(609)921-3287
>>> teresaoh09@gmail.com

Mountain View Orthodontics Orthodontist·6.5mi
378CR-518
Skillman,NJ 08558 United States +1(609) 466-5300

我会推薦Pennington的Dr Hoffman ，夫妻兩人都是牙醫但是先生技術比較好https://penningtonfamilydentistry.com/dentists/bernard-l-hoffman-iii-dds/
我自己和我孩子们都做過，$3950是很合理的價格，我女兒大約12-13年前做已经$5000多 我20年前在East Brunswick 做也要$3300左右 

我想问问各位群友，有没有孩子做过braces的。我接到一个报价，是3950美元，第一次交500，然后每个月交173，但是不接受其他保险（如果有其他保险，这个价格要每个月多加160美元）。大家用过的有比这个更低的吗？多谢
我想问问各位群友，有没有孩子做过braces的。我接到一个报价，是3950美元，第一次交500，然后每个月交173，但是不接受其他保险（如果有其他保险，这个价格要每个月多加160美元）。大家用过的有比这个更低的吗？多谢
大家回复都说这个是最便宜之一的。我是在Eastern Dental Lawrenceville（开车二十分钟）看的Dr. Nick. 觉得他很好，华人或者亚裔。但是他去了另一个诊所,也是Eastern Dental，但是Flemington诊所。开车四十分钟，433 US highway 202, Flemington NJ 08822, 9785475509.


@人在他乡 如果是小孩做，而且将来小孩是要当明星的话，可能要考虑 Dr. Chen-Cabri. Dr. Chen 的诊所在Ridgewood, NJ和Flushing Chinatow, Queens,NY. Dr. Chen 可以称为亚裔女性在职场上的楷模。对工作的态度和技术和知识是让我们特别感动。女儿长大也想做Dr. Chen 这样的医生。医生工作是为让小孩有个美丽笑容，而不是看要交的整牙费用。陈医师在哥伦比亚大学教整形牙科。陈医师收的费用并不贵。但要去看陈医师，路那么远。是要有决心，有能力的。

请问一下大家，有没有好的牙齿整形的医生诊所推荐
Dr. Robert Silverstein, DMD
牙齿矫正医生．

Pennington,NewJerseyUnitedStates·231connections Albert Einstein Medical Center
BRIGHTER DENTAL CARE 
Brighter Dental
Address: 29 Emmons Dr Suite C8,PrincetonNJ08540
Phone:(609)514-1666
Appointments:brighterdental.com

phone 800-365-8295 or at www.CareCredit.com.
One Airport Place, Suite 2	378 S. Branch Road, Suite 304	
Princeton, NJ 08540	www.sabinskyorthodontics.com	Hillsborough, NJ08844	
Tel: (609) 252-0233	NJ Specialty Permit #3955	Tel:(908)369-8900
这家用metal braces，治疗时间两年半，报价$5880。
这个报价没有考虑保险可以报销的部分。
是呀，这家比我去的第一家便宜，这个价格是全包了。这个牙医应该是个东欧人，姓以“斯基”结尾。
不过钢的比较有力气，速度上会快点。我记得Jenny rong 说同一个人的钢的便宜

我上周给娃买了Delta的保险，下个月就可以用，箍牙报一半
https://www.deltadentalcoversme.com/s/?agency=1798961367

植牙專科Jason Chang 張景舜         732-777-0660(O)   離Edison  火車站不遠，好像有兩天在freehold office 
植牙要分几次做，跑紐約路費不少而且耗時。Edison這邊有個Jason 張醫師，人親切，技術好，值得一提。
 @K - 我没有用过Dr Jason Chang. 我们在Brighter Dental 服务比较基础，成人仅仅是就是洗牙，孩子做了隐适美（Invisalign）牙齿矫正。我女儿很喜欢她矫正牙齿的牙医，带牙套挺负责任的。

植牙去纽约找华人医生，我植一颗牙只花了200刀和两年的保险额度，不过我的医生不收新病人

我去年做的植牙好像是$2500-2700左右
但我不用做bone graft，因此便宜一點。
所以可能也沒有任何參考價值
如果幾個醫生都報這個價，那可能也就差不多這個價了吧。
如果願意，可以去牙醫學院的診所看看（由牙醫學生或實習牙醫操刀），一般他們會比較便宜，有時waitlist會比較長。
這是羅格斯的牙醫學院診所，可以預約看看：https://sdm.rutgers.edu/patient-care

陈健 她在普林群 她做植牙ok Princeton LC Quality Dental.

East windsor 的Brace place orthodontic 也不错，我们是去这家。住west windsor 的很多去这家

我有點忘了 
我去年植的
但我記得最後是$2500
但這裡面有包括植牙+補兩個個蛀牙和一個牙冠
但詳細的價錢我忘了
orthodontist 幫我拔牙的錢是另外算，我記得三四百的樣子。

MetLife 的牙保险会给50%植牙
一般4-6K一颗

@普林斯顿陈老师-文书辅导 我植牙是曼哈顿的一个韩国医生不错现金给折扣后3700，这是牙医给介绍的，需要的话给你电话

我母亲去一个叫Magic Dental 的家庭口腔诊所。她拔牙，做了全口假牙，还有植牙。折腾了好几个月，花费不少。她用的Specialist是 Dr. Jeffrey Rothstein。  Dr Jeff 是全科口腔医生，他在植牙方面很有经验，另外他们有一个中国护士，沟通很方便也很有耐心。我觉得他们植牙价格还比较公道。https://www.magicdentalnj.com/about-us/

我们用Brighter Dental,  比较近。服务我也没啥好抱怨的。我女儿也在那里做了envisalign.
她下面植了两颗牙柱（白金），支持下面的假牙，这样假牙在嘴里就不会移动。 两颗$6000。上面没有植牙。
医生说看牙床骨头的情况，一般固定下面假牙需要植2颗或者是四颗。

@Lily Chen_普林斯顿 各位群友，请推荐一个种植牙的医生。谢谢

有朋友推荐过princeton dental group。也有用过brighter dental说不错的、但我们自己的experience非常糟糕。被随便更改appt时间然后receptionist非常rude。他们的好处是是一个全面的practice你补牙和种牙不用去不同地方。

contemporary dental inplant center. 212-269-9500. Madison Ave. 看了他们网站现在价格整套是2千4. Inplant+ crown.我记得当时还另加了300 x光费.

友情提醒：种牙一定要提前做好功课，包括整牙，不同医生技术不一样用的材料形式不一样（比如🦷钢钉是螺旋还是打压，大的公司十-15年后的替代材料稳定性）

有关植牙，这个都是自费，及其昂贵，我觉得大家需要货比三家多问问价格和服务。一般牙科家庭诊所肯定比brighter dental这种医疗集团便宜一些。

我母亲去一个叫Magic Dental 的家庭口腔诊所。她做了两颗植牙。全口假牙，折腾了好几个月，但我觉得医生很仔细，不厌其烦。医生是 Dr. Jeffrey Rothstein。  Dr Jeff 是全科口腔医生，他在植牙方面很有经验，另外他们有一个中国护士，沟通很方便也很有耐心。你可以去问问 https://www.magicdentalnj.com/about-us/

估计病人多，不太愿意接受新病人。我们刚开始和Brighter dental约洗牙也等了四个月，后来各种维护等预约就快了，都在一个月左右。附近开车半小时内这么多诊所，不一定要去普林斯顿的。

Highly recommend Valley Dental hopewell. He is a great person and a great dentist

Dr.Alexander Kim
Endodontics
(609)771-1200
2999 Princeton PikeSuite4 LawrencevilleNJ08648 United States

加一个自己的体验：我想问问各位群友，有没有孩子做过braces的。我接到一个报价，是3950美元，第一次交500，然后每个月交173，但是不接受其他保险（如果有其他保险，这个价格要每个月多加160美元）。大家用过的有比这个更低的吗？多谢  
大家回复都说这个是最便宜之一的。我是在Eastern Dental Lawrenceville（开车二十分钟）看的Dr. Nick. 觉得他很好，华人或者亚裔。但是他去了另一个诊所,也是Eastern Dental，但是Flemington诊所。开车四十分钟，433 US highway 202, Flemington NJ 08822, 9785475509.
好这个3千多还是便宜的，在Hillsborough 一家上次报价5千多
我儿子花了6000多


请问有可以种牙的牙医推荐吗？
@杨依诺Jing 种牙我用的Prestige Oral Surgery，也在楼主的list里
医生态度一般，技术不错，
@MiniDot 谢谢，会不会很难约呢？
不难，你要牙医开好referral就行。去了就是拔牙植牙，多了一句不和你啰嗦

如果butget 是考虑因素的话，可考虑去纽约 contemporary dental inplant. 他们做得多技术也好, 比local省1/3 到1/2, 但是如果牙骨有问题他们不管。总共要去4-5次。

还有他们不管保险，没有out of network coverage 的不合适

    `,
  },
  {
    id: 23,
    title: "电工",
    content: `
    *******大普林华人生活群信息: 电工 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

电工/electrician
609-647-4986 Licensed Insured 

Taras Levytskyfy, electrician, 908-343-6667
he installed our gas generator.  He told us which one to buy.
总是找不到，不接电话不回信息
联系了，没回音

Gregg Mcgreevy
Install Tesla Charger
201-306-1493
2-4K quotes安装充电桩
Greg Mcgavvy
Power Plus Electric LLC
Powerplus.electric@yahoo.com
201 306 1493
回复很及时

安装充电桩
LODI handyman Pro
646-9568917
$3200 装200A upgrade； 1700 美元再加一条线

費城老趙:
2673569608

Bucky - Electrician
Mobile:+1 908-220-1222
Home:Kimizenun@hotmail.com
人非常好，报价合理
回复太忙了 ，排队太久
2.9K 充电桩

Don Savage	7327403911			
strong recommended
联系了，没回音
	
@Rebecca Edison的Dave师傅我们用过。换新空调，修旧空调，换暖气机，大小电工活。有牌照。(732) 672-4527 。是不是一个人？

Todd TWO Electrician
732 407 0172

Jolts Electric- speak with Shawn- he is licensed and insured- (732) 816-2651

Kenneth Marshall Electric (609) 443-3166 H

Peter Birkin. 215.499.2951.

Call Chuck Thomas Electric 609 209 7716. 

Charles Lewis....609-902-6009

Gregg McGreevy 201-306-1493

Eric Sparks 17325334246

Jose
609-203-1016

Electrician Steve
phone
(908) 601-2119
Already retired, Juan and Joe used to work for Steve.
Update：人确实很好，可惜已经退休了 

To All,  I would like to recommend a licensed electrician to you, very good price, very responsible, his cell is 732-484-2231

Glenn A. Dobron
Electrical Contractor Inc.
Hamilton, NJ 08619
609-586-3400

Alan 908 812 9949
Electrician
回复很及时，偏于做商业项目，不太愿意接住宅项目
	
Again, I highly recommend the licensed electrician Mark (609) 462-2258. He is very reliable and helpful. He is very patient and nice. His estimate ( price) is reasonable. A very good guy.
联系了，没回音

Princeton Electrical Makeover
价格不清楚是不是市场平均价，没有跟别的店比较过，但是整个project 过程觉得很pleasant, 装了四个灯，包括墙上挖洞装新的j box.
刚用了 Princeton electrical makeover 很专业 价格不清楚是否是市面平均价 没有跟别的店比较过 但是整个project过程觉得很pleasant
我们用过他们装两个天花板的射灯和三组（每组四个）插销，要拉线，因为是车库改成办公室。最后账单2000美元。质量特别好，我们有次以为灯坏了还跑过来看一次。小伙子非常敬业也讨人喜欢，就是很贵很贵。

@Y an Qi    James (215）266-2643，我家盖新房子时用的老美电工，很专业人也很好

Tony DiFalco
Electrician
+1(609) 751-2401
1st hour $165then $155/hr
我来推荐一位电工，靠谱！
Princeton local

请问大家🈶️电工推荐吗？我家厨房stove不work了，看error code是电有问题我的电炉的问题今早解决了
是pseg的worry free送来的人解决的
你提到的tony，好几个人推荐给我了。我找了他，他建议我先找appliance的tech，他是个很诚实的人

Andy Miller 
267 688 5864
回复很及时

Almeida Electric
License# 16967
North Brunswick,NJ 08902        Call: Luan Glmeida      
www.almeidaelectric.com almeidaelectric@hotmail.com732.266.3639
Juan 908 392 2750
Juan, 是西语裔，我的agent把所有电路的活儿都给了他，我最近用了一次，不错，等了我20分钟，当天就来了，问题出在入户的circuit breaker, 不是内部问题，他给检查，解释，然后告诉我以后只有一半房子有电的情况，直接给PSEG打电话，半夜都可以打，然后没收我钱，因为不需要修理
回复很及时
报价偏高些

Bardachino	
609-490-0542
联系了，没回音

@All 请问群友有用过接房外power outlet（for outside patio lights) 的电工吗？
有。邓浦(609) 240-9088

    `,
  },
  {
    id: 24,
    title: "房屋里外喷涂刷漆",
    content: `
    *******大普林华人生活群信息: 房屋里外喷涂刷漆 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

房屋清洗喷涂刷漆/painting
Beker
Exterior Painting
phone
(908)721-8201
work
Bixim42@gmail.com

Mercer Painting Ali
phone
+1(609) 203-8023
Mercer Painting
四千SF,我房子矮，收费六千多
Mercer Painting& Power Washing
Ali 609 203 8023
mercerali.la@gmail.com
@麟  Mercer painting. 体验非常差
@苏超 如果你家整栋房子刷外墙，我可以给你个参考，西雅图的single，外墙面积估计你家的2/3，形状不复杂，也是不sanding，就是powerwash，calking，总价9000，去年八九月，一直给我干到十月份，前后拖拖拉拉两个月完工。一万出头目前行情，我估计家家如此
@楼 Mercer painting Ali 大家谨慎选择。洗完墙后，嫌从前报价低，想偷工减料。最后感觉不划算，终止了合同。弄得我匆忙找另一家，还要付给他们powerwash 钱。非常不守信用
提供另一个input, 公平些说，Mercer painting挺不错的，价格公道，刷漆和power wash, 很负责做得也仔细，顺便帮我把地线漆了马蜂窝也去除了没有额外收费
我们家现在在做deck painting, 是看了群里介绍的 Mercer painter. 刚刚做了power wash, 还没开始刷 。 但是他们不修坏掉的木头。
@Lei Mercer painter 给我家做过power wash.客观的说，比certapro细心太多了。刷漆没用过

@All 有没有用过的house power wash company 可以推荐的？
清洗外墙.屋檐刷漆
Olivio
Alvarado
60967298630
住宅
6099648537

之前用过Ned Stevens洗外墙。他们也洗窗子。还可以

@荷 刚用了ori刷外墙，觉得还可以
Ori 609-668-7488

@Lily Chen_普林斯顿 我用过一家洗窗户的公司，感觉还可以：https://www.fishwindowcleaning.com/Trenton-NJ-669/?gclid=EAIaIQobChMIwJX0hfSvgQMV0NPICh2LqQNqEAAYASAAEgL9h_D_BwE Sent from my iPhone

Caceresm.
Painting Llc
609·937-0947    PRINCETON,NJ

609-668-7488
PAinting ANDTRIM.COM
INTERIOR & EXTERIOR by Ori Avisar
@短 我用了这家。整体还算满意

Molding and Painting
Ori Avisar	
609-668-7488

DM Construction Power Wash	(732) 500-1050		
Very reasonable	

Painter	Oliver Painting	
609-672-9863
609-964-8537

收钱后偷工减料的也有。certapro,网上review 非常高。结果干起活来只刷一到。糊弄人说是两道。自己不上心看着，根本看不出来
我也用过certapro， 确实是他们糊弄人，说好刷两遍，结果只刷一遍，谎称两遍

看到您在群里问deck油漆的事，推荐一个郭先生
我见过他的工作后，请过他油漆，觉得不错
电话917-325-2662 有信必复，谢谢

我用过Daniel做室内隔出来一间房间，drywalling，修补以前起居室墙面的洞，起居室卧室和厨房涂漆，做的很好，非常细致，价格很实惠
609-255-3028 打电话不太接，但是信息留言，他很快回复
刚用Daniel，确实drywalling，刷漆很好，推荐！帮我们加了一道墙，还修了窗框。他说以后不再帮客户修窗户，最多只修窗框。他解释说修窗户换窗棱不挣钱，整个换窗户才挣大钱，修的时候有风险因为少数玻璃会碎，这个没法防止因为粘连。虽然本来修窗户替客户省了很多钱，他说有客户看到一两块玻璃破了就态度变得恶劣，即使他一直在补救帮助找而且最后找到同款玻璃。所以他基本不再接修窗户的活儿，本来这个地区基本也只有他愿意接这个活儿。
屋内油漆，起居室和厨房，很多精细活，Daniel的公司确实做的不错，真细致！价格很低廉。

我在这里给大家介绍一个装修师傅做油漆水电，电话7189082188
 
屋顶/涂漆(908)705-5841
East Brunswick, NJ
    `,
  },
  {
    id: 25,
    title: "割草/庭院清理和冬天铲雪服务",
    content: `
    *******大普林华人生活群信息：割草/庭院清理和冬天铲雪服务 *****
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

庭院清理的公司冬天一般都做铲雪服务

Wilson’s Landscaping.   老板Wilson Reyes.  电话 6099156210，我家用的这家公司，非常经济实惠，做的很好。@Lily Chen_普林斯顿 可以加进去

Victorino Landscaper
+1(609) 865-2164

我用过并愿意推荐的supplier： landscape designer Jim Davidge （415) 987-4649

SunnyGarden		Mario	6095770462		very reasonable 
does both hardscape and landscape work	
							
Fairway green lawn			(908) 281-7888		
Not cheap, but really worth it. Last year I was using Green Lawn fertilizing, it was cheaper, however, the weeds were not well controlled
 Fairway green lawn more expensive, however, weeds are much better controlled. The customer service is great. 

Carlos
609-3019604 a local gardener

Treboland Landscaping
609-964 9873

David’s Lawn Service could do gardening

Noe Vasquez
honest and reasonable gardener
609 727 7914

.Jasiel
Clara's Landscaping
mobile
1(732) 527-5321

Erasto：(609) 357-8772 他们夏天做 landscaping 冬天做cleaning, painting 啥的。@路人乙 				
Carlos	9085101081			
割草服务比较好，价格实惠	

请问大家有靠谱的、价格合理的landscaper 推荐吗？可以剪草、修建、除杂草、维护草坪、帮种花啥的。谢谢。
我家一直用的Carlos +1 (609) 649-4850@三妹 

LAWN & ORDER
Specializing in Lawn Maintenance Landscaping to Hardscaping to Tree Service
Galo 908-627-9698							
Lawn service	
Rainforest Landscaping company 很不错！我家一直用他割草908-581-2160

Green Giant
Landscaping LLc. Fully Insured,Free Estimates Call or Text-609.638.2484
Greengiantlandscapingnj@gmail.com
Commercial &Residential

Cousin lawn care		Chatham	973-701-9143			
平整院子（刨树根，填土加种草，gutter下水管道延伸）弄得比较仔细，但是更改的时候坐地起价，建议全部工程结束再付款	
							
用过并愿意推荐的supplier: hardscape and landscape service Mario (609) 577-0462

Tree Chief ，800-464-0171			除杂草，一年分5-8次，每次50元左右
周围朋友都觉的不错								

    `,
  },
  {
    id: 26,
    title: "空调/Heater",
    content: `
    *******大普林华人生活群信息: 空调/Heater ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

修和保养空调/AC
David Au(空调修理)
+1 (609) 635-9590
不谢，一般的空调服务都是要是会员才有24小时内的预约，否则基本至少三天之后。我之前联系过几个，都是说刚好三天后才有空，严重怀疑是行业规矩，让你买会员的。而且我约了一个90块钱的诊断服务，他们搞了一个多小时跟David 免费20分钟的结论是一样的
David Ou 609 635 9590 他修暖气和空调的，会说国语,是香港人。去年我找他加过氟。大概300刀请问各位家长朋友，有哪位医生接受NJ FamilyCare的well point 健康保险卡的吗？
去保险公司的网站找医生单。输入你的邮区号。这是找收这个保险医生的最快途径。不过最好还是要打电话给医生的办公室核实一下。
@短腿的兔纸 看到群里之前有人推荐的空调师傅，我没用过。（908) 787-7222，陈师傅

我刚换了热水器。PSEG推出的replacement program.可以上官网查看，挺合算的。

修空调的公司
ArcticAC.com
特别贵

空调的breaker没法接通
732-672-4527
懂空调和电

请问普林斯顿附近有清洗室内空调管道的公司吗？
OZON Air Duct Cleaning和ProClean NJ的团购，好像都还可以。我们用过ProClean。

我最近比较了半天，用了Fante，觉得他们的服务快而且便宜，跟他们签了一年的空调水暖的合同，昨天来的technician，立马解决了我们空调不制冷的问题。因为空调管道堵住了，长期堆积使得空调为了保护自己跳闸了，所以看空调在走就是不制冷。解决问题后，昨晚空调放的比平常温度高很多，结果好冷啊！我自己加了床被子才睡着🥶
他们一年的tuneupcontract是空调加水暖250左右，光是空调或者水暖一年不到150。如果空调坏了，上门诊断109，有contract的各种修理有好像15%的减价折扣
我比较喜欢的是他们给你好好解释问题，就像国内和国外看病大夫解释不解释一样。比较安心。

陈磊
908-787-7222
家里要换水暖的heater(radiant) 和boiler，请问大家用过陈磊师傅吗？感觉他的报价有点贵，不知评价如何？
@L 陈师傅去年冬天给我家换过二楼整个system 的管道，他的活做得挺好的，细致耐心，服务好，也乐于分享
 
Heater 用furnace 和heat pump 哪个好？
我们新空调用的变频heat pump，感觉蛮温和，挺舒服的。

家里的热水器不供热水了，请问邻居有师傅推荐一下吗？
你问一下Shawn 吧，年轻人， 还挺靠谱的
我在以前的邻居群里找到他的， 另一个靠谱的邻居推他， 给他换了热水器， 还干其他活
他给了我们contractor’s price for the water heater, therefore all material added together is $796. 安装及tow-away the old unit, $850
推荐一个装修师傅，很尽责，价格合理，处理疑难杂症。
他的价格是其他师傅的百分之63%
这个Shawn自己是哥大毕业的
他们很负责，走时卫生也打扫得很干净，帮我买东西都有收据实报实销
253 880-9349
wechat liuxiao-shawn
Shawn will prepare the paperwork for the heater, so I could drop in the township for approval.镇政府来检查

我有买PSEG的保险，他们也负责换新的water heat ，也是$1500左右，包括申请文件、检测等

请教大神们：換water heater 一定要装flood stop and pan吗？謝謝🙏
Home Depot 和五金行 都有賣，最好裝，因為 water heater 壽命 10-20年， 壞的時候會漏水，總是會造成不方便。
pan, 一定要金屬的，不能用塑料的。
一漏水時，會自動停止供水、燒水，發出警報聲。
@joy4fun 非常感謝🙏提供信息。我是准备请人來換water heater 他说要裝這個，350元，以前都沒有。現在了解了，那就准备裝，再次感謝
如果是自家用的，我會建議買10年warranty的，因為6年一轉眼過去。別忘了要申請township permit (必須有plumber Licence 的人做）
@Gloria P ，是請plumber Licence來做，他一直強調要裝這個，原來二十来年都沒有，他幫忙申請permit，哦，我要问他買几年warranty 謝謝🙏

打算换AC 和Heater 了，哪家公司可以推荐？先谢谢啦
@Jun 建议用Costco，从它的service网站约，价格确实不错，Costco还给10%还是15% back
不一定需要ac 和heater一起换 缝缝补补又三年。但一起换价格确实不错
@Jun PSEG 好像常年有补贴项目，可以比较一下。
@闲不住的双手 PSEG说不换我家的
说labor 太多

华人jack师傅维修的不错，不妨也询问下价格
+1 (732) 543-5799 Jack
JACK DONG HVAC LLC
732 543 5799
jackdonghvacllc@gmail.com	
@RoRo  Jack Dong ⬆️非常好的师傅

买新空调，推荐Costco (Lennox)		四年多没任何问题。

我用了The Asteroid Companies（AEMS/ ServicePlus/ StandBy Power）。是我儿子学校同学的爸爸开的公司。当时是为了支持他的生意签了3年合同。但基本上只是做一年2次的HVAC maintenance. 

最近换空调，用了和Costco有contract的Fante’s. 觉得还不错。他们也做plumbing. 你可以试试。
Fante是我问过的最responsive的修空调公司，有专门一位师傅修mini split.其他群里提到的所有空调师傅都不接修mini split的活
Fante 6098351512 周末也会接电话
I called Fante and they will send a mini split technician. They charge a 109 dollar fee for each visit.

空调普林斯顿
7326724527

蒋蒋AC
mobile
(732) 664-6822
mobile
(732) 993-8826

空调
@Xin  (908) 787-7222，陈师傅

Andrei Contractor Ac Furnance
phone
(732) 309-1759
师傅说的七八千就是换冷气+暖气的价格。
我们当时师傅说了townhouse 3000多，7，8千是house 的价格
联系好了，然后不回音，怎么联系都不再回答。太不负责任了。

前几天看到群友问热水炉的问题，我家的炉子突然水不烫了，只是温，没有看到有漏水、不知道问题出在哪里，有推荐的维修师傅吗？或者是需要换掉？谢谢大家
Theo Ex Plumbing and Heating LLC2
Phone# 609 838 1843​theoexpiumbing@gmail.com​
Permit fee​76.00​76.00​
Total​$1,226.00​
Theo Plumber
609 851 2401
@Fran 我找的是 theo，一个意大利老外，响应比较快。我前几天换了锅炉，3700刀，我查了下锅炉的料本价在1500元左右。自己装的话估计拿不到permission
活干得还可以，这几天我还得找Theo给装个循环泵。

專業冷暖維修·安装
冷暖器/餐馆冰箱/更换热水炉/电工维修
費城老趙:
2673569608

请教大神们：換water heater 一定要装flood stop and pan吗？謝謝🙏
Home Depot 和五金行 都有賣，最好裝，因為 water heater 壽命 10-20年， 壞的時候會漏水，總是會造成不方便。
pan, 一定要金屬的，不能用塑料的。
一漏水時，會自動停止供水、燒水，發出警報聲。
@joy4fun 非常感謝🙏提供信息。我是准备请人來換water heater 他说要裝這個，350元，以前都沒有。現在了解了，那就准备裝，再次感謝
如果是自家用的，我會建議買10年warranty的，因為6年一轉眼過去。別忘了要申請township permit (必須有plumber Licence 的人做）
@Gloria P ，是請plumber Licence來做，他一直強調要裝這個，原來二十来年都沒有，他幫忙申請permit，哦，我要问他買几年warranty 謝謝🙏
 
前几天看到群友问热水炉的问题，我家的炉子突然水不烫了，只是温，没有看到有漏水、不知道问题出在哪里，有推荐的维修师傅吗？或者是需要换掉？谢谢大家
@Fran 我找的是 theo，一个意大利老外，响应比较快。我前几天换了锅炉，3700刀，我查了下锅炉的料本价在1500元左右。自己装的话估计拿不到permission
活干得还可以，这几天我还得找Theo给装个循环泵。

N. C. Jefferson
609 924 3624
(plumbing, heating, air con)
 
陈磊
908-787-7222
家里要换水暖的heater(radiant) 和boiler，请问大家用过陈磊师傅吗？感觉他的报价有点贵，不知评价如何？
@L 陈师傅去年冬天给我家换过二楼整个system 的管道，他的活做得挺好的，细致耐心，服务好，也乐于分享
家里mini split空调坏了，跟陈师傅询价，要价1600美元，比空调本身价格还贵。

请教各位， townhouse换冷气大概的价格应该多少？ 我根据大家推荐请了两个师傅来估价， 一个4600， 一个7500，哪个靠谱啊？多谢各位有经验大神

@RoRo 一个Jack Dong董师傅， 一个David Au， 都是群里推荐的

jack dong我用过 买的costco L那个牌子的 好像也就是差不多价格 

@RoRo 好的， 谢谢， 他给我报的4600， 另外我家空调2012 年装的， 不制冷他说是因为氟利昂都漏光了，修不好，建议换，是这样的吗？

那你让david修吧。他前几天帮我加了氟利昂 也说漏了。花了 400 
David报价换AC7500。David报价包括暖气空调一起换。
@RoRo 嗯，谢谢你， David的牌子是carrier， Payne。比较好的。
比jack那个牌子好吗 他的好像是和costco的Lenox

大家早上好！请问有暖气管道检查的公司推荐吗？
AJ perry 
@Xin Tao @Mr.Zhao 建议不要用AJ Perry. 不得不用时，也要多请2家公司竞标
是的，多问几家询价，差异特别大

sign up PSEG worry free program. 15 天后，让他们过来检查，检查和维修费用全cover
@樱花时节 最好加入PSEG Worry free Program, 一个月三件电器十几元，打电话他们随时来收，临时叫外面人修，出来一次没毛病至少二百。

有人认识能出水暖炉检测报告的师傅吗？买房子，Township 要个检测报告。谢谢
Then prior to the township inspection (not necessarily prior but ideal) you will need to schedule two more inspections (furnace and level II chimney inspection). We recommend the following vendors :
AAA American Air Duct (Denis)
Office: 609-703-7100; Cell: 973-359-5215
absolutecleanair@yahoo.com
Furnace Inspection - Princeton Air (Also has to be licensed in NJ and have Plainsboro Township checklist. Please check with Kim)
Phone: 609-454-6323  |  Fax: 609-799-7036  |  Email: info@princetonair.com

请问谁能提供一个公司的电话，需要做inspection,  并提供a valid service report for the Furnace.  多谢！ The Masters Plumbing,Heating & Air Conditioning 
David Nadrich 
732-277-9366
有執照的 （可填表申請 permit)， 服務也不錯.

油改气
Valley Oil Company
Heating oil supplier in Hopewell, New Jersey
Address: 54 Somerset St, Hopewell, NJ 08525
Phone: (609) 466-0015

Xfinity便宜一些.对网速要求高就选Verizon

    `,
  },
  {
    id: 27,
    title: "牙医/牙髓科医生",
    content: `
    *******大普林华人生活群信息: 牙医/牙髓科医生 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

牙医
Andrew Chung,DMD·
Pediatric Dentistry 
Dr. Andy Chung, who has been in practice for 22 years, is passionate about preven- tive dentistry. The father of two is dual trained as a pediatric dentist and dental anesthesiologist. Dr.Chung offers cutting-edge treat- ments such as laser technol- ogy for cavity detection and
fillings, cosmetic services like 
863 State Road(Route 206) all-white bonded fillings and Princeton,NJ08540
orthodontics.   
609-924-0404    
ppdandychung@gmail.com
推荐一个儿科牙医给你。希望以后有朋友需要。今天儿子刚看过。跟他十几年了。非常好

Sabinsky Orthodontics
609-252-0233
908-369-8900

儿童和大人牙医
Eastern Dental of Lawrenceville
609 587 6300
还好！大人孩子都在这儿看牙，没有过不好体验。

@Reb 我女儿对牙齿治疗极度恐惧 试过了两个成人医生都不行 被推荐了Montgomery pediatrics dentist 效果出奇的好 全程吸这笑气看着动画片就拔了牙 完全没有挣扎 Montgomery Pediatric Dentistry
211 Commons Way, Princeton, NJ 08540
(609) 297-1716 https://g.co/kgs/Xgjd8h

Joyce Guojun Ma, DDS PhD MAGD MICOI
Prime Dental Care
77 Tamarack Circle Montgomery NJ 08558
www.PrimeDentalSmiles.com
Phone: 609-688-8818
@荷 不客气。这个大夫是各科全能
推荐牙齿全科马大夫，技术没得说。

Precision Digital Dentistry
674 US HWY 202/206 Bridgewater NJ 08807
Building 4 Suite 7
www.PrecisionDigitalDentistry.com
大家注意，看牙千万不要到Precision Digital Dentistry这家，我拔了一颗牙已花了三千刀，还在发账单！

Princeton Dentistry 
Suite C-16, 601 Ewing St, Princeton, NJ 08540
Dr. Hanian醫術非常好
（我補牙、牙冠是不打麻醉的，所以一定要找技術超好的牙醫）
診所合作的orthodontist - Dr. Kim 也技術很好。
（他幫我做拔牙和植牙）
（他們不會中文，但目前英文溝通從沒遇過問題）

orthodontist 幫我拔牙的錢是另外算，我記得三四百的樣子。

Sun Rising Dental
61 Princeton HightstownRd#4bWestWindsor TownshipNJ08550
Makeanappointment·sunrisingdentalcom
(609)799-2580
@🦌Xiaohui🦌 Sun Rising Dental是孙医生开的说中文，不过我不确定收不收Medicaid和Medicare。可以打电话问问
@Xiaohui Sun Rising Dental是孙医生开的说中文，不过我不确定收不收Medicaid和Medicare。可以打电话问问
@Haixia Li 我爸妈在Sun rising dental 孙医生那里自费拔过牙，还做过deep clean. 还不错，价钱和我之前在曼岛china town comparable.

@SYJ 牙医推荐Edison的黄若君  ，虽然有点远，但是诊所里的每一个人都很好 
+1732-819-0505

Precision Dental Group PC
491 Amwell Rd #204,
Hillsborough Township,NJ08844,United States
Closed· Opens 10am Mon
Dr.Chu會講Mandarin, Dr.Wong會講Cantonese.  這間牙醫診所容易約到理想的較近期的時間。
如果沒有牙科保險，這家診所提供了一個一年期的類似保險的優惠。

Guojun Ma, DDS, PhD您们谁在马医生看过牙，怎么样？
@Qihong（rose15） 我在马医生看牙，不错。推荐

不知普林附近有没有好的牙医推荐一下？主要是年度清理，希望找个干净卫生，环境好些的
我也是就年检和洗牙，在Princeton Premier Dental，（Whole Foods 那个mall)
是个韩国牙医

kathy liu dentist
Liu Kathy DDS
Dentist in Plumsted Township, New Jersey
625 County Rd 539,Cream Ridge,NJ
https://wwwbusinessyab.com> liu_….
Liu Kathy DDS, 625 County Rd 539, Cream Ridge, NJ 08514, USA
 located in Ocean Countyof New Jersey state. 
https://wwwdentalcaregenie.com>….

请问普林附近有推荐 拔智齿的诊所吗， 谢谢！
@星辰 前两周去了Princeton Oral & Maxillofacial Surgery ，感觉还可以

请问有没有拔智齿的医生推荐，先谢了
整个过程体验很好，儿子恢复得很快
Prestige Oral Surgery
ADDRESS
3700 Route 27,Suite103 Princeton,NJ08540 Click for DirectionsO
Tel:732-297-7000|Fax:732-297-3638


Princeton Shopping Center 有个牙科诊所，Dental care Princeton，大家有去过吗，感觉怎么样
感觉还可以
他們的服務態度和環境很好，但技術不怎麼樣
Joyce Guojun Ma, DDS PhD MAGD MICOI

Prime Dental Care
77 Tamarack Circle Montgomery NJ 08558
www.PrimeDentalSmiles.com
Phone: 609-688-8818

Precision Digital Dentistry
674 US HWY 202/206 Bridgewater NJ 08807
Building 4 Suite 7
www.PrecisionDigitalDentistry.com
我孩子四颗智齿都在这里拔的，Dr.Ma


分享个拔牙的：Peaceful Dental Care，在300 Princeton Hightstown Road，前台不说中文，里面有个徐医生，说中文，收低保，也可收现金（要问一下）； 推荐只需要拔牙/深度清洁..基本的，其他给referral. 有用过的说问了一圈，现金价格估计是附近最便宜的了.  
拔牙的现金价格 当时附近都是500+…这里是100以内

Pestigeoralsurgery.com   
Healthy Smiles are Confident Smiles
LC QUALITY DENTAL
LI CHEN, DMD, PHD
North Brunswick | Princeton
North Brunswick:  732-398-8800
Princeton:  609-688-8899

有好的periodontist（牙周病医生）推荐吗？中国人外国人都可以，谢谢
陈医生很好
609-688-8899

@peng @Lily Chen_普林斯顿 今年夏天用过。推荐
看牙周病
Center for Contemporary Periodontics and Dental Implants
Dentist in Lawrence Township, New Jersey
34 Franklin Corner Rd，  Lawrenceville   hool    
Lawrenceville,NJ 08648  206     
295
(609) 883-6900

群主你好 我想增加一点牙医推荐和反馈：我推荐大家避雷Lawrence dental implant&periodontics的Dr John Lu，非常rude 说我的牙需要拔掉植牙并植骨。我就去找了Dr Stephen Hudis，他非常专业，他说完全没有问题，注意清洁可以继续用
两个医生的判断皆然不同 但是Dr Lu的bedside manner很差 让我很不舒服
@Lily 我们跟Dr. John Lu 好几年时间，没觉得他有什么不好。可能个人体验不同。
我植牙的医生是John Lu, 已经十几年了，还不错，但是我看群里有人不推荐他，所以谨慎选择吧

请问有哪位邻居做过根管治疗（root canal），有好的orthodontics推荐？或者哪个医生做得不好需要避开的，谢谢！

我今年在孙医生处做的根管 挺不错的 

Endodontics/牙髓科医生
@妫 我用过Jean Kang Endodontics 很好 
THE OFFICE CENTER
666 PLAINSBORO RD.	J	
(609) 799-7427

Sun Rising Dental
61 Princeton Hightstown Road, 4B
West Windsor, NJ 08550
(609) 799-2580
sunrisingdental@gmail.com

Dr.Alexander Kim
Endodontics
(609)771-1200
2999 Princeton PikeSuite4 LawrencevilleNJ08648 United States

LC Quality Dental
Dentist·16 min Closed·Opens9AM Thu

@Lily Chen_普林斯顿 群主，我去年中才搬到普林斯頓來。今年一月一日（星期五）晚上開始牙痛，眼淚都出來了。接下來兩天是公眾假期和星期日，我在網上搜了牙醫的電話，一家一家地打去留言。星期一早上又繼續打，好多家都約多天以後。最後打了一個老牙醫的電話，接電話的先生說老牙醫兩年前過世了，他接手了這個診所。我說我的牙很痛，已經忍了兩天，要盡快看。他說他正在上班的路上，回到診所給我電話。很快他就再打來，叫我當天下午去。朱醫生很認真負責，他說他會因為掛心某些病人的情況，睡不着覺。即使他讓我轉诊別的醫生，他還會跟進，跟其他的醫生溝通。
PRECISION DENTAL GROUP
Dr. Edward Chu General Dentist
Education and Memberships:
B.A., New York University
D.D.S., NYU College of Dentistry
General Practice Residency,Jamaica Hospital Medical Center
Member of the Academy of General Dentistry
precisiondental-nj.com
Precision Dental Group
491 Amwell Rd#204
Hillsborough Township NJ08844

请问普林附近有可以自费的华人牙医推荐吗？ 谢谢！
@Haixia Li 我一家三口幫襯Hillsborough 的Dr.Edward Chu朱醫生。他的診所提供一個一年期的會員給沒有牙科保險的客戶。300美元一年，包兩次免費洗牙，免費照X-ray, 其他的收費照診所和保險公司的合同價收。@沈浅浅 以我一家三口多年在不同地方不同牙醫的經驗，我們是滿意的。從去年元旦我急症找到他開始，我們到現在都跟着他。他的態度也好，是個會講Mandarin的ABC，在新澤西出生長大。他過世的母親生前也是牙醫。他的太太是個專治牙周病的醫生，會講粵語，每個星期有一天在這個診所。

@Lily Chen_普林斯顿 朱华医生很好：(908) 236-7800，比较远，在：
1390 US Highway 22
Lebanon NJ 08833
http://hunterdonfamilydental.com/

如果是一般牙医的话，非常推荐 West Windsor Dr. Shapiro. 但他不种牙
6092695200? David Shapiro 
我认为他的技术人品都好
抱歉听说 dr. Shapiro 退休了
Endodontist 牙髓科医生 Edison 有個 Andrew Chen 醫生, 説華語的，只是離你們可能比較遠。
Dr.Andrew Chen
Located in: Bridge Point
+1732-452-0788
@青 Edison ⬆️Winston Chen Andrew Chen 陈医生，跟护士讲是很痛，她们会帮你安排的

    `,
  },
  {
    id: 28,
    title: "家庭医生和儿科家庭医生",
    content: `
    *******大普林华人生活群信息: 家庭医生和儿科家庭医生 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

医生/Doctors

陈玉碧诊所
电话
1(732) 822-9293
工作
(609) 750-1650
408 Plainsboro Road 9 
PlainsboroNJ08536美国

(732) 985-0666
+1 (609) 751-5886  666 Plainsboro RD  BLDG100, suite 1 H
孩子家庭医生
华语儿医推荐 Shiwei Tong MD
我朋友家娃去那里
我家两个孩子都找Dr. Tong看病体检，人很负责细心
可以先电话咨询下保险和看诊时间(他有另一个办公室在Brooklyn，所以只有固定几天在普林) 
电话 (609)275-6810
诊所地址 666 Plainsboro Rd # 1005, Plainsboro Township, NJ 08536 
@Hp 你好!我家孩子在Doctor Tong那里看。他很nice，对我来说，特别好的一点是比较好约
儿科医生
Shiwei Tong, MD (Pediatrician), 说中文 609-275-6810, Plainsboro, NJ.

@陈 我个人喜欢the Pediatric Group, 在Witherspoon Street. Practice不大，三个医生和一个NP。Staff非常友好。8-9am 期间你有任何问题都可以直接跟当值医生通话（不是服务生take message, 是医生直接接电话）。医生中我喜欢Dr. Tesoro and Dr. Zollner.

Nair Swapna或者
Maom Medical Associates
732 821 0873
732 452 9700
他们有Edison和Kendall Park两个点。前台服务一般，医生不错，好处是总是接受新病人

Dr Siegel Robles
609 303 4600
非常好的家庭医生，老太太，很有经验


Zhuping Chang,MD
内科
4.9     379 Google reviews      
Internist in Plainsboro, New Jersey
Address: 3 Market Street #422,Plainsboro Township NJ08536
zchangmd.com
Phone:(609)275-5000


请推荐家庭医生。谢谢
這是Dr.Patrick Wong的電話。
732-7956130
】 a family medicine specialist in Edison
University Hospital Robert Wood Johnson|RWlBarnabas
Accepting New Patients  (732) 475-0533  
Telehealth Available 
healthgrades.com

@huangxiaoguang @L 這是我的家庭醫生，在Edison，是個會講粵語的ABC。他在大機構RWJ工作。這是我和先生去看的醫生，我倆覺得不錯。我們覺得Edison不是太遠，看完醫生還可以去大華99和Hmart買菜，所以沒有在普林斯頓找醫生。女兒就在普大看校醫。

@小飞侠 我們家孩子一直看的是Plainsboro的陳小梅醫生，十多年了，覺得她很仔細很親切 6097164800
想补充一下，如果是中青年，不太推荐plainsboro的陈晓梅，这里全部都是老人，每次约过来我就要等差不多30分钟以上。她本人也比较保守lay back 不太适合中青年群体。觉得感觉不是很好。然后。。他们有老年人优先的policy我约了8：45，结果两对四个老年人约都在我后面都进去了我等了半个小时。中青年人的时间貌似不是时间

@Shirley Zhong 我的家庭医生去年退休了，找了好久定了east Windsor 的 Irene kotok. 诊所本身一般， 医生的医术如何我其实也不确定，但她确实很caring. 这一点很突出。在我看来作为家庭医生这很重要

推荐Dr. Shao ZHENG, 666 Plainsboro Rd BLDG 100, Suite 1H, Plainsboro Township, NJ 08536 Tell: 609-751-5226. 郑医生在17 年前给我家孩子在她Edison的诊所看过病。
@王小曦 儿科推荐郑劭，讲中文的女医生，在爱迪生和普林开业二十多年经验很丰富了，口碑也非常好。但不确定是否看无保险的病人，可以打电话问下。Dr. Shao ZHENG, 666 Plainsboro Rd BLDG 100, Suite 1H, Plainsboro Township, NJ 08536 Tell: 609-751-5226. 
我用过shaozheng 还不错

Zhuping Chang,MD
Internist in Plainsboro, New Jersey Open
3 Market Street #422
Plainsboro Township,NJ 08536
PLAINSBORO
https;//www.zchangmd.com

问各位爸爸妈妈有哪位朋友知道新泽西周边可以给申请移民的人做体检的地方和机构？谢谢🙏
我去年在爱迪生做了移民体检 
医生以前是北京301医院的 收费不高 
张医生
Dr Hao Zhang
Immigration Health Exam
(732) 662-1100
2 Ethel Rd      9       
Edison NJ 08817 United States
我们之前在这做的 华人医生 人很不错 Edison 开车40来分钟
请问一下，考公民的时候可以家属陪同吗？
可以

 华人医生和诊所前台工作人员和护士都会讲英语。 Edison 附近的Oak Tree 街是全美最大的印度town，也应该有印度人医生诊所。不知道普村附近的美国人家庭医生收费情况，能否约到今天看病。
好像去附近或者Edison 的华人家庭医生那里是$70 左右看一次诊。找份中文报纸，多打电话去几家医生诊所，看今天能不能约上时间看。

    `,
  },
  {
    id: 29,
    title: "电器修理",
    content: `
    **********大普林华人生活群信息: 电器修理 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

修理/ Appliance Repair and Maintenance	

我们11月份刚用过这家修排风扇和冰箱，不便宜，服务还不错，如果需要换零件的话，可能要等，他们也会再来
Jersey Appliance Inc.:
Appliance repair service in Hightstown, New Jersey • Open Overview
139 Mercer St, Hightstown,
(609) 918-1830
https://jerseyappliance.net

请教大家，MacBook碎屏了，除了Quakerbridge Mall的苹果店，有没有又快又好的地方可以换屏呀？多谢🙏
CPR Cell Phone
Electronics repair shop in
1225 US-206,Princeton   ； Princeton North Shopping Center
(609)454-2024
CPR Cell Phone Repain
https://wwwcellphonerepaircom

Quakerbridge Mall 有几家，要砍价。最便宜的是290美元。

陈先生
修冰箱
phone
+1(732) 875-9383

David 应该修冰箱
6096359590

修冰箱
APL Appliance Repair
Phone:(848) 757-8626 www.aplrepairnj.com
APL Appliance Repair New Jersey
Call +1 (832) 920-3791

如果你的动手能力还可以的话，查到洗碗机的厂商和型号。去YouTube查看这个洗碗机的常见故障和维修方法。如果觉得你自己可以修，就去Amazon买零件。
@Donglin Liu Mile Font：(732) 934-0443
我家小洗碗机是他修的

请教谁能推荐装抽油烟机的师傅吗
合师傅油烟机
phone
(347)276-6826
@Junsheng Cao 这个师傅连带卖樱花油烟机 价格很公道
是在曼哈顿法拉盛的。

有没有安装抽油烟机的师傅推荐
@Song 可以问问Kevin 6093062600 有空没，我家的就是他装的

大家有哪个装抽油烟机师傅的推荐？谢谢🙏
@CWY  直接找EDISON方太
现在开在美东里
咱们这的美东

我推荐一下Michael Fout，手机（732）934-0443，专门维修电器如冰箱、空调、灶台点火系统等，人很和蔼专业，我家找他修过冰箱内落水、灶台点不着火。

@all 请问大家有修冰箱的师傅推荐吗？🙏
Michael Fout (732) 934-0443, 他专维修电器，我家冰箱和灶台点火器都是他修的。

也可以试试Lowes。以前我家一个gas range外面师傅搞不了。Ｌｏｗs
Lowes师傅比较齐、可以搞
上门给我修冰箱内漏水和灶台点火线，他一共收240-260（忘记具体金额）。也不知是贵还是便宜了

补充一个修家电的：sears有全线家电修理技术人员。感觉比私人的靠谱些。检查费用啥不多。修理费会不会贵很多就不知道了 
https://www.searshomeservices.com/repair/refrigerator-repair-service

修割草机
Precision Mower Repair,LLC
small engine repairs of all makes and models
John Mastellone. owner/operator
609 213-3622
206 Princeton Hightstown Road
West Windsor, NJ 08550

请问有修发电机的师傅推荐吗？
 @人在他乡 我家上次Honda发电机坏了是拿去这家修的。打电话去问问，把你家发电机的品牌和故障情况告知他们，看他们是否修理，我不知道他家是否有上门服务。family run business,态度挺好的，价格也合理。 
LAKE
SMALL ENGINE REPAIR LLC281 A Cedar Grove Lane
Somerset, NJ 08873 Phone: 732-873-9047 fax:732-873-3395
www.lakesmallengine.com 

修理电脑，iPhone
PS Electronics
Apple Device Specialist 
10% Discount for Veterans and Students with valid ID
No Diagnostic Fees for most repairs
HESTRA Logic Board Repairs $ Track Pads $ Batteries Charge Ports Liquid Damage Apple MacBook Repair； Double Typing-Broken/Wom Kex-Whole Keyboard Replacement       
-Broken Screens-No Backlight/No Camera Flexgate Repairs; Data Recovery
1(888)820-3476  www.PSE-NJ.com  Help@pse-n

TECHNICIAN
Technician XInc.	TEONWX	
5.0 ★★★★★(22)
Computer consultant in Montgomery Township New Jersey·Closed
1378US-206,SkillmanNJ08558
(609)681-1120

ACE	Jack Murphy	6093922717 or cell: 609 658 5600	
修理Appliance refrigeration, sales, service installation
忘记价钱了好像不贵，几年前修过洗衣机衣服甩不干的问题，之后洗衣机都很好用。	

93 Route 31 North Pennington, NJ 08534
609 737 0999						

Dryer	
我给你个修的，洋鬼子你试试看6097516097

修车曾师傅	7323225582		
非常便宜	
曾师傅有自己的修车铺。他比dealership实在便宜太多了。

大家好！想找一个懂行修理落地大钟师傅，如有这方面的师傅麻烦推荐一下．谢谢
这个老太太，家传的，前年帮我修得很好
修钟老太
电话
(908) 421-3741

@毛毛 Trenton Farmer Market （其实在Lawrence Township)里有个钟表店。老板/师傅说广东话。

您身边的折扣电器专家，覆盖New York & New Jersey !
专卖LG三星电器，全部单品五折起，我们提供送货&安装&调试等一条龙服务。
有全新未开箱&开箱商品，开箱部分商品会有一些凹痕和划痕但不影响正常使用，件件都有质保~多买多优惠~
产品种类:冰箱、洗衣机、烘干机、炉头、炉台、烤箱、洗碗机、微波炉、电视机、抽油烟机等。
New York: 909-699-2899
153 19th street, Brooklyn, NY11232，周一至周六(9:30AM-6:30PM)
New Jersey:609-917-00192208 Hamilton Blvd, South Plainfield, NJ07080，周一至周六(9:30AM-6:30PM)
@optimist_too 之前你推荐过一个卖洗碗机的地方，电话已经没人接听了，在South Plainfield，Appliance 4 Less。他们搬家了吗？@雁红 Daisy 他们老板说打这个电话6262620698。

@RoRo 以前换HVAC都是那个公司（Home Depot or PSE&G)去镇政府申请permit。他们会把镇政府的费用加在你的帐上，但不会另加人工费。
你好！ 若買了 PSE&G 的 Worry free program 給老舊的 HVAC， 是否換新的時，他們會馬上到底服務嗎？又可否挑品牌？ 自己要付安裝費、主機費嗎？
> ﻿Worry free program 只包你现有HVAC的零件和保养人工。当你的HVAC已经老得无法修（或者无零件可卖），他们就推荐你买一个新的系统。你自己要付全部的钱。PSE&E会提供他们卖的HVAC资料和价钱。你也可以去Home Depot, Lowe’s, Princeton Air和其它地方比牌子，质量，和价钱。
Worry free program 只包你现有HVAC的零件和保养人工。当你的HVAC已经老得无法修（或者无零件可卖），他们就推荐你买一个新的系统。你自己要付全部的钱。PSE&E会提供他们卖的HVAC资料和价钱。你也可以去Home Depot, Lowe’s, Princeton Air和其它地方比牌子，质量，和价钱。
在其它地方买的系统也还是可以再买PSE&G 的Worry Free program. 在PSE&G买的系统，他们有时会让你分期付款。
无利息。HD有时也有这样的促销活动。
去年我的冷氣不夠冷。PSE&G來看了，說系統沒有漏洞，但是弗利昂很低。加上弗利昂。Worry Free就包他的人工費，我還要付弗利昂。
这样看下来PSEG。worry free 很好嘛！现在有执照的人工很贵。

福利昂花了多少 想横向比较下 
我们当时加人工好像四五百

    `,
  },
  {
    id: 30,
    title: "孩子小提琴吉他Flute二胡",
    content: `
    *******大普林华人生活群信息: 孩子小提琴吉他Flute二胡 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
如果学古典吉他，Westminster conservatory 有老师教。如果学Jazz style,  Mercer Mall 的 Music and Art 有老师教

古典吉他Alice Artzt
ALICE ARTZT classical guitarist
609      921-6629        GuITarTzT@aol.com

黑管老师
KennethEllison
kennethjellison@gmail.com

Tom Tallitsch
+1 (609) 635-1550
我儿子以前的黑管老师
可以Google到他的个人信息，很不错。黑管双簧管钢琴都可以教。

Flute老师
Westminister的Barbara Williams

David White the music director at Cranberry is an excellent sax teacher
Come to your house at Princeton

请问群里有乐理老师嘛？我家大女儿明年考学.需要系统的学习下乐理.有认识和熟悉的老师麻烦请大家推荐啊
Dr.季聪
WeChat lD:jicong_1028

乐理知识
phs对面的westmisnter conservatory就有music theory课，各种等级的

@🐱喵了个咪（Martin‘26） 我家孩子跟着这个老师学过二胡 
魏建国
work
(732) 991-2135
home
(732) 249-6331

@普林斯顿陈老师-文书辅导 @JS 这是一个很好的大提琴老师，推荐
Palombit Kristin
+1 (609) 571-7404
monkcello@comcast.net 

Dr. D, 波兰人，家住Lawrenceville，我家老大跟他学琴1年多了，孩子喜欢。
Tomasz "Janina" Rzeczycki
Tel. 609 439 3866
Rzemasz802@gmail.com

韩国女老师Hyojin Lee 的简历这里可以看到。在线填写信息，和她联系
cellohyojinlee.com

新泽西有于荣海教大提琴，他也在乡音合唱团的管弦乐队里拉琴。不知道联系方式，需要你自己查

叫李吉辰，不然你查一下？对孩子非常有耐心、从小是中国音乐学院附小附中上来的，抖音，小红书他也直播，可以先看看
+1 (908) 420-2851我负责任滴说，相当好 我孩子拉大提琴，现在在Juilliard学琴，之前一直跟着李老师学，现在也会跟着李老师练琴，真是超级推荐

如果孩子学管弦乐器但水平没有高到参加比较高级的乐队，乡音的管弦乐队还是不错的选择。我他们每年至少举办一次音乐会。
我儿子吹小号，请学校乐队的老师教过。因为我们不是特别推孩子，不太清楚教的怎么样，只想维持他一直会吹就行。他是乡音乐队的第一任队员，参加过他们开始几年所有音乐会，接触过不少中外名曲。
但是这个乐队只在要演出之前才排练若干月，平时好象没有定期练习
我看他们网站上就是团长樊大平的电话； 樊大平 (908) 217-2480

小提琴老师Noah Baum
609-558-3262
Baum.noah@gmail.com
非常耐心的好老师

@喜多妈 ，new school for mysic study, 是一間位於kingston的音樂學校。westminster conservatory 有教小提琴，看你需要suzuki Violin或是只要私課

请问有教唱歌的老师推荐吗？
Voiccessons
609-721-1249 Ildiko71@Ymail.com
Rozsildiko@gmail.com    Hopewell, NJ
这个唱歌老师是匈牙利国家歌剧院的女高音，住在Princeton YMCA 附近，水平非常高

School of Rock 
1761 Princeton Ave. Lawrence Township, NJ 08648. Directions · (609) 981-6095.

瑞百音乐学校
这里汇集了世界顶尖音乐名校（朱莉亚音乐学院、曼哈顿音乐学院、伯克利音乐学院）等的优秀教师及优秀学生（朱莉亚预科、曼哈顿预科的学生）。如果您的孩子想在钢琴、小提琴、唱歌、乐理、作曲等方面的学习不走弯路，得到专业正规的系统训练，那么来这里，一定是您不错的选择！
瑞百音乐学校老师介绍：https://rbmmusic.com/faculty/
瑞百音乐学校学生演奏视频：https://rbmmusic.com/media/

Yuki Music Studio音乐剧课
不够专业，老师不太会和学生互动。不推荐。也提醒小心提前交钱，试课以后试的课不仅要交钱，提前交的钱差点都要失去

专业的小提琴老师有推荐的么？
我家老大之前找过这个老师教的很好很认真负责在普林斯顿
姓金   微信：ivyj00

小提琴/中提琴老师: 杨依诺Jing Yang（百度和Wikipedia都可查到介绍）
WeChat: jean_viola
Studio Vio 地址: Hoover Ave, 08540
Phone: 609-780-1887
年龄: 4 years old - no limit 
课费: 120$/1hr, 180$/1.5hr
类型: 一对一，考学比赛，初学热爱
曾担任德国法兰克福广播交响乐团副首席，演出遍及50几个国家，教学20年，很多学生考入全球顶级音乐学院，严谨负责随和
前期的基本功真的教的很清楚，从手指头、手臂到下巴到肩膀每一个细节都一一去讲解。孩子出奇的喜欢。喜欢小提琴，更喜欢老师。
我儿子10岁跟着杨老师上了几次小提琴课，我儿子特别喜欢去上杨老师的课。杨老师非常非常的专业，认真备课，也很懂小孩的心理。就上了几次课感觉我儿子的音准，音调明显进步很多，还改掉了几个长期积累成的坏习惯。
杨老师是一位非常有爱心、专业，充满耐心的老师。她丰富专业的教学方式和水平引导孩子不走弯路，专业正确的方法教授课程，孩子容易领会。


Flute Piano and Guitar Lessons Experienced Instructor M.A.All levels/ages Bi-annual recitals Princeton area studio
609-936-9811
www.princetonmusic.com;Online or in-person

    `,
  },
  {
    id: 31,
    title: "会计",
    content: `
    *******大普林华人生活群信息: 会计***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

会计师

请问有报税的会计师推荐吗
@peng 你好，这是报税的林会计，很负责．
@Lina 6097217723 谢谢


请问－下有没有推荐在大普林地区的会计师。照章办事，比较严格符合州的规矩。不是顾客想什么，会计就想办法听从的那种。老美会计师也可以。非常感谢！ 
joy turchetta-They can email me at mjclim@gmail.com.   
陶乐
info@taocpas.com
价格虽然不低，但是服务很好

P&KCPAS LLC
Consultant in Parsippany-Troy Hills New Jersey
Located in: Plaza 322
Address:322US-46Parsippany-TroyHillsNJ07054
Hours: Open now·Add full hours
Phone:(973)882-8810

Judy Wu
泛宇公司
微信号：judywu178

@Polytec 有个华人会计师叫Amy的，自己开业，还不错，amywangcpanj@gmail.com 你可以发个邮件问问

美国林会计师 Joseph Lin, CPA
昵称：Joseph Lin, CPA
微信号：lilu-16888
(732) 762-0288
这个会计我用了快四年了，人做事非常的认真，而且很热心


请问大家有没有比较靠谱的帮助公司注册，报税的会计师推荐？
@Donglin Liu 我們用何德發會計師事務所三十年了，非常可靠。
James Ho
1(732) 424-0044
1(732) 424-1976
jameshocpa@aol.com
288 Route 22 West       22      
Greenbrook NJ 08852
+1(732)424-1976 phone
+17324240044x2 mobile
+1(732) 910-3789 work
+1(732) 424-0044
carol.ho@hogioia.com work
Ihecnanvaheecom
當然啊，三十年前幫我註冊的公司，近十五，二十年他的女兒成為會計師，加上女婿；一直用他們幫我處理稅務
非常可靠。他去世了，但是女儿女婿还在做

    `,
  },
  {
    id: 32,
    title: "孩子综合夏令营精华",
    content: `
    *******大普林华人生活群信息: 孩子综合夏令营精华***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15


我家孩子很喜欢这个夏令营，他说午饭也很新鲜
Camp Mason 
campmason.org
这是我家孩子去过的夏令营，还不错。推荐给大家。
综合的

The Bridge Academy
1958-B Lawrenceville Road
Lawrenceville 609.844.0770 www.banj.org
Age: 7 — 14 years old

Camp Cherry Valley
5 Country Club Drive Skillman
877.671.2267
www.kecamps.com/camps/cherry-valley
Age: 4 – 10

Childtime，  Flemington 和Hillsborough
www.childtime.com/your-local-school/flemington-nj-1512/
Age: 6 weeks to 10 years

Clown Academy
Princeton Academy of the Sacred Heart
101 Drake’s Corner Road
609.924.8143
www.princetonacademy.org
Age: 9 — 16 years old

The Dance Connection
Nursery Dance, Broadway, Ballet, Jazz, Tap, Hip Hop
1 Jill Court Building 16 Suite 12 & 14 H Hillsborough
908.874.8800
www.danceconnectionnj.com
Age: 3 years and older

Eagle’s Landing Day Camp
74 Davidson Mill Road
North Brunswick  732.821.9155
www.EaglesLandingDayCamp.com
Age: 3 and up

ESF Summer Camps
Route 206 Lawrenceville 609.896.0606
www.esfcamps.com/
Age: 4 — 15 years old

Farrington’s Music； Piano, Guitar
1325 Route 206
Skillman, New Jersey 08558
609.924.8282
www.farringtonsmusic.com
Age: 6 years older

French American School of Princeton
The French American School of Princeton is an independent, coeducational day school offering a bilingual education to children in Preschool (3 years old) through Grade 8.
75 Mapleton Road Princeton 609.430.3001

The Harmony School at Foxmoor
Robbinsville 609.443.7575 www.harmonyschools.com
Age: 3 — 9 years old

Highland Studios Summer Art Workshops for Kids & Teens
Hopewell, 609.466.347
Age: 9 — 16 years old

Hopewell Valley Children’s Theatre
Pennington 609.649.3042 www.hvct.org

The Hun School of Princeton
609.921.7600 x2265
www.hunschool.org
Age: Grades 6 – 12

JCC Abrams Day Camp and Teen Travel Camp
148 Cedarville Road East Windsor 609.606.7070
www.jccabramscamps.org
Age: 3 years old — 10th grade

Kids Klub Camp
Princeton Alliance Church
Scudders Mill Road
Plainsboro 609.799.9000
www.princetonalliance.or
Age: K — 8th grade

Kids’MusicRound
Pennington, New Jersey 08534
609.333.0100
www.kidsmusicround.co
Age: Infant — 7 years old

LakeView Day Camp
505 Riva Avenue
East Brunswick, New Jersey 08816
732.821.8933
www.lakeviewdaycamp.com
Age: 3 — 14 years old

The Lawrenceville School
609.896.0400
www.lawrenceville.org
Age: Grades 9th – postgraduate

Lawrenceville Summer Scholars
The Lawrenceville 609.512.2720
summerscholars.lawrenceville.org

Learnroll Immerse
Experiential Learning and Tutoring using immersive 3D & Virtual Reality
1000 Herrontown Road 2nd Floor 609.921.0800 www.learnrollimmerse.com
Age: 13 and up

The Little Gym of West Windsor.jpeg
609.799.7776 www.thelittlegym.com Age: 3 — 10 years old

Magic Arts Camp
Glass Art; Cooking; Drama; Ceramics; Photography; Clowning; Crafts
7 Vandeventer Avenue
215.932.8452
Age: Ages 5 and up

McCarter Theatre First Stage Summer Program
609.258.8289
www.mccarter.org
Age: 1st — 12th grade

Mercer County Community College
1200 Old Trenton Road
West Windsor, New Jersey 08550
609.570.3311
www.mccc.edu/campcollege

Montessori Corner at Princeton Meadows
Plainsboro 877.959.4185
www.montessoricorner.com
Age: 1-1/2 to 6 years

Music Mountain Theatre
1483 Route 179
Lambertville, New Jersey 08530
609.397.3337
www.musicmountaintheatre.org

Nassau Nursery
2 1/2 year olds through junior kindergarten；summer camps.
33 Mercer Street 609.924.0566 www.nassaunursery.org
Age: 2.5 – 4

Oak Crest Day Camp
92 Cortelyous Lane
Somerset, New Jersey 08873
732.297.2000
www.OakCrestDayCamp.com
Age: 3 years old and up

The Pennington School
609.737.1838
www.pennington.org
Age: Grades 6 – 12

Plainsboro Township Summer Recreation and Sport Camps
609.799.0909 x331,332
Age: 4 — 7 years old

Princeton Day School
609.924.6700
www.pds.org
Age:3 years old — 12th grade

Princeton Friends School
Princeton Friends School (pre-school to 8th grade)  hands-on, child-centered education 609.683.1194
www.princetonfriendsschool.org

Princeton Junior School
age 2 through Grade 5 creates globally-minded, empowered and joyful learners
609.924.8126
www.princetonjuniorschool.org
Age: 2 years to Grade 5

Princeton Montessori School
609.924.4594
www.PrincetonMontessori.org
Age: Infant — 8th grade

Rambling Pines Day Camp
609.466.1212
www.RamblingPines.com
Age: 3 years old — 10th grade.

scienceSeeds
29 Emmons Drive
Suite G10
Princeton, New Jersey 08542
609.759.1626
www.scienceSeeds.co
Age: Ages 5-16

Stuart Country Day School
609.921.2330
www.stuartschool.org
Age: 4 years old — 12th grade.

Summer Institute for the Gifted
Princeton University
866.303.4744
www.giftedstudy.com
Age: 7th — 11th grade

Terhune Orchards
Terhune Orchards has a barnyard of animals, fruit picking, wagon and pony rides.
609.924.2310
www.terhuneorchards.com

Waldorf Summer Camp
609.466.1970
www.princetonwaldorf.org
Age: 4.5 — 12 years old.

Watershed Nature Cam
31 Titus Mill Road
Pennington, New Jersey 08534
609.737.7592
www.thewatershed.org/education/summer-camp
Age: 3 – 16

Westminster Conservatory of Music
Summer Music Camp
609.921.7104
www.rider.edu
Age: 4 years old — 12th grade.

西温莎新加坡数学中心S.A.M Singapore Math of West Windsor，世界最大新加坡数学培训机构，提供面向4-14岁学生的新加坡数学和英语阅读写作课，注重概念理解和思维能力培养。网站：https://seriouslyaddictivemaths.com.sg/newjersey/
2024年新温莎新加坡数学中心3大暑期夏令营
STEAM, Lego and Mandarin camp offered by S.A.M. Singapore Math of West Windsor. 1st-6th grade. Small class size taught by professional teachers. https://shorturl.at/aotwA

    `,
  },
  {
    id: 33,
    title: "网球",
    content: `
    ******大普林华人生活群信息: 网球***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

网球夏令营

TimeAfterSchoolTimeAfterSchool TAS 2019-06-05 09:50
1. Princeton Tennis Academy
PrincetonTennis Academy的网球夏令营为孩子们提供学习和提高网球的兴乐趣。教练Jose Rodriguez是执教多年的职业网球教练; 获得USTA，PTR，USPTA国家认证; 他根据孩子们的水平和特点，提供高水平培训，深受家长孩子们喜爱。在这个暑期训练营，学生们可以学习网球这项终身运动的基本技能，提高耐力，注意力和比赛经验，并且真正爱上网球。
时间: 6/24-9/4全天或半天，至少一周。
地点： 900 Scudders Mill Rd, Plainsboro Township, NJ 08536
也接受预订私教课程或小组课程 
详情请看：
https://www.timeafterschool.com/index.php/Summercamp/programDetail/camp_id/322.html

2. Firefly Tennis
Firefly Tennis 丰富有趣的游戏，最大限度地提高学生对网球的兴趣和参与度。 欢迎所有技能水平的学生参加。提供所有设备，包括网球拍。
夏令营时间: 6/17-8/30全天或半天，至少一周。 
地点： 1200 Stuart Rd,Princeton, NJ 08540
详情请看：
https://www.timeafterschool.com/index.php/Summercamp/programDetail/camp_id/124.html

3. Advantage Tennis Club
Advantage TennisClub是West Windsor网球训练俱乐部。为从初学者到竞技网球的各个级别提供高质量的培训。我们的国际ATP排名教练团队通过了USTA/ PTA认证。我们提供以下团体和私人课程：
10 & under levels， Junior Development
Up & Comers，High Performance，High School Training
夏令营课程旨在让孩子们在有趣的活动中提高他们的网球技能
网球夏令营提供全天和半天选项。
夏令营时间: 7/1-8/30全天或半天，至少一周
年龄5-18岁
选择任意周的组合以获得折扣
详情请看：
https://www.timeafterschool.com/index.php/Summercamp/programDetail/camp_id/324.html

    `,
  },
  {
    id: 34,
    title: "地板/地下室整修",
    content: `
    *******大普林华人生活群信息:地板/地下室整修 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

地下室你可以联系顿普 (609) 240-9088 3年前他帮我做过 做得还不错

地下室 (609) 203-0033

Basement everything
Serving NJ, PA, and NYC, Jersey City, Edison, Freehold
OPEN
1-732-697-0557

Ryan Basement
phone
+1(215) 801-5470

+1 (732) 889-6853. 磨地板上漆 $2/sqft 非常好的师傅 就是太忙不一定能接电话 可留言

Floor   赵师傅     
赵勇 (732) 397-5770 。 他专做地板。又快又好但不便宜。
做地板的师傅
赵师傅 732 397 5770
做地板的赵师傅 坐地起价。而且涨的不少。不建议
赵师傅做的感觉上确实好 
Basement waterproof Sal Mendola         609 375-0466            还好，要讲价

郑海雪-换地板
微信号：wxid_exps314z628v12

bill电话7323221378handyman
装修地板

@梅子 @Han @Chen Hong 推荐打磨地板的人Dr. Dustless, https://www.doctordustless.com 磨出来的灰尘几乎全部用管道排到室外，做完味道也不是非常厉害

@梅子 地板 Manuel +1 (732) 889-6853

我们用过carpet centers of nj 还不错  
732-254-2060​
917-923-7827
Carpet centers of New Jersey是一家中国人，他们只换地毯不清洗

安装木地板和地毯服务
Ceci的微信：XL9083271333

Handyman Daniel 给我们铺了地板，还有和地板配色的柜子定做，因为一段墙突出来很怪。慢点，但细致，价格很合理。还顺便给我们换了Sump Pump。是我问到的四家做sump pump里最低的。(609) 255-3028
上个月给我们重新装修地下室，装修地下室的厕所 ，挪了一面墙，新建两面墙，淋浴换浴盆。很赞👍🏻     
给我换了新科技的Sump Pump，不是传统的电的或者电池的pump（因为功率太小，新泽西很多flash flood，普通电池带动的泵不够，所以我们上次地下室才淹了）。新泵特别好，超赞👍🏻！        

William，手机是609-933-4014
我家地下室去年flooded，帮我紧急排水，加之后除霉消毒。人挺实在的，做事也蛮好的。

地下室内修 排水
Bob 7326970557                  

求问 我们要装修地下室 请的华人装修师傅需要屋主自己申请permit 我们申请了之后 有些项目被拒绝了 不知道有没有收费帮屋主申请permit的人或者公司
@J. Bai Kevin 6093062600 你打电话问问，留voicemail把详情说要10:43

请问大家有做basement 结构的公司吗？我家地下室的结构柱子要换
@建筑师_祥 Paul Pennachi是做泥土工程，质量价格都很好，(609) 203-0033

BASEMENT                WATERPROOFING   
Call:732-721-4900       
SOLUTIONS       718-761-3698    
The Only Basement Waterproofing Company with OVER 60 YEARS of experience
Cracksand
Leaks and       Foundation      Mold and        
Flooding        Repair  Mildew  
BASEMENT WATERPROOFING
Barbara Skurzynski Cell: 908-692-6045
www.njdrybasement.com
地下室淹水弄干净
Fire-water-mold clean up
Servpro
732-431-4440

请问群友们有好的irrigation contractor 推荐吗？
Hidden springs(irrigation)
(609) 585-7080

我联系了Fyr-fyer （609 896-0600） 他们可以提供Fire Sprinkler System 检测和服务。

大家好，你们都是用哪家做Sprinkler inspection ? 价格如何？有推荐的吗？
1 732 521-1666
Chad
同时维修换抗冷剂，税下来约320

ASEMENT    Ready to improve your home?    
WATERPROOFING    Call:732-721-4900    
SOLUTIONS    718-761-3698    
The Only Basement Waterproofing Company with OVER 60 YEARS of experience
Cracksand
Leaks and    Foundation    Mold and    
Flooding    Repair    Mildew    
BASEMENT WATERPROOFING
Barbara Skurzynski Cell: 908-692-6045
www.njdrybasement.com

(800) 865-8787
RYTECH
claims@rytechinc.com
SERVICES    lICRC Certified    
Water Damage Restoration    lICRC #244434    
Mold Remediation    Water Damage Restoration    
Structural Drying    Applied Structural Drying    
Water Extraction    Mold Remediation    
Dehumidification    OSHA    
Indoor Environmental Control    Lead    
Odor Removal    Subrogation 1    
Sewage Clean-up
It's Not Dry..Until it's RYTECH DRY!

Water Damage Restoration
RYTECH    Residential/Commercial    Mold Remediation    
WATER DAMAGE AND MOLD SPECIALISTS    lICRC Certified    
24 Hour Emergency Service
(609) 924-9565
DANIEL JANICKVice President Rytech of Central New Jersey Cell:609-917-0830
djanick@rytechinc.com claims@rytechinc.com
www.rytechinc.com/central-new-jersey

    `,
  },
  {
    id: 35,
    title: " 妇科大夫",
    content: `
    *******大普林华人生活群信息: 妇科大夫 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15


xu bojun 不过有点远 在edison 那边
妇科大夫会讲中文
xu bojun
(732) 906-8689
2023年12月退休

albert chan 也不错 也比较远的
albert chan ob
(908) 754-9600


OB/GYN https://www.princetonobgyn.com

Dr  Nicole Davis
751 Route 206, Hillsborough
一般，没太感觉

Lei Zhu, PA-C
Physician Assistant (PA)
Obstetrics and Gynecology
No patient ratings. Why not?
Sees patients age 18 and up
Ms. Zhu is a Penn Medicine provider. In New Jersey, providers are affiliated with Penn Medicine through Clinical Health Care Associates of New Jersey or Princeton Healthcare Affiliated Physicians, PC.
Call 609-853-6555

Dr Gloria Bachmann
732 235 6600
RWJ 医院很好的大夫，可惜离开了，但是 感觉那里的大夫都不错
(609) 631-6899
RWJ Center for Women’s Health
1A quakerbridge plaza
Ob Gyn doctor  Dalal Kunali 
女大夫，挺细心的

    `,
  },
  {
    id: 36,
    title: "肠胃病专科医生",
    content: `
    *******大普林华人生活群信息:肠胃病专科医生 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

胃病
各位邻居，请问有靠谱的胃科医生推荐吗？
我最近看Aloysius Rho，很喜欢@Sherry Li 
耐心且逻辑清晰，我看了三个医生以后就一直跟他看了 

Bingru Xie, MD
胃肠专科医师
211 Bridge St building d, Metuchen, NJ 08840
njdda.com
(732) 662-5115

请问大家有做胃肠镜的地方推荐吗？谢谢

肠镜大夫
Eric H Shen, MD, 在他那里做过肠镱，感觉不错的
他是不會說中文的上海人 腸鏡專家
https://www.princetonhcs.org/care-services/princeton-medicine/specialists/eric-h-shen-md?gclid=CjwKCAjwrNmWBhA4EiwAHbjEQPbnfWYmkkrSMfmeJBmg95xZX67E-fBCa4lugjo70hOMh3x15uEtNxoCnVUQAvD_BwE
CONTACT
Phone: (609) 853-6390
Fax: (609) 853-6386
Center for Digestive Health
5 Plainsboro Road, MAP, Suite 450, Plainsboro, NJ, 08536

求助:侄子在宾州大学读博，最近二十天肠胃功能失调，吃不下东西，身体日渐虚弱，已经瘦了6斤，预约肠胃检查已经安排到半年以后，急需尽早做肠胃检查，请群友们推荐可以立即肠镜检查的诊所或医生，万分感谢！

试试这个医生，一般1-2周就可以约上 https://njdda.com/en/home/

纽约的法拉盛的医生可以马上做 我当时自费的400 第二天就做了

请教医生
荆彤肠胃中心-Jing
Gastroenterology&Hepatology
纽约皇后区的胃肠专科医师 
法拉盛 FLUSHING
136-68 Roosevelt Ave 3rd floor  DO      OWN     
QueensNY11354   FL      HING    
服务区域:纽约

    `,
  },
  {
    id: 37,
    title: "修车库门",
    content: `
    大普林华人生活群信息: 修车库门 *************** 为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微 信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友 发送评论和信息，及时登出反馈。群主微信号:yalichen15
请问大家有修车库门的师傅推荐吗?springs 坏了可能需要换。感谢 找Yuvi换过spings、pulleys，现在用了一年多，质量没问题 Garage & Locksmith Security For Sure
+1(215) 805-9209
Yuvi， Yardley PA
All Day Gerage (车 库门) +1(609) 891-3592
用了这个，隔壁日本老爷爷用的，换了motor一共600多，最开始那个Princeton garage door那家 张嘴要九百多，够黑的
我们用了all day garage doors这家，还行，不那么贵
今天不小心把车库给撞了下，用了一家公司。公司要的比较贵，但来的technician还不错 ，他说自己也做，价格会优惠不少:tom garage door 908-251-8750
另个小贴士:如果修garage door，除非紧急，不要用emergency hour修，会贵很多 修理车库门
6095850074, Miller garage doors llc, 是个local 公司，服务很好
换了一套新的garage door opener, 用了home depot的安装service, 记得160?

 908 526 5535 B&B
修车库门
JAMMER DOORS
Mercer County NJshowroom
AA ajammerdoors.com
609-883-0900 给我家换过motor，给邻居家修过门，价格公道 这家修车库门用过，挺不错
Schwartz Overhead LLC (609) 735-6414
修车库门
Sears Garage Door Installation and Repair (609) 240-8771
修车库门
(856) 420-3220
Address
2016-2024 Woodlynne Ave, Wo

    `,
  },
  {
    id: 38,
    title: "水管工",
    content: `
    *******大普林华人生活群信息：水管工 *****
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
 
水管工/Plumbing
推荐一个水管工/-Alan 732-298-0518；732-288-3793
他是过去AJ Perry的Danny Lango的儿子，Alan和他爸爸开了一个公司叫Just Drains。地下室水管堵了，老问题，先帮我们通好，然后给我们三个方案。我们最后选择换管道，过去Redding过来也这么说，但是Alan报价6,000美元，比AJ Perry和我们询价的Redding’s Plumbing 便宜。老Danny和几个年轻小伙子(其中一个手艺和态度都很好的叫Nicholas)一起做，很勤奋，有电话和text message很快就回。工程质量和服务态度超赞👍
 
 Handyman Daniel 帮我们更换了drainage pipes,过去的管子生锈了，可以看到管子有轻微漏水，另外管子生锈造成下水道老是堵，换成PVC的管子，现在完全没有厕所和厨房排水的问题。我们先问了一个Plumbing公司报价一万，后来找了上面Alan 的公司Just Drains，他们报了六千刀，Daniel的报价才两千多，价格方面很实惠，态度还可以，本来说是两天做完，其实一天就做完了。很满意！(609) 255-3028 Daniel text/留言

推荐一个Plumber，今天刚用，LenthePlumber, 来的速度很快，打电话到来我家半小时，价格很合理
CALL(862) 701-1245
我今天是小问题 水循环系统漏水…上门小哥就收了49的上门费（我另给他小费20）
没有额外收其他费用
另外 这家公司 把来的Plumber的照片跟 网上track他抵达时间 都发到我手机上 感觉很靠谱

Tamasi Plumbing
609-799-1494

地下室的水管有点儿漏水。求推荐水管工人
@冗谈 上次我找Harris plumbing 解决下水道堵的问题，觉得他们服务还不错 8332364066
谢谢找Roto-Rooter, 4个小时的活儿要了2千6

阿才和他的徒弟Tony  (732) 672-1199
装厨房/卫生间水池的水管，墙砖修补抹腻子，按窗帘，简单的电工活都可以。有时候回复快有时候回复比较慢。干活的质量总的来说还满意，价格也过得去。


ALL CLEAB	Michael and Anthony Settecase	
p:732-554-7357
e:cleardrains83@gmail.com

Dominique
Clear Flow Septic, Sewer & Drain 
(862)777-2421

请问大家我要换厨房的水龙头，请问有推荐的plumber吗？谢谢
我上次用的Len The Plumber, LLC
(848) 455-4486

今天才做plumbing ，通下水管道。第一个来看估价$395 with half year warranty ，没让他做. 第二个，$73 with one year warranty，动作快，质量高，价格好。特别推荐
A technician from Harris Plumbing...​AA​
Plumber Matt is a highly skilled drain specialist with over7 years of experience Matt has a big family
and loves to play hockey and attend car shows!
You may contact the office at(800) 704-8866 if you have anyquestions.
Matt (plumber)
(609) 558-5847

Michael “mike"Emerson
Handyman
+1 (386) 868-7002
This handyman very nice, you may use for almost anything. 

Jianqiu Lin
Plumber林剑秋
(609) 721-1886
 
@all 我家热水器管接头处小leaking. 群里有师傅可以帮忙修理吗？谢谢！
@CindyW 刘师傅可以，电话2538809349。

Grade A Plumbing​gradeaplumbinginc.com​​(833) 447-2332​
不错
 
Bob Fredrick Plumbing
(609) 731-8982
 
Robert​​7322364538​​​​​​​​
 
朋友推荐过：handyman 魏杰 (917) 963-6484，他也修水管
 
普林斯顿的 NC Jefferson Plumbing 做新工程很可靠。
 
有一个Valley Plumbing co. . 3 年前用过修理及replacement 小工不错。609-636-3730
 

Mike (732)4251993
我找了两家老美的公司报价，好几千还心虚不一定能修好，Mike ,就charge 几百 能修好
就是我家二楼浴室管子漏水了，一楼的房顶被水淹成这个样子
他在二楼浴室隔壁墙上开了小口，把管子断的地方修好了

Kevin
609 306 5942
 
J Johnson
908 874 6619
 
水电师傅电话是718-908-2188
 
李师傅
267 939 8526
推荐李师傅，价公道，服务态度好。我们的朋友在我们的推荐后也找他干过plumbing的活，为前一个师傅擦屁股的

 
Theo Ex Plumbing and Heating LLC2
Phone# 609 838 1843​theoexpiumbing@gmail.com​
Permit fee​76.00​76.00​
Total​$1,226.00​
Theo Plumber
609 851 2401
 
Nick @ (973) 727-2105 was a very pleasant, knowledgable, courteous and prompt experience!  

AJ Perry 若干年前用过，还不错  价格也是$99
找AJ perry， 厨房下水道堵塞收费$99。
A J Perri电话：732-372-0788
PerriDanny Lango 732 439 7839
 寻找Plumbing或HVAC公司, 不能用AJ Perri， 善长将小问题当成大工程给你报价
AJ Perri通下水道好像只是第一次用给便宜，以前都是99，但是第二次以后就是280起了，我第二次换了老公名字电话啥的都不行，一个地址只给便宜一次推荐一个plumbing公司，叫AJ Perri- Tinton fall, 电话(800)287-2164。$130通下水道，很及时，打了电话2-3小时就到了，24小时7days available。反面对比Harris plumbing, heating and electrical, 周五打了电话，只能约周一，周一又推到周二，一直没人联系，后来好不容易有technician联系，要价$350， flat rate～～
今天用了，不错。我自己陆陆续续折腾了几个月的Kitchen水流不通畅(不是完全堵塞)的问题，解决了。跟OP说的一样，$130, 打电话之后2小时到了。干活的peter很knowledgable, 跟我讲了很多plumbing的知识，还给我解释为什么我自己用工具捅过但没捅捅通的原因。还有管道可能有哪些潜在问题，告诉我后面自己要注意什么，减少pipe后面继续出现堵塞的可能。也没有跟我hard sell任何额外的服务。很赞

这次在试Harris Pluming, $73
Harris Pluming Heating Air and Propane​callharrisnow.com​​8564858353​​Very reasonable ​
bathroom sink drainage problem， cost is very reasonable $73/drain.strongly recommend ​​​​​​​​
Good.​ALL CLEAR DRAIN CLEANING​
24 HOUR EMERGENCY SERVICE

ALL CLEAB​Michael and Anthony Settecase​
DRAIN CLEANING​​
p:J32-554-7357
e:cleardrains83@gmail.com
 
Jersey
The Homeowners
Master Plumbor Rex Kinney JERSEYPLUMBING.COM
NJ Master Plumbers Lic.#7359908·2817101 JERSEYPLUMBING@GMAIL.COM
 
Plumber 水管
徐师傅 7327627922
@徐师傅收费良心价，就是脾气大了点
@我们家厨房下水道不通，徐师傅过来弄了一个半小时，通了下水道，收费260.
 
Plumber (732) 2364538Robert
 
ABAT construction , tel: 732 8217794 or 732 494 2121
 
Valley Plumbing Co.​NA​NA​6096363730​NA​​4 (recommended)​3年前用过修理及replacement, 小工不错​Theresa Huang​​​​​​​
Matt​(800)704-8866​​便宜​
 
Handyman​Nelason​
609-495-4636
 
plumbing​AZ plumbing don​
609-577-5697
 
M J Grove Inc, Phone: (609) 448-6083
 
Kitchen contractor
(646) 498-1160. 邢师傅。
 
张克洋，215-858-1006， 东北人，人不错，handyman。
@ 修了水管焊接处漏水，收费200
Harry Handyman
8482486618
 
Bob Fredrick Plumbing
609 731 898ce2
 
朋友推荐过：handyman 魏杰 (917) 963-6484，他也修水管
 
N. C. Jefferson
609 924 3624
(plumbing, heating, air con)
 
@CHARLES 你可以找这家问问，我刚让他家做了drainage。价格不错+1 (609) 743-4563

我来给大家汇报一下，今天麻烦群里的@J考拉 师傅来我家装了净水器。考拉师傅活做得又好又仔细，非常设身处地为客户着想，真是心灵手巧！原来人家国内物理专业，在美国拿的计算机科学的研究生，有空时做做handyman 只是副业，水平确实高，实在高
考拉师傅不错 帮我装净水器也特别
@Lily Chen_普林斯顿 只有微信deep_red28

    `,
  },
  {
    id: 39,
    title: "杀虫害",
    content: `
    *****大普林华人生活群信息: 杀虫害 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

杀虫害/pest control
我家用的是Green Pest Control，电话：(484) 925-1747.

家里进老鼠了。pest control大家有推荐吗？
+1 (866) 995-3120

+1 (855) 284-3733
杀虫防鼠的公司Aptive
我家前几年换的这个公司比较好
@金鑫 这家比从前的公司要便宜一点点，而且服务人员每次做完工作，都会发照片给我手机。
好的！谢谢！今天去问了pest control。除一次老鼠要1000。真心黑

最近家周围很多黑色长条毛毛虫，在树上也有一个一个的白色网状的东西，我爸弄下来一看全是那种毛毛虫，，大家有看到吗？不知道怎么处理，往年没有

@WZ  我以前有annual contact with TruGreen for  tree and shrub maintenance.  有这种网状虫巢的时候，他们会来打药。把那巢捅个洞，用药水喷进去，喷透。要在巢破掉、毛毛虫爬出来之前处理。不然草地上都是。 去Home depot 买药买喷雾桶，自己应该也能做。 


关于pest control company, 给大家一个反馈，western pet service谨慎使用，用下来感觉是个骗子公司，电话里说好一年的合同，五个月只来了一次initial visit, 20分钟喷药放老鼠夹子，信用卡上charge了近300， 然后就消失了，从来就不安排seasonal service, 这个公司email 联系不到人，要合同条款和payment schedule 从来就不提供，service person 和office互相推诿，骗子公司的成分多，只在乎信用卡号     
Pest Control    Western Pest Control    https://www.westernpest.com/    Frank   (844) 213-6132          

Pests Control Chris And
nick Owner
Onthespotpestcontrol.com
mobile
1(908) 350-8215

908-361-6657
VIKING
Pest Control

我家用的Aptive，服务还行，我比较喜欢他们可以给前后院的树喷杀虫剂，不是所有除虫公司都有这个证。价格也算便宜.

Greenix 不推荐，收了钱后就态度不好了，每次来人说法也不一样，很敷衍。

亲戚家有个黄蜂窝，邻居说要找pest Control Company,请问大家有推荐的吗？
(732) 985-5495


推荐Pest Control  On the spot pest control LLC    www.OnTheSpotControl.com                9083508215                              

Pest Control    Orkin   Www.orkin.com   Edward  Mauceri 8004450745              

MOSQUITO SQUAD
有人做过mosquito/ticks treatment吗? 要不要一起团一个?我问了大约不太到800一个season， 8次。人多有group discount 

Family Pest Control Gary
(732) 985-5495

cooper pest control 在Lawrence
1 (609) 799-1300

GARVEY
609.448.0900
Tom Garvey      Rich Garvey     Matt Garvey     
609.658.0634    267.980.8629    609.658.1222

    `,
  },
  {
    id: 40,
    title: "保养树和砍树",
    content: `
    *******大普林华人生活群信息:保养树和砍树 *****
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

保养树和砍树/tree service
请问有没有推荐可以给植物看病的人？家里的柏树叶子黄了，想找人看看树还有没有的救。谢谢🙏
Master Gardeners
AskTheMGs@mercercounty.org
还有Save A Tree

AG Tree Service
(609)917-4022.wwwtreeserviceag.com. Tree Cutting Service·Agricultural Service
@我们昨天约AG tree来看了。一棵树报价950+200清理铺好草坪，我们就砍这一棵，树已经差不多死了，他还答应顺手把后院另一个很小的已经死的小树苗remove掉，不另外收钱。最后讲价到$1100包括所有。他解释说虽然我的树不壮，但因为在靠里面，重的设备车开不进来，得靠人工拉，所以比较贵一些。约了这周六就来砍。
@我们家找了AG，Quirino，报价都一样，2500（不包括磨平根），（砍成烧火的木材要加600）。但是AG说我们家砍下一棵树，可以便宜15%。

因为这颗大树，我们找了4-5家来estimate, 最贵的要将近$6000，便宜的要价$3000，这家公司要价$1700 

群里朋友： 有砍树公司推荐吗？ 谢
@Noelle 我用了群友推荐的这家。我问了三家，他家最便宜，有license 有保险。昨天来砍的
我去年用过Fair landscaping +1 (609) 213-4096

这家砍树公司推荐给邻居们，四个工人工作了将近两天的时间，帮我们砍了三棵参天大树，其中有颗树又高又壮。一共才收费$3000。砍完后还帮着清理干净，又帮我们把一棵树锯成了小段，冬天可以烧壁炉
TREE AND STUMP REMOVAL

最近砍掉十几棵dead Ash Trees. 这家公司很好，又快，又干净，价格也好
·TREE REMOVAL·TREE PRUNING TREE TRIMMING  
TREE SERVICE·LOT CLEARING·STUMP GRINDING
609-213-4096
fairtreesservices@gmail.com
同推荐这一家，之前我也砍了五六棵树。准时专业清理也很干净

有修剪树的公司可以推荐的吗？先谢了。Mike 908-492-7722

 (201) 598-9553 alberto。给我们后院砍了十几颗大树，其中一颗diameter有40”。grind stump。没出什么问题。提前问township要permit

Tree Justin
(609) 731-9882

@Tricia 老墨6093563998，用过。三棵树1090，供参考

我家刚砍了一颗大树，头一次砍树，分享一下这几天学到的-
报价： 砍树、挖树根、挖完树根往坑里填土补草这三项要分别报价的，不要到时候砍完了剩个大坑没人管了。 

砍树公司： 联系了四家，都是群里和邻居推荐的，相信已经比大部分老美公司都偏宜了，四家里最便宜的是M&C ， 电话609 424 8626 Diego, 其他三家给的报价是2300-2900刀，他家1900刀砍树加挖树根(我家是比较大的橡树)，别家250刀补土补草，他家150刀。M&C是中国邻居介绍的(不知道他在不在群里) , 有经验，说他家的报价是非常非常低的，而且还是township推荐的，做事利索我目前很满意。 
砍前：先确定树是你的还是town的，有些树如果在你院子里但是离路比较近，不一定是你的，每条路离路中心一段距离(距离多少要看具体路)内的树都是town tree,  Taylor Sapudar tsapudar@princetonnj.gov 是普林的Arborist, 树都归他管， 你要不确定可以让他过来量一下，我的树量完了就差90公分就是town tree了，差一点就不用我出钱了 我邻居的树在她院子里但就是town tree。
砍后：不知道是不是砍一颗大的一定要补种一颗，但我本来就打算补种的，也是联系这个Taylor, 他每年春天和秋天各种一百颗树，如果你报名，他就过来给你种，种的时候会种在township地界内，这样再死了就归他砍了。 今年秋天名额满了，我们放在了春天的名单上，此处再次感谢我的邻居，我都不知道镇里还给免费种树的。

清理倒下的树的公司推荐	
Monkeys at 908-334-2876 or google them.

Bunker Hill Tree Service New Jersey
PrincetonNJUnited States New Jersey
(732)672-9197
Bunkerhilltree@gmail.com
bunkerhilltree.com
@zyan 我看了四颗大树。3000 但是这个价格要看具体状况。同样的树 一个在路边 一个在后院 价格肯定太差很多 

这家干活认真 价格是我找的里面算低的 而且快。他们有个机器 60尺的树 不用人爬 用个机器砍三次 把树就这么端着放地上

FAUR
Fair Trees Services & Pardicaping
Fair Landscaping & Trees Service NJTC#795890 Alfredo Melgar.
325 Hazel Ave Ewing Nj 08638 Phone:(609)213-4096
Email: fairtreesservices@gmail.com

@夏, Jigang 我前一段砍树找的这家+1 (732) 677-6524找Quirino 一棵树大约不带除根不到1000
2022年刚用他们砍的树，2500刀但是现金，AG报价比他们还要高一百。最后还算满意，但是下次找他们，一定要用书面写下来条件，让他们认可签字，否则过来砍了，发现答应的不准备兑现。 所以差点吵起来，还好不用付定金。因为他们用机器来拉木头，前面的草坪压出两个巨大的坑，但是也没办法了。

+1 (609) 529-1615
Pepper deTuro 新泽西砍树的公司，是我的园丁Tony介绍。
Treecare@woodwinds.biz
专业砍树几十年的

Davis Tree Services
732 803 2583

砍树这家不错，今年冬天用过。hunter 908-286-0791
Hunter 908 286 0791

SavATree
609 924 2800
询价中报价最高的，我们家的树别的地方（AG, Quirino）报价2500，他们公司报5700 （2022年5月）

6094301195
David Wells是老板就住在普林
唯一的缺点就是活太多，要排队, 一棵树只要1000不到

我家今天院子砍了二十多参天大树，做过几家，最好是Princeton tree care, 每颗不包树跟六七百这样，你们也可试试，google 地图能找到

    `,
  },
  {
    id: 41,
    title: "驾校",
    content: `
    *******大普林华人生活群信息: 驾校***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

驾校
SAFETY FIRST DRINING SCHOOL      
STUDENT C DRIVER
Safety First driving school
Open·Closes 5PM
(732)821-1111
safetyfirstdriving.com

Services: Adult lessonsTeen classes16 Year Old Programs,Approved Drivers Education...

安全驾校罗教练6785492618微信号:raylaw168 
有没有学车教练推荐？
过去100两个小时

@苏超(Penny 2025)  我儿子是找学校Gym class的老师，蛮不錯的
Lennygudoto@princetonk12.org

李教练+1 (848) 391-8961
极耐心，人头熟，没有李教练我的路考过不了
410，六个小时，教三次，但是要去Edison

在问一下教开车的新泽西驾驶学校？要求会说英语。谢谢☺️

@Rebecca 我们用的这家：https://wbdriving.com/ 觉得还不错。
@Rebecca 不客气。笔试可以在他们那里考，不用去MVC. 这个很多驾校没有。

    `,
  },
  {
    id: 42,
    title: "健身",
    content: `
    *******大普林华人生活群信息: 健身***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

健身/Fitness Center

Lifetime

Princeton Fitness & Wellness on the State Road
Very good
Princeton Fitness & Wellness  就在我店的隔壁，对于有上课的小伙伴确实不错，但对于只用健身器材就不太合算了，里面还有游泳池,设备还挺新的@楚

YMCA健身也不错，城里，免费停车，有游泳池，虽然因为既定泳课常常用不了。

    `,
  },
  {
    id: 43,
    title: "房屋车保险和来美国看病",
    content: `
    
*******大普林华人生活群信息: 房屋车保险和来美国看病***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
保险
@Song🐑 我的List上没有。看群友推荐。我们家过去在华盛顿一直用Allstate十几年都很满意，搬到普林后他们当地办公室的服务屡屡出错，导致我们搬家后一段时间竟然没有上好保险，但是也没通知我们。后来就改用geico，略贵一点。

我們也用Geico和汽車保險一起，會便宜一點

geico不错，Allstate会慢慢涨没原因

车险打算从geico换progressive，便宜100

其實Njm很好，我們都在他們那二十年，因為我开車吃罰單，（上班着急，超速）又碰鹿，所以他們不喜歡我們，漲價很多。我們才重新找
每年年底都退一點餞回來，真的很好

我查看了一下， 繳費給旅遊保險的公司是— travel guard group INC tel: 8008261300

@Song🐑 房屋保险“杨林静”
杨林静
(646)334-5458

请教大家，有没有比较好的房屋保险agent 推荐啊，谢谢
@di wu 我用的这个agent蛮不错，认真负责
state farm公司的simon，华人，很热心，车保险和房屋保险都做，解答问题很清楚Mon-Fri 9:00-6:00 (EST)
Sat 9:00-2:00
Evenings by Appointment
Phone: (484) 416-3518
simon.z.cao.ts2c@statefarm.com

请教大家，厨房墙因为管道漏水霉烂了，需要扒掉橱柜和drywall重新做，可以走保险报销。请问有推荐的师傅或者contractor吗
要确认保险公司的赔偿数额后再动工，保险公司的报销手续要跟有资质的装修公司对接。或者你跟保险公司达成一致，它一次性把钱给你，你自己处理后面的事。

群里有谁是home insurance agent? 或有谁可以推荐在Princeton area issue home insurance policy？
@Xu you are in good hands! @Jessica Feng 和杨桦不但专业，服务极佳，强力推荐
请联系杨桦。我刚搞定。7322870767 ext 1找Henry。直接发短信给这个号码就可以。
Jessica Brown   
GEICO   Senior Por      825 Route       33 Hamilton, NJ 08619   tfolio Sales AgentGEIcO Mercer  
Phone: (609) 530-1000 | Fax: (609) 584-5555 geico.com mercer
他家居住在美东超市附近，人品好，责任心强，售后也好。
我跟Geigo网上填了表，电话上还耗了不下40分钟。然后告诉我说他们的伙伴不做普林斯顿的单子，浪费时间
Geigo现在找了两个借口不做Princeton。价格高+靠海岸近

Jianing Lin，手机：848-702-4988。
我和我孩子，一直用他做房屋、车、租房及人寿保险15年了

来美买医疗保险
胜翠
WeChat ID: alicelin-actuary
6097519093
2014218327

请问各位家长朋友，有哪位医生接受NJ FamilyCare的well point 健康保险卡的吗？
去保险公司的网站找医生单。输入你的邮区号。这是找收这个保险医生的最快途径。不过最好还是要打电话给医生的办公室核实一下。

来美亲属保险
@Johnson 谢谢，我想知道在美国有没有可以买的保险，针对老年人比较全的保险
@丹 今天剛好有一個朋友問到我知不知道一個什麼Travels International （不確定名字，聽起來像個旅行社，但是專門賣國際人士來美的意外，健康險）他有一批商務人士要來美待一段時間，所以打算為他們提供一些保險。地址是182 Princeton Hightstown Road, West Windsor 是一片office complex。

@若然 www.insubuy.com 这是胜翠以前在群里发过的，我给我来访的家人买了这个保险。供参考。

您好！我想跟您询问一下在国内的家人如何远程看病的事。请问是什么机构？
fenghao_chen
他们公司帮助对接中国病人和美国合适的医疗服务

@普林斯顿陈老师-文书辅导 - 推荐一下Amazon Pharmacy。 家里人最近好几种新药，保险支付额很少，自费都不菲。最近我从Walgreen换到Amazon Pharmacy, Amazon Prime会员药价差不多是本地药房的一半。所以建议大家买药的时候，可以通过亚马逊药房询价，看哪个更便宜。我们家里人常吃的几种药，最近我都换到Amazon Pharmacy了，价格都便宜不少，50%-10% 不等。
是的，Amazon Prime可以接受保险，可以输入具体保险信息，她可以同时报价有保险和无保险的药物价格。 有时候有保险的价格比没保险的价格还贵，估计具体看改药品她家和保险公司分账安排。

@Wenzhe 如果有錢自付，或者有全球給付的保險（比如在香港買了保誠Prudential 或者AIA), 就可以直接找醫療機構。癌症的話，這家在紐約和新州的醫療機構排名很高。 
在三藩市的UCSF（加州大學三藩市分校是間排名前列的醫學院）和德州大學奧斯汀分校醫學院（UT Austin)的Anderson Cancer Center有不少從中國來的求診病人，以前有微信文章介紹自身經歷。 
养和的 服务，真是一流水平 
UT Austin Anderson 癌症中心，麻省总医院，Mayo Clinic 都有专门针对国际就医的部门。富裕中国人会联系他们（或者通过中介联系）寻找他们专家制定治疗方案。如果你联系他们，他们会告诉你国内去哪家医院检查，然后远程看检查结果并和国内医生讨论病情，建议最佳治疗方案。不需要折腾病人来美国检查就医。美国医疗的确服务态度好，另外️一些早期试验药，但病人远离家人，语言不通也不一定是最佳就医选择。如果美国权威专家制定医疗方案，国内外资医院或者香港，新加坡的医疗水平和服务也不错的。

@Xiaofei - 老人如果有绿卡但不到五年，可以在exchange上面买Obama Care的保险。保费和免赔额都比较高，但是相比美国昂贵的医疗费用，这也还是值得的。如果没有绿卡或者拿到绿卡不到五年，老人可以买短期国际旅行医疗保险。在携程上可以买国内保险公司的国际旅行险，在美国需要自己先垫付然后报销，也可以直接买美国保险公司的visitors国际旅行保险，一般发生意外，直接看病，保险公司支付。 不过国际旅行险只能Cover意外情况, 不含基础疾病和preventative care。老人的医疗保险是个问题，一定要考虑周到。

www.insubuy.com自己上去买就好 家里老人来探亲，需要买旅游保险，求好的保险代理推荐谢谢

你到exchange 上面去看看研究一下？理论上exchange是给公民和绿卡居民的强制健康保险，具体每个州情况以点不同，但大同小异。新泽西比较富裕，福利相对别州已经很好了！如果没绿卡，那在美国需要签证，一般学校和雇主的医疗保险肯定比exchange便宜（雇主会支付一部分医疗保险费）。

联系人：Sophie, 479.200.0792 服务内容：个人及团体医保、旅游医保、Obamacare (GetCoveredNJ)、Medicare等咨询及申请。主要代理公司包括：Horizon, AmeriHealth, aetnaCVSHealth, United Healthcare等。

医疗保险可找群里的Judy Wu 

乡親们：有誰用过汽車保險公司寄來小磁卡，放在车里，跟踪是否speeding ... ，這樣过半年根据行车情況減少保險费的吗？，想知道好不好用，有沒有被泄密的風險。謝謝🙏
我们用过progressive的那个snapshot program,，能便宜一些
@Lijuan Allstate 也有一個 Drivewise 監測你駕駛習慣，距離，安全駕駛一個月可以省十幾二十塊錢。洩密的話，我沒啥密可洩，省點錢實在。

    `,
  },
  {
    id: 44,
    title: "皮肤科专科医生",
    content: `
    *******大普林华人生活群信息: 皮肤科专科医生 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15
皮肤科
🌸茵ᴵᴺᴳᴿᴵᴰ 我女儿用的是Princeton Dermatology Association 的Dr. Kaufmann. 很有经验，缺点是比较难约上。电话是609-683-4999。地址是208 Bunn Drive, Princeton
 
打扰了，请问大家有Dermatologist 推荐吗？治疗青少年的粉刺Acne 较拿手的。多谢了
 
Schweiger
Dermatology Group -
Princeton
800 Bunn Drive, #201 Princeton,NJ 08540
(973) 571-2121
Convenient same day
appointments
844-DERM-DOC    646-558-6696
 
@孙芳遒 我们去过这家看皮肤科
 
我们用Princeton Nassau pediatrics, Dr. Pierson 开的药膏，效果不错, 专科医生不好约
 
@RoRo 这个很专业但有些保险不受，你问一下
KESSEL DERMATOLOGY
609-890-2600    HAMILTON SQUARE
1700 Whitehorse Hamilton Square Road, D1 Hamilton Square, NJ08690
609-890-2600

    `,
  },
  {
    id: 45,
    title: "露台阳台车道",
    content: `
    *******大普林华人生活群信息: 露台阳台车道 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

露台阳台和车道/ Driveway Paving / Seal Coating/patio
你可以找Mario (609) 577-0462 他去年给我扩展patio 帮我把旧的也重新铺了 做得很不错 价钱也蛮合理的 就是他们很忙 不知道什么时候可以排到
Mario 买tree价格也挺便宜的

铺路
我用过一家，还不错。但是是2016年用的，希望公司还在
Here is the contact number: 877-884-7325. Mark Harrison

Tomaselli Masonry 铺路
Jerry 732-715-4278
Nick Patio
(732) 685-6405

Deck Service    Gary's Deck Servie    
609-443-8018

Daniel
609-255 3028
修补deck和siding烂掉的木头/窗框,他也换siding，价格不贵，手艺好
给我们家做了deck，deck中间定制了火盆，他还给火盆做了盖子，不烧火时就是一个桌子。每次开Party都是大家的谈资。
我朋友家请Dan做过一个中式的木影壁 ，自己设计的像中国古钱的形状，加定制的同色木制花盆，很新颖 ，普林大概就他会做这些，价格很合适，他的人工和材料费用分开，一目了然。6092553028，他活儿很多，基本不接电话，但是text和留言都可以找到他。
刚帮我们后院建了一个露台，漂亮，做工细致，要价很合理，难得！没想到我家后院地下都是石头，打桩就打了两天，也没有加钱也没有抱怨，态度好👍

修车道裂缝
Glen
Budget Paving and Masonry
+1 (609) 234-8888

Deck Builder    
My Deck, LLC | Deck Builders
比Deck Guardian貴30%.但我去看邻居Deck Guardian的手工很不行.

(908) 713-1000                
"My Deck" 只用 steel frame and Trex Transcends.所以以较貴.
https://maps.app.goo.gl/vxRHrRfVEc7NCp3r8

Royal Tree Service            9086472932                
经验很丰富。做事认真，现在4年过去了driveway还是看起来很新。

DEMPSEYR
SEAL COAT DRIVEWAY
CRACK FILLING
COMMERCIAL E RESIDENTIAL
908-941-8664 reyes.wilmer2016@gmail.com

CaNam: 修补和Seal 旧的烂掉的车道，把裂缝都填了，做了新的Coating，就像新的一样。还拓宽了车道两边。他和他的工人手工很好，做的很细致，很有设计感。
609-255-3028

分享一下，我曾让嘉欣做车道感觉很不好，不推荐 Sent from my iPhone

    `,
  },
  {
    id: 46,
    title: "修理换屋顶",
    content: `
    *******大普林华人生活群信息: 修理换屋顶 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

屋顶/roofing
我用过MAK换屋顶 价格便宜 很专业@Su 
谢谢你的信息，MAK的Paul给我的报价的确是最低的。你有用他家的服务吗？
roofer，看到挺多人用MAK，大概属于比较经济实惠型吧。我前不久找他们要过报价，比较便宜。后来我找了，SECI，他们价钱稍贵，但用的东西和warranty比较好。roofer最好找大一些的公司，warranty更重要。小公司或个体户过几年可能就不见了。
MK不会修屋顶，只换屋顶
我們以前用double D roofing 非常满意

Daniel 
609-255 302，text 或者留言
修补屋顶deck和siding烂掉的木头/窗框。
他给我们家换siding，修了门框。价格不贵，很细心，木工手艺好
我们家shingle，siding都是木头的，里面烂了，很多处翘起来一块。他把里面烂的木头换掉，然后放了同色的不会烂的替代品，好看多了。还修了顶楼的窗户，窗框都烂了发霉了。愿意接修理活很难找到，这样手艺好而靠谱的更少见

Ivan Lopez
1 (773) 936-6979
推荐一个我最近用过的handyman给大家。前段时间帮我维修了洗衣房屋顶漏水，车库门松动，房子周围木头腐烂更换等工作，感觉工程完工和收费都算合理，人很靠谱。我也是一个第三代移民的朋友推荐给我的，她说这个Ivan在家里工作的时候我可以放心出门去办事情，我没有那么做，不过由此可见他是非常值得信任的。
印象中是洪都拉斯人，记不太清了

Roof shingles 掉了一块，有没有推荐的师傅？ 先谢了！
@guonexus 我之前用的，你可以问问他Ammar Ourfali Roofing (732) 991-5855

Better Roofs 609-587-5533
Hamilton township
价钱公道												

请问大家最近有换屋顶的吗？
有 用的这家. 你可以多打几家比较一下报价。W.G Siding & Roofing Inc.Greg 215-778-3305 @菠萝 

Total Roofing
Chris 267 795 8661

Trenton Roof 换了一个烟囱的盖子（那种防鸟做窝）。很小的事情。然后把烟囱油漆了一下（给他们“加一点油”。这样师傅来一趟总得值回他的汽油钱）。
我们以前用过Trenton Roofing, 还不错
Trenton Roofing and siding价格公道活干的也利索，一个上午就能干完
汇报一下最近换房顶的情况：trenton roofing最快最靠谱、报价中等。那个double d roofing不推荐。一堆sales strategies然后报价很高还不屈不挠电话邮件短信轰炸。我家是18年的roof也没漏也没咋的、就是有几片singles做的不好、inspector不建议换、建议修。但没有哪家是说可以不换的。估计现在生意好、修就屋顶这种小活儿都不想接。但double d感觉不靠谱。
609 393-6780
trentonroofing.com
Trenton不会修屋顶，只换屋顶
@Yuki 我们找到那个quote, 还是Trenton Roofing 在2021年一月做的。$375。他们当时说他们很忙，这个项目太小（不够填牙缝的），他们有空时才会来。后来大约一周左右就来做了。

WB Construction LLC/Walter	
给我们的报价：4200sqf的房子换屋顶， 报价1万4

@Sun Emily Door Done Right 6094454444

HERRY MANUEL NAVARRO Roofer
Mobile (609) 418-5868
>>>>>> Home xlcontractors@hotmail.com

Fencing；roofing contractor 
Carl
8552922757

Geno's Roof
https://genosiding.com/
215-971-6292

    `,
  },
  {
    id: 47,
    title: "打扫卫生",
    content: `
    *******大普林华人生活群信息: 打扫卫生************************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

打扫卫生/cleaning

@All 请问大家谁有move out house cleaner 推荐？谢谢！
+1 (646) 266-0317 Stacey 
可以联系一下，我搬走时叫了她（有帮手，应该是她先生）

请问一下有cleaning lady推荐吗？谢谢
kendy +1 (609) 356-3415 @晓先 
危地马拉的 4个人 ，开车上门@Frankchen 请问像这种四人清洁的 大约如何收费
100-150 
1小时好久没有请人专业打扫了 500 deep cleaning 3500 sf的房子其实很便宜了

我知道这个帮人做清埽及家务(484) 294-7575正清

如果是一般的打扫，那Princeton Cleaning性价比很高
@凯文 您说的一般打扫的那个 Princeton Cleaning 就是叫这个名字吗？我在网上和Google地图上都没找到。您有他们的电话号码或其他联系方式？
https://www.thumbtack.com/nj/princeton/house-cleaning/princeton-cleaning/service/291392236193792075
电话是6096473909，这家可能是我用过最便宜的，同样的公寓只收了100，不过可能也是因为他们就在本地，不需要往返时间。
这家（6096473909） 看到介绍上说以前只收¥100现在是收¥180西班牙人
我找了Princeton cleaning来清洁，估价的时候说因为是第一次，所以要double price，会做deep clean，我就同意了，要了$360+每个窗户$5，一共$460。结果OK，感觉是一般的清洁，绝对不是deep clean，窗户基本上玻璃没有清理。马桶和炉子打扫得特别干净。所以感觉一般的清洁还可以，不要相信她们的deep clean就好
感觉价格太贵了

Excellent house cleaner in Princeton area.  I recommend Karina Gonzalez (609)858-8259.  She has been cleaning my two-bedroom apartment for two years and provides wonderful service. 

﻿如果是deep cleaning的话推荐Royal BABA，非常专业和仔细，之前给我把墙上柜子上几十年的油渍全都弄干净了。
http://theroyalbabacompany.com/?utm_source=gmb&utm_medium=referral
我用过这家，一个很专业的尼日利亚小哥，好评http://theroyalbabacompany.com/?utm_source=gmb&utm_medium=referral
之前我搬家，让royal BABA做了一次move-in cleaning。后来临时发现烤箱很脏，让他洗烤箱，他那时候没带相应的洗涤剂，后来又约了时间 开车一个半小时专门过来，花了一个小时给我洗了烤箱，并且坚决不另外收费。
我90平米2b2b的公寓，要求清理烤箱 冰箱，8扇玻璃窗户和纱窗，一共是300，不带窗户的话应该是250的样子。
同样的面积如果是regular cleaning的话，我知道另外几家收费在150上下
刚请royal Baba 做了cleaning, 反馈一下： 非常不专业。

好像群的帮助，推荐今天帮我打扫的人，推荐Yolanda，可以直接打电话给她，没有网站佣金会便宜一点+1 (609) 328-1438
真的很棒！而且家具东西全都收走了，不用自己丢，强烈推荐

我来推荐一个刚刚用过的cleaning team。Deep clean， regular clean都做。做清洁非常高效，且质量很好。Fernando (267) 346-9899
收费挺合理的。我真的惊讶于他们的效率和效果。油烟机，橱柜，烤箱都搞得非常干净。连柜子顶上的灰都擦干净了。巴西人，英语凑合交流

推荐一个打扫家具的服务，人很好还便宜 Dorota 609 540 3056

普林斯顿打扫卫生Saida
Gregorio
电话
+1(609) 516-7477

推荐一个打扫家具的服务，人很好还便宜 Dorota 609 540 3056

@Clare Gosia (609) 635-1815，她做的清洁工作特别好，非常细致专业
gosia这个人都不做了@Lily Chen_普林斯顿 

Antonia Clean Lady
(609) 306-0568

@Liz(Shawn 24) 可以试这个+1 (609) 647-3909 Princeton cleaning。领头接送的是Nelson，他们有墨西哥人和东欧人

Tina
609 510 5849

Luba
Princeton Cleaning Lady
phone
(609) 540-0200

claudia Hastenreiter
+1(908) 499-5082
这个Claudia也说不做了

House Cleaning Service
Irma: (609) 375-6969

Diana: 609-287-2074；Diana不做了

请有偿清洁整理房间，有人愿意做吗？谢谢
@K 这位萍姐就是专业做这个的她的电话号码是：9082658875

Basia 609-865-7417

If you're looking for someone dependable, thorough and professional, I highly recommend my house cleaner who I've been using for over 20 years. Her name is Kathy and her number is 215-378-1848

Inga
609 558 7945
609 530 1169

Vanessa打扫卫生
+1(609) 827-4448


Water& Fire clean up and restoration
732-536-7555	
关于地下室淹水，我们最后发现是链接sump pum的出水管堵了，水排不出去，所以全淹了,finished basement,可以想象一下有多糟。我们最后找了下面这家clean up & restoration company，很好，推荐。

之前请了Hernadez做post construction clean
不专业、不推荐
高分评价是她会告诉你：你给我写5星好评下次给你打折。非常无语
HernandezLLC- Commercial and Residential
Cleaning,Post-Construction,Offi...
719 Adeline StTrentonNJ08611
cleaninghernandez.com

    `,
  },
  {
    id: 48,
    title: "兽医/理发/宠物",
    content: `
    
*******大普林华人生活群信息: 兽医/理发/宠物 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

Princeton Animal Hospital& Carnegie Cat Clinic
726 Alexander RdPrincetonNJ08540
已打烊·下次开门时间:周一06:00
进行预约·princetonvet.com

请问一下绘狗看病打疫苗的诊所有推荐吗？非常感谢！

@Kathy WF 720 Edinburg Road Mercerville, NJ 08619
美国

Faith Vet
(732) 658-6777
有点远，但是还不错，价格合适
@Kathy WF 这个诊所很快。我暑假要出去，没想到经常去的附近的vet要半个月预约。找到这个faith，两天后就可以。后来狗拔牙，这个诊所比另外一个要便宜700美元

@普林斯顿陈老师-文书辅导 建議領養代替購買？
EASEL Animal Rescue League, Shelter, & Pet Adoptions 4.4 * (249) • Animal shelter in Ewing
(unincorporated community), New Jersey • Closed
4 Jake Garzio Dr, Ewing Township,
NJ 08628
1.9 mi
(609) 883-0540

另外有狗的group lesson 或者 private training lesson 介绍吗？以前只养过15-25 lb 的中型小狗。现在的小狗是三个月大，20 lbs. 以后会长到60或者70 lbs. 只知道green leaf pet resort 有training course. 普通狗的训练，一共$2600 走读。

好像普村和周边几个town 警察局的狗有从这个resort 训练出来的，他们也做普通狗礼貌训练。只是在six flag 那里。每天开车接送比较困难

我们家狗狗也是力气大精力旺盛调皮，我们刚开始在Heavenly Hounds Dog Training 上课，班上倒都是大狗狗，效果要等多上几次再来反馈了

大家好，求推荐宠物医生和保险 
Caring hearts animal hospital at Montgomery  @Han 

兩個多月前發現我家十二歲的狗狗要做一個不小的手術，便打聽搜尋好的獸醫，最後找到了下面這家。今日剛拆線，非常滿意。

MONROE
ANIMAL HOSPITAL
Steven E.Hornstein,DVM
Medical Director
179 Prospect Plains Road, Monroe, NJ 08831 drsteve@monroevet.netwww.monroevet.net
609-655-1717

Dr Hornstein owner and medical director of the Monroe Animal Hospital He was President of the New Jersey Veterinary Medical Association

Dr. Ben Staiger is a highly
versatile surgeon with than15 years of experience

求推荐，dog boarding（短期照看小狗）

上Rover.com或者找Ainla, (609) 480-7521

A door pet
100-125 dollars a day to have someone sleep in your house to watch the dog
+1 (609) 799-3111

普林斯顿高中生初中生M&M组合照顾狗或者宠物
PetLovers08540@gmail.com
一天可以去三次，一次1个小时15美元，照顾狗，带狗散步玩球。要求距离Princeton Community Pool骑车不超过15分钟，超过这个距离要加接送费用5美元。

请问有宠物理发的推荐吗？
Pamper your pet from head to paws, book a
bath or grooming service now >
609.259.1900
8 Sharon Road, Robbinsville, NJ 08691.
我们家80磅，上次去是12/23，好像$140左右含税含小费，但他们说今年要涨价了

想问群里谁有没有认识的靠谱宠物医生在新泽西或者纽约@木木 Dr. Alan Farber of Manalapan is excellent 

Hopewell Veterinary Group , NJ
Dr. Mark Smith

    `,
  },
  {
    id: 49,
    title: " 烟囱和Gutter清扫和修理",
    content: `
    *******大普林华人生活群信息: 烟囱和Gutter清扫和修理 ***************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

vent and chimney cleaning
Gutter cleaning and repair/build
Gutter Cleaning	
Tom +1 (267) 257-4742
我们用的gutter clean $150 flat price

 cleaning of dryer vent and inspection of chimney vents. 这是家父子个体户公司。hvaccleaningspecialists.com    dryer vent cleaning 10家+ , $100 per house.              Chimney/furnace vents inspection, $35/house.           Total $135/house                          Online rating by customers, Excellent. No complaint on BBB.
HVAC Cleaning Specialists
10家以上报价：
(1) dryer vent cleaning  $100/house.              
（2）Chimney and (or) furnace vents inspection, $35/house.  
Total $135         

 Z-Best Management (和US Air Management是同一家老板 )是2022年用过的，15家以上报价：
（1） dryer vent cleaning + chimney inspection ， 共 $70
（2）如果需要chimney cleaning，加$70

U&B Outdoor services
$120
U&B Outdoor services! We specialize in gutter cleaning minor gutter
installation and repairs, 

问下群里有gutter cleaning 公司推荐吗？ 
Gutterman
(609) 921-2299
863 State Road. 9       
PrincetonNJ08540 USA
$125 for Cleaned and flushed all gutters11/19/2018
@刘敏芝 我用的⬆️

群里谁能帮我推荐个gutter cleaning company? 谢谢🙏
Bruce Davies Aka Gutterman
Gutterman

大家早上好！请问有暖气管道检查的公司推荐吗？
AJ perry 
@Xin Tao @Mr.Zhao 建议不要用AJ Perry. 不得不用时，也要多请2家公司竞标
是的，多问几家询价，差异特别大

sign up PSEG worry free program. 15 天后，让他们过来检查，检查和维修费用全cover
@樱花时节 最好加入PSEG Worry free Program, 一个月三件电器十几元，打电话他们随时来收，临时叫外面人修，出来一次没毛病至少二百。

以前让princeton air 做过，挺贵的

USA Air
908) 731-7090
(877) 811-5131
1个zone 全包$350，加一个zone 多$200

(609) 577-4658
PROCLEAN
AIR DUCTS
DRYER VENT CHIMNEY

732-372-0001
A+AIR Dryer Vent & Chimney Cleaning
1(855) 922-2233

1(800) 727-7121
Air Duct Cleaning	Pro Clean	
732-372-0001

AIR DUCT DRYER VENT&CHIMNEY
CLEANING&INSPECTION1-855-922-2233
$75

请问大家air duct vent是空调管道吗？请问空调管道清理有推荐吗？
Deep Impact
Air Cleaning Dryer Vent Cleaning
908 431-7601

Z-BEST MANAGEMENTINC
Z-BEST MANAGEMENT       DUCT &DRYER CLEANING SERVICES   
WWW.USAAIRMANAGEMENT.COM        (877)811-5131(908)731-7090      26383   
70-75 dollars for inspection and cleaning if bought with a large group

AIR DUCT DRYER VENT&CHIMNEY
CLEANING&INSPECTION1-855-922-2233
$75


请问有修gutter的推荐吗？
JCL
973277 7819     Owner: Juan     
@Han ，这个价格不贵

Chimney Sweeps	St John	
609-737-0133

Chimney & Roofing Specialists
Advanced Aardvark Air Duct Cleaning
6099181818
这家不少人推荐

Chimney Sweeps Unlimted
609 730 4190

6095863344
chimney

Jameson 
Chimney Repair and Fireplace Restoration
3092 Shafto Rd #14, Tinton Falls, NJ 07753, USA
mjamesoncontractors@gmail.com
800-992-1019

chimney修理
Chimney contractor effective pros
732-978-9444
201-907-7348
打通了给我报价2600 我还是找的自己联系的那家

chimney修理
St. John Chimney Sweeps
1613 Reed Road
Pennington NJ 08534
609-737-0133
www.stjohnchimney.com
是1900 St. John chimney sweeps


@optimist_too 我家烟囱基本不用，烟囱帽的金属边有点生锈了，本想刷一下漆。就让Trent roof报价，他们说把配件都换了，要1200多，没提能不能刷漆。能推荐一下您家过来给烟囱刷漆找的哪位吗？还有如何收费，谢谢

Trenton Roof 换了一个烟囱的盖子（那种防鸟做窝）。很小的事情。然后把烟囱油漆了一下（给他们“加一点油”。这样师傅来一趟总得值回他的汽油钱）。
我们以前用过Trenton Roofing, 还不错
用过这一家，服务规范、快
是的，比较了三家后用了Trenton Roofing and siding，他家价格最低，隔天看过屋顶后，交一半定金，一周后就换好了
Trenton Roofing and siding价格公道活干的也利索，一个上午就能干完
汇报一下最近换房顶的情况：trenton roofing最快最靠谱、报价中等。那个double d roofing不推荐。一堆sales strategies然后报价很高还不屈不挠电话邮件短信轰炸。我家是18年的roof也没漏也没咋的、就是有几片singles做的不好、inspector不建议换、建议修。但没有哪家是说可以不换的。估计现在生意好、修就屋顶这种小活儿都不想接。但double d感觉不靠谱。
609 393-6780
trentonroofing.com
Trenton不会修屋顶，只换屋顶
@Yuki 我们找到那个quote, 还是Trenton Roofing 在2021年一月做的。$375。他们当时说他们很忙，这个项目太小（不够填牙缝的），他们有空时才会来。后来大约一周左右就来做了。

我们用的这个https://makconstruction.com/roofing/@DingDing 

有认识清理烘干机管道的人吗？
Apex Air Duct (Alex)
(732) 257-4590 mobile
我用過 Apex,清了整個屋子的通風管道，他們順便送了清烘乾機管道的服務。
我是疫情前請他們來的，要看你家有多少個通風口，HVAC主機要收一個基本費，基本上一個房子要收$300到$500吧， 他們收私人支票，沒有收信用卡的機器，你可以先打給他們，問現在收費如何，疫情後萬物皆漲價

如果有用到壁爐，清潔公司建議每隔一年在春初做一次清潔+提供檢查報告（冬天蜘蛛喜歡在壁爐通道中安家立業、生產），若不用壁爐，則2-3年清潔一次，畢竟大家都不喜歡家中有蜘蛛，總共收費為$198+稅，大約1小時的活。                                                    
又清潔整個房子的air ducts,       1-zone $300+稅， 2-zone $600+稅，都附送清潔 dryer vent, 如果只來清潔dryer vent $95+ 稅, 他們都會提供檢查報告。
AIR DUCT CHIMNEY DRYER
DUCT TECHNOLOGY, LLC.
973-628-8760
WWW.DUCTENVIRO.COM • DUCTENVIRO@AOL.COM
請問群友有沒有用過 做 fireplace integration inspection （check fireplace function, cleanness…）的人才或公司可以介紹？
Fireplace integrity inspection 
謝謝你！ 群主!  朋友已介紹一個公司， 明天正好在我們家附近服務，所以明天正好順道來做我家，收費也很合理，$95+ 稅， 主要是我們小城需要這個安全報告，才肯給我們 CO.
Duct Technology  973-628-8760 Saraa


有人推荐修gas fireplace的公司么？试了一家Ace fireplace service, 差评！！本来问题是烧一会儿自动停，要再开一次。他来了inspection半天, 说可能气不足，调大了气。第二天干脆一点儿也打不着火了

Bowden's in Hamilton is great. They installed one gas fireplace for me many years ago and they now come out to clean it.
6095863344

    `,
  },
  {
    id: 50,
    title: "洗地毯",
    content: `
    *******大普林华人生活群信息: 洗地毯************************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15

Car deep cleaning											
We've used this company several times. They've done an amazing job cleaning the aftermath of the parties my kids had in my car 😂http://allclassdetailing.com/contact-us/

Carpet Recovery Plus

Peter Carpet Cleaning
message call    video   mail    
phone
(732)398-9898

Carpet cleaning
Peter 732 398 9898
洗地毯的，他不错

有推荐洗地毯的师傅吗？
@靖华 David 646-651-2612

@Sherry   Pristine Carpet Cleaning. Chuck 609 462 2844

@Lily Chen_普林斯顿 洗地毯推荐 Amer carpet cleaners, Jack Wang 609-610-1035

Avon Carpet Cleaning
(609) 448-7772


Jack Wang Carpet Cleaning
+1(609) 610-1035

    `,
  },
  {
    id: 51,
    title: "学校选择",
    content: `
    *******大普林华人生活群信息: 学校选择************************
为服务大普林地区的居民，本群定期发送生活服务信息，全是群主在各个微信群收到的微信信息集中，完全基于个人推荐，无法保证信息真实，用前请货比三家。也欢迎各位群友发送评论和信息，及时登出反馈。群主微信号：yalichen15过两个月要搬去Princeton了、求推荐daycare，最好是双语的

如果要雙語的，那大概就是Yinghua International School了

Pre-K
如果要中英雙語的，那推薦Yinghua International School

如果要budget friendly的、時間彈性的，推薦Princeton Community Family Learning Center （the Cub school)
雖然便宜，但老師和director很優質

另外The Learning Experience - Princeton和Knowledge Beginnings Princeton (Kindercare) 也聽說不錯。

Princeton community family learning center是不是一个教会学校？
@Zoe Yang 是蒙校 但不是教会学校

我記得YWCA有daycare 和 after school care (不是YMCA, 名字容易搞混)
Princeton公立學校的課後托兒和一部分的preschool 班級 就是YWCA 提供的。
可以參考它的網站：https://www.ywcaprinceton.org/childcare-princeton
(Princeton public preschool 有一部分的班級是跟私立daycare合作：分別在Cub School 和 YWCA 有兩個班。 因為公立小學教室不夠。）
信息更正
PPS preschool 今年新增3个班，分别在Pannell （CP）和 Redding Circle (LB)

YWCA的Daycare是叫The Burke Foundation at YWCA Princeton。 （名字太多，挺混亂的）

如果你已經有租房子的lease 或 房屋的deed就可以申請。
Princeton public preschool是要抽籤的，但如果他們學生沒有額滿的話，就還會接受新學生。

如果沒空位的話，也可以先去the Cub school 的private daycare班 ,等明年2月報名抽籤，大概就能抽上public preschool 。
(Princeton public preschool 有一部分的班級是跟私立daycare合作：分別在Cub School 和 YWCA 有兩個班。 因為公立小學教室不夠。）

Cub School 是2.5歲-6歲。
YWCA 是2個月大 - 6歲的樣子。
（免費的public school program是三歲和四歲。學區年齡劃分是9月30日。）

    `,
  },
  {
    id: 52,
    title: "跳蚤市场",
    content: `
请问附近有没有跳蚤市场 可以卖二手东西的 
Englishtown or Columbus Farmers Market.
请问附近有没有跳蚤市场 可以卖二手东西的 
离这里不远Lamberville Golden Nuggets Flea Market (星期三，六，日开）。另外Lambertville, NJ和Delaware 河对面New Hope, PA有几个古董店卖挺有艺术气息的东西（绘画，家俱，收藏品等等。不便宜，确实是好东西）。

今天在教会 一个朋友说可以去这里买二手儿童产品：https://mercercounty.jbfsale.com
      `,
  },
  //   {
  //     title: "",
  //     content: `

  //     `
  //   },
  //   {
  //     title: "",
  //     content: `

  //     `
  //   },
  //   {
  //     title: "",
  //     content: `

  //     `
  //   },
];
